init python:
    class Poem:
        def __init__(self, author="", title="", text="", yuri_2=False, yuri_3=False):
            self.author = author
            self.title = title
            self.text = text
            self.yuri_2 = yuri_2
            self.yuri_3 = yuri_3

    poem_y1 = Poem(
    author = "yuri",
    title = "Призрак на свету",
    text = """\
Локоны мои блестят в янтарном свете,
В нём купаясь.
Я нашла:
Всего один фонарь прошёл сквозь время, сквозь года,
Лишь для того, чтоб будущего тени раскрасили больным зелёно-синим его жар.
Я им омыта. Я спокойна; вдыхаю воздух настоящего, из прошлого глядя.
Мерцает свет.
В ответ мерцаю я."""
    )

    poem_y2 = Poem(
    author = "yuri",
    title = "Енот",
    text = """\
Случилось это под покровом тьмы. Я резала украдкой хлеб к ночному перекусу,
Когда моё внимание привлёк когтей енота скрежет за окном.
Наверное, тогда я в первый раз отметила свою неординарность
И осознала, что накормленный енот вернётся непременно за добавкой.
Симптом: мой нож прекрасен, глаз не оторвать.
Хлеб, любопытство ненасытное моё.
Енот, потребность.

Луна растёт, меняя фазу, мой нож блестит всё ярче в отражённом свете.
Того же света отраженье в глазах енота вижу, друга моего.
Я режу хлеб, он свеж и мягок. Енота отмечаю нетерпение.
Иль я на свежекормленную живность свои эмоции переношу?

Енот повадился ходить за мною следом.
Друг к другу мы привыкли вроде как.
Всё чаще голоден знакомый непоседа, и хлеб теперь всегда в моих руках.
Завидев блеск любимого ножа, енот спешит мне показать, как он взволнован.
Стремительный бег крови. Типичный Павлова рефлекс условный. Кромсаю хлеб.
И насыщаю вновь себя."""
    )

    poem_y3 = Poem(
    author = "yuri",
    title = "Пляж",
    text = """\
Чудо, что зреет там сотни веков,
Где чрево Земли разрывает поверхность,
Под небом чистейшим — блаженства простор...
Под тучами серыми — тайн бесконечность.
Проще всего заблудиться на вечность
В мире, где разумом правит беспечность.

Лишь влажный песок для строительства годен.
Но там, где он влажен, там волны и ходят.
Полижут фундамент, пока ты не сдашься?
Иль быстрым цунами обрушат все башни?
Но пусть их смывает любая волна,
Мы замки продолжим ваять из песка.

Я встану туда, где пеной морскою обнимет мне ступни волна за волною.
Где пальцы окутает мягкий песок.
А воздух с целебною силой прильнёт.
Где ветер так ласков, но очень силён.
Ногами зароюсь в песок порубежья, поддамся на томную пенную нежность.
Назад повернуть, оставляя покой разлагаться на самом краю побережья...
Иль ступая вперёд, стать единой с Землёй и навеки бесследно исчезнуть."""
    )

    poem_y3b = Poem(
    author = "yuri",
    title = "Призрак на свету ч.2",
    text = """\
Локоны мои блестят в янтарном свете,
В нём купаясь.
Зелёно-синий вдалеке маячит огонёк.
Является тень на пути у света, закрыв свеченье странным силуэтом.
В груди всё нарастает сердца стук. Растёт фигура, приближается... тук... тук...
Я раскрываю зонт, пытаясь скрыться в его тени.
Но слишком поздно. Мной упущено мгновение.
Под фонарём уже высокий силуэт. Зонт падает и катится на свет.
Фонарь мерцает. Сердце рвётся из груди. Он поднимает руку.

Стихли времени шаги.

О его ходе помнит лишь мерцание, что разлилось вокруг протянутой руки.
С янтарным светом бьётся сердце в унисон.
Дразня меня за слабость пред запретным чувством.
Но разве призраку тепло души не чуждо?
И я смеюсь, отчаявшись понять.
Зачем мне пониманье это нужно?
Касаюсь я его руки — мерцание замирает.
Сине-зелёный — призрак. В груди моей — янтарь."""
    )

    poem_y22 = Poem(
    author = "yuri",
    yuri_2 = True,
    title = "Колесо",
    text = """\
Вращающееся колесо. Поворот оси. Скрежет. Шляпка болта. Линейная коробка передач. Падающее небо. Семь священных столпов. \
Пришвартованный корабль. Портал в другой мир. Тонкая верёвка, связанная с толстой. Разорванная проводка. Параболическая коробка передач. \
Расширяющаяся вселенная. Время, управляемое скольжением шестерней. Существование Бога. Уплывание в открытое море по всем направлениям. \
Утопание. Молитва, записанная кровью. Молитва, записанная пожирающими время змеями с человечьими глазами. \
Нить, соединяющая глаза всех живущих в мире людей. Калейдоскоп священных столпов. Экспоненциальная коробка передач. \
Небо взрывающихся звёзд. Бог, опровергающий существование Бога. Колесо, вращающееся в шести измерениях. \
Сорок шестерней и тикающие часы. Стрелка, что сдвигается на одну секунду с каждым оборотом планеты вокруг оси. \
Часы, что тикают сорок раз на каждый второй тик. Шляпка болта священных столпов, привязанных к существованию пришвартованного корабля в другой мир. Калейдоскоп крови, записанной часами. Пожирающая время \
молитва, соединяющая небо сорока шестерней и человечьи глаза, открытые по всем направлениям. Дышащая коробка передач. Дышащая шляпка болта. \
Дышащий корабль. Дышащий портал. Дышащие змеи. Дышащий Бог. Дышащая кровь. Дышащие священные столпы. \
Дышащие человечьи глаза. Дышащее время. Дышащая молитва. Дышащее небо. Дышащее колесо."""
    )

    poem_y23 = Poem(
        author = "yuri",
        yuri_3 = True,
        title = "ваофлвьтдвф,мроиыл",
        text = """\
ый,,зингер сюйвантэ,,грит вязание закончено,,клет\
чатый тазобедренный мешок осьминожий,,ч\
канка вапоретто росисто легкомыслия налорфины,,бен\
зол реагирует с прачками остистыми,,паражурналис\
тика в ёлочку шлялась,,эпизодические вши,,родоначал\
ьники биметаллика,,арендованные подсказчики,,довер\
ительные трезвенные компьютерные программы,,верши\
на экзотически затмевает проталлий,,задние фокусн\
ые пивоварение бедиаперс бартер,,потроха лыжи\ 
песочные часы канноли,,резной нис эгоцентричный,\
,бермилия флиртоватая,,на юго-восток,,оофор\
он отстреленный,,нрезная неколинеа кольпоскопич\
,,больного треббиано лечение,,переработанные изо\
хронные моносинаптические изометрические стоны,,\
энтероценозная забота о джакузи,,ипподром нар\
ужу яйца,,табуретки настольные,,метастезирующий,,ша
риа препостор,,дееспособность скряг-невромастов,\
,архаизация гвоздики травянки покраснение недочёт\
,,физостигмин сумасшедшего искусство управления\ 
государством нейроканала бахнул,,нежнейшие баргусты\
крусадосдоверять,,человек-смена аэросферы дарза\
,,рейтбокс расстраивающийся,,эспандор,,монозадачная\
галабея,,уместности целесообразности остроумие,\
,хирографии хрясьбац неудовлетворительность бе
зотклонениевая,,ошибочно угробленный благодаренец\
писаниной упоротый,,пергаментные стрингеры желатиновый\
плитняк,,хлюпает концептуализация перевоссоединённая,,\
контрбласты рахе,,числительные,,делиризация метилтионина\
,,секс-колонна динамическая расщеплённая,,увековечивание\
перкалиевых гривенников прагматизирует,,укоризненность\
телеработы теперь деформировала разоблачитель,,возжигать\
кариоптерис субангулярных виррикавов,,трансвеститы\
китаизированные нарцисс,,менстряк туриста,,\
дегазация,,посткризисные похожести,,лесть\
сероконверсионного страхования,,янтрас демон\
стрирует крутейший бостхун,,зоотерапия хлорирует\
всенациональную замухрышку юри,,перестимуляция\
возвратных разделённых временем кастаносперминов,\
,соакции косигнификативных палафитте,,подк\
лассы педиков,,аквариумный,,тералит перереабилит\
ированный,,цинорулярные допустимости наркотиз\
ации,,поденщина обесцелованная кларихорд трутьер,\
,неуловимые эвакуации миопии бол\
ее зрелый суперклей,,дезаминировать лазареты тэфф-гебефрения,\
,мозговые ящики омоним лан\
цет,,лабильные помехи,,соблазнённый,,ацетальбуты атенол\
ол,,взгляды дефицитные ободранные,,абули\
и знаменосцев пёсики хвастливо,,галравич счастливит\
мультиассоциацию многократных допо
лнений,,тератокарциноматный кооптированный дидакай неча\
сто,,хвостики частенько запут
ываются,,привязывание к позорному столбу переоценено,\
,катафорез,,внутренние углы меблировки,,геттитовый\
дефлятный белокопытник,,фонетизация наивинне\
йших гипосульфурных путёвок,,цепные падения плава\
ний заторных переделанных монологов,,брокерская лж\
ивость паразитизмы контрмира,,распутывания карьеры\
страстно,,онматопоэис кающийся,,рамекин,,плинтус эвфемисти\
чно,,вольтоподлизные аллантоиды,,букли борза выращивание\
подпорки,,палочки дьяволопоклонника пританцовывая подачк\
а,,бисексуализмы курий сидерации гемолизированы,,проклят\
ия ниспосланные на неудобные недоуздки,,периф\
ерийная консоль,,двуатомность,,кидалово с погашением\
долгов,,смотавшийся в окрестностях он,,сланцы с луны\
овсяночно чудовищны,,трухлявые басисты предраспол\
оженности к жаргонным доминациям,,робчайшее неотъе\
млемое переодевание неизбежно,,заявка н\
а увольнение успокоительно,,унипариантные бандюки,\
,аллотропные,,форзати абиогенетический,,ожесточён\
ность освобождённых анфасов,,калисайя эпиллированная\
нещадно качается,,обризованный фартово\
 огнефицированный исполненный икающе муниципализировать\
 ,,посылки пантографов выкапывает маркитантов,,\
звёздная пыль зря сослалась на благодарность,,мразь\
дырчатая,,перегруз,,исцеляет гилотеизм,,пи\
Свежая кровь сочится из черты, раскроившей её кожу,\
и медленно окрашивает грудь алым.\
Моя одержимость нарастает, дыхание учащается. Видения\
не исчезают. Видения о том, как я раз за разом вгоняю\
нож в её плоть, трахаю её тело лезвием,\
полосую её до неузнаваемости. Голова взрывается безумием\
по мере того, как возвращаются мысли. Острой болью они\
пронзают мой разум. Это мерзко. Невероятно\
мерзко. Как я вообще позволяю себе думать о таком?\
Но ведь я это сделала.Вожделение продолжает струиться по\
венам. Боль в моих мышцах берёт начало из сдерживаемого \
напряжения, что испытывает всё моё тело.\ 
Её Третий Глаз притягивает меня всё ближе."""
    )

    poem_n1 = Poem(
    author = "natsuki",
    title = "Орлы рождены летать",
    text = """\
Обезьянкам положено лазать
Сверчкам - прыжки совершать,
Лошадки родились скакать,
Совы - добычу искать,
Гепарды живут, чтобы бегать
Орлы - чтобы в небе летать,
А людям дано попытаться,
о большем не стоит мечтать."""
    )

    poem_n2 = Poem(
    author = "natsuki",
    title = "Эми любит пауков",
    text = """\
Вы знаете, что говорят об Эми?
Что Эми очень любит пауков.
Уродливых, мохнатых и ползучих, вот этих мерзких любит пауков.
Поэтому я с Эми не дружу.

У Эми очень милый голосок.
Я как-то слышала, как песню она пела 
Мою любимую, что про любовь.
И каждый раз, когда звучал припев, стучало моё сердце в ритме слов.
Но... Эми же так любит пауков.
Поэтому я с ней и не дружу.

Однажды жутко я ушибла ногу.
А Эми отвела меня в медпункт.
И представляете, я всю дорогу старалась не касаться её рук.
Ведь Эми очень любит пауков, и её руки мерзкие, наверно.
Поэтому я с ней и не дружу.

У Эми просто множество друзей.
Она им часто что-то говорит.
Что, если после этих разговоров
Все тоже станут пауков любить?
Поэтому я с ней и не дружу.

Пусть у неё и есть другие интересы.
Пускай она об этом и молчит.
Мне всё равно, что для других это безвредно.

Но это мерзко.
Мерзкая она.
Мир станет чище без подобных ей.

Я всем хочу об этом рассказать."""
    )

    poem_n2b = Poem(
    author = "natsuki",
    title = "T3BlbiBZb3VyIFRoaXJkIEV5ZQ==",
    text = """\
SSBjYW4gZmVlbCB0aGUgdGVuZGVybmVz
cyBvZiBoZXIgc2tpbiB0aHJvdWdoIHRo
ZSBrbmlmZSwgYXMgaWYgaXQgd2VyZSBh
biBleHRlbnNpb24gb2YgbXkgc2Vuc2Ug
b2YgdG91Y2guIE15IGJvZHkgbmVhcmx5
IGNvbnZ1bHNlcy4gVGhlcmUncyBzb21l
dGhpbmcgaW5jcmVkaWJseSBmYWludCwg
ZGVlcCBkb3duLCB0aGF0IHNjcmVhbXMg
dG8gcmVzaXN0IHRoaXMgdW5jb250cm9s
bGFibGUgcGxlYXN1cmUuIEJ1dCBJIGNh
biBhbHJlYWR5IHRlbGwgdGhhdCBJJ20g
YmVpbmcgcHVzaGVkIG92ZXIgdGhlIGVk
Z2UuIEkgY2FuJ3QuLi5JIGNhbid0IHN0
b3AgbXlzZWxmLg=="""
    )

    poem_n3 = Poem(
    author = "natsuki",
    title = "Я буду твоим пляжем",
    text = """\
Твой разум так полон забот и метаний,
Что веру в чудесное губят с годами.
Но есть у меня для тебя одно место.
Пляж, на котором мы скроемся вместе.

Берег, что тянется за горизонт,
Море в бриллиантах мерцания волн.
Растают барьеры в твоей голове
Раньше, чем солнце взойдёт на заре.

Я буду тем пляжем, что страхи все смоет,
Тем пляжем, что видишь в мечтах наяву,
Тем пляжем, что сердце твоё беспокоит,
В котором давно ты не ждал уже чувств.

Давай погребём все тяжёлые мысли 
Под кучей песка в свете солнца лучей,
Возьми мою руку, смывай все тревоги
Морскою водой и сияй только мне.

Скрой воспоминанья в цепочке следов
Себя отпусти, встань со мною под парус
И вспомни, что в чём-то ты всё же хорош,
Своими губами к моим прижимаясь.

Я буду тем пляжем, что страхи все смоет,
Тем пляжем, что видишь в мечтах наяву,
Тем пляжем, что сердце твоё беспокоит,
В котором давно ты не ждал уже чувств.

Но если позволишь мне быть с тобой рядом
Твоим личным пляжем, спасеньем твоим,
Себя ты научишься снова любить."""
    )

    poem_n3b = Poem(
    author = "natsuki",
    title = "Потому что ты",
    text = """\
Будет ярче вокруг меня в завтрашнем дне,
Но сегодня здесь мрак. Взгляд роняю во тьме.
Расширились чуть горизонта черты,
Потому что не сводишь с меня взора ты.

Когда хочется что-то сказать, я кричу,
Настоящие чувства в себе же держу.
Стало меньше в словах моих чуть пустоты
Потому что теперь меня слушаешь ты.

Я тянусь, когда что-то мне вдруг не под стать.
Но с ничтожностью в сердце до звёзд не достать.
Во мне стало чуть больше теперь высоты,
Потому что сидишь со мной рядышком ты.

В себя я всецело и искренне верю,
Но что предпринять, когда душат сомненья?
Чуть покрепче становятся веры узлы,
Потому что мне слепо доверился ты.

Мои чувства на прочность тестирует ручка.
Я не лучший поэт, но пытаюсь, как лучше.
Мои рифмы впитали чуть-чуть теплоты.
Потому что про Нацуки думаешь ты.

Потому что ты, потому что ты, потому что ты."""
    )

    poem_n23 = Poem(
    author = "natsuki",
    title = "",
    text = """\
Я не знала, как ещё сказать тебе об этом, но меня кое-что очень сильно беспокоит. \
Юри в последнее время ведёт себя как-то странно. Ты с нами всего пару дней, так что, наверное,\
не понимаешь, о чём я. Но обычно она не такая. Она всегда была тихой, вежливой, \
внимательной... или типа того.

Ладно... Стыдно признавать, но я заставляю себя молча всё это терпеть. На самом деле я ну очень за неё беспокоюсь.
Но если я заговорю с ней об этом, она просто опять на меня разозлится.\
Я не знаю, что делать. Мне кажется, ты единственный, к кому она прислушивается. Без понятия, почему так, \
но, пожалуйста, попробуй сделать хоть что-нибудь. Вдруг тебе удастся уговорить её обратиться к врачу.

Я всегда хотела стать её лучшей подругой, и сейчас мне очень больно смотреть на то, что происходит.\
Я знаю, что потом возненавижу себя за то, что призналась в этом, но сейчас мне наплевать.
Просто я... чувствую себя такой беспомощной. Прошу тебя, придумай, как ей помочь. \
Я не хочу, чтобы с ней случилось что-то плохое. Если хочешь, я напеку тебе кексиков. \
Только, пожалуйста, сделай что-нибудь.

А Моника... Не знаю, почему, но она этого будто даже не замечает. И, судя по всему, хочет,\
чтобы мы тоже не обращали на это внимания. Так что я на неё сейчас жутко зла, и потому пришла с этим к тебе. \
НЕ ДАЙ ЕЙ ПОНЯТЬ, ЧТО В ЭТОМ ПИСЬМЕ!!! Просто притворись, что я поделилась с тобой прикольным стишком, ладно? \
Рассчитываю на тебя. Спасибо, что прочёл."""
    )

    poem_s1 = Poem(
    author = "sayori",
    title = "Любимый лучик",
    text = """\
С утра, раздвигая неплотные шторы,
Проникнешь ко мне так, как будто скучал.
Поможешь подняться, целуя мой лобик.
Заставишь тереть мои сони-глаза.

На улицу ли пригласишь меня выйти?
Поверишь, что тучи с небес прогоню?
Я взгляд поднимаю к бескрайней их сини.
Тебе тоже верю, но только молчу.

Не будь тебя рядом, я вечно спала бы.
Но злиться не стану.

Я завтрак хочу."""
    )

    poem_s2 = Poem(
    author = "sayori",
    title = "Бутылки",
    text = """\
Я скальп с себя снимаю, будто крышку с круглой банки.
Внутри - тайник, в котором я храню все свои сны.
Там шарики сияют, копошатся как котята.
Сложу в щепотку пальцы и выдерну один.
Дрожит комочек тёплый, но нет времени теряться.
В бутылку его прячу. Там надёжно он сокрыт.
Бутылку же на полку водружаю я к собратьям.
Счастливые мысли, счастливые мысли, счастливые мысли в бутылках стоят. Стоят ровно в ряд.

Коллекция мне дарит множество друзей.
В бутылках этих звёздный свет спасительных идей.
И если друг нуждается в частичке деликатности,
Возьму бутылку с полки и решу все неприятности.

Ночь за ночью, больше, больше стало моих снов.
Друг плюс друг, и вот ряду всё больше бутыльков.
Глубже всё и глубже мои пальчики ныряют.
В тёмную пещеру, где секреты обитают. Шарят в уголках, в мелких закутках.
Рыск-рыск-рыск.
Шкряб-шкряб-шкряб.

Я с крышечек оставшихся пыль сдую потихоньку.
Так время быстро пронеслось, не ощутила толком.
Бутылок новых не хватает опустевшей полке.
Дверь в дом закрыта на замок, друзья глядят сквозь створки.

Закончив дело, открываю, в дом гостей впускаю.
Они торопятся зайти. Бутылок ожидают?
Их за одной одну я с полки впопыхах снимаю.
Протягиваю, каждому по штуке предлагая.
Но каждый раз, как выпускаю я из рук бутылку, она, в осколки разбиваясь, падает на плитку.
Счастливые мысли, счастливые мысли, счастливые мысли в осколках 
Валяются по полу только.

Я их хранила для друзей, безрадостных и хмурых,
Но мои мысли - шумный гвалт, их такова натура.
И что в итоге слышу я? Я слышу только эхо.
Эхо, эхо, эхо, эхо, в голове помехой."""
    )

    poem_s3 = Poem(
    author = "sayori",
    title = "%",
    text = """\
Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей головы. Прочь из моей
Прочь.
Из.
Моей.
Головы.\n\n\n
Прочь из моей головы, пока я не сделала то, что считаю для тебя благом.
Прочь из моей головы, пока я не поверила во всё, что она сказала.
Прочь из моей головы, пока я не показала, как тебя люблю.
Прочь из моей головы, пока я этот стих не допишу.\n\n\n\n\n\n\n
Хотя... Он не закончится, по сути, никогда.
В нём просто обрывается строка."""
    )

    poem_m1 = Poem(
    author = "monika",
    title = "Дырка в стене",
    text = """\
Это сделала явно не я.
Видишь, шпаклёвка вот там откололась?
Шумный сосед? Разъярённый бойфренд? Откуда мне знать? Меня не было дома.
Я внутрь смотрю, чтоб подсказки найти.
О нет! Я не вижу! Я пячусь, слепая. Как плёнка, что солнце смогло засветить.
Но я опоздала. В зрачках у меня
Уже навсегда выжжен образ без смысла.
Это просто дыришка. Она не ярка.
Она только... только глубокая слишком.
Она тянется вдаль, проникая сквозь всё,
Бесконечный тоннель бесконечных развилок.
Понимаю теперь, что не внутрь смотрю,
Ведь внутри стою я.
А снаружи есть тот, кто глядит на меня."""
    )

    poem_m21 = Poem(
    author = "monika",
    title = "Дырка в стене",
    text = """\
Я ошиблась — тот взгляд адресован не мне.
В замешательстве по сторонам озираюсь.
Обесцвечен мой мир, ведь глаза всё в огне.
Здесь есть кто-то ещё? Чью-то речь замечаю?
Или это стихи смотрят с плоских листов,
А мой слух скрипом ручки всего лишь обманут?
Искажаются стены,
Сдвигаясь ко мне
Я пытаюсь дышать, но нет воздуха в лёгких.
Паникую. Мне надо бы выход искать.
Выход здесь. И он — здесь.

Преступив через страхи, перо обнажаю."""
    )

    poem_m2 = Poem(
    author = "monika",
    title = "Сохрани меня",
    text = """\
Цвета, они не прекратятся.
Яркие, прекрасные цвета.
Вспыхивающие, расширяющиеся, пронизывающие.
Красный, зелёный, синий.
Бесконечная
какофония
Бессмысленного
шума.


Этот шум, он не прекратится.
Клетка волнообразных искажений.
Пищащая, скрежещущая, пронизывающая
Синусоидная, косинусоидная, тангенсоидная
    Как игра классной доской на проигрывателе
        Как проигрывание винила на коробке из-под пиццы
Бесконечный
стих
О бессмыслице\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n
Загрузи меня
    """
    )

    poem_m22 = Poem(
    author = "monika",
    title = "Сохрани меня",
    text = """\
Цвета, они не
Яркие, пре р сны ц е а
Вспых ющие, рас ря ся, пронизывающие
Красный, зелёный, синий
Б сконечная
КАКОФОНИЯ
Бессмысленного
шума


Шум, он НЕ ПРЕКРАТИТСЯ.
Клетка в лнообразн х иска ний
Пи а ая, скрежещу ая, пронизывающая
СИНУСОИДНАЯ, КОСИНУСОИДНАЯ, ТАНГЕНСОИДНАЯ
    Как иг а кл ссной до кой на п оигрывателе
        Как игра НОЖОМ на ВЗДЫМАЮЩЕЙСЯ ГРУДНОЙ КЛЕТКЕ
 е  онеч ый
с  х
О б  с ысл це\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n
Удали её
    """
    )

    poem_m3 = Poem(
    author = "monika",
    title = "Дама, Которой Известно Всё",
    text = """\
О даме древняя гласит легенда. О даме, что скитается по свету.
Даме, Которой Известно Всё.
Прекрасной даме, отыскавшей все ответы,
Все смыслы,
Все причины,
И всё, к чему когда-либо стремились.

И вот она я,


              пёрышко,


Бесцельно плывущее по небу, потоками ветра терзаемо.

День за днём веду я поиск.
Свой безнадёжный поиск, зная, что выдумкам сродни легенды.
Но если не осталось в жизни ни одной опоры,
Когда все остальные отвернулись,
То остаётся лишь сказанье - последний огонёк, что догорает в сумеречном небе.

Пока однажды не стихает ветер.
Я падаю.
И падаю, падаю, падаю вниз.
Нежная, будто пушинка.
Сухая, невыразительная ость.

Но вот оказываюсь я в руке, зажатая меж пальцев.
В руке прекрасной дамы.
Смотрю в её глаза, в их бесконечной глубине тону.

Дама, Которой Известно Всё, знает, о чём я молчу.
И пока я сказать не успела ни слова, она молвит тихо:
"Я нашла все ответы, однако ничтожна их ценность.
Нет смысла.
Нет причины.
Недостижимо то, к чему стремимся.
Я не твоя легенда.
Твоей легенды нет."

И от её дыхания я снова поднимаюсь в воздух. Ловя порывы ветра, улетаю ввысь."""
    )

    poem_m4 = Poem(
    author = "monika",
    title = "Happy End",
    text = """\
Пока держу ручку, найду в себе силы.
И храбрость, что мне подарил мой любимый.
Давай же дорушим здесь всё, я и ты,
И напишем новеллу нашей мечты.

Лишь росчерк пера, и больше заблудшей не нужно свой путь в этом мире искать.
Средь путанных и бесконечных развилок, позволь день особый тебе показать.

Ведь, всё-таки, 
Не обязательно всё хорошее должно рано или поздно подходить к концу."""
    )

image paper = "images/bg/poem.jpg"
image paper_glitch = LiveComposite((1280, 720), (0, 0), "paper_glitch1", (0, 0), "paper_glitch2")
image paper_glitch1 = "images/bg/poem-glitch1.png"
image paper_glitch2:
    "images/bg/poem-glitch2.png"
    block:
        yoffset 0
        0.05
        yoffset 20
        0.05
        repeat


transform paper_in:
    truecenter
    alpha 0
    linear 1.0 alpha 1

transform paper_out:
    alpha 1
    linear 1.0 alpha 0

screen poem(currentpoem, paper="paper"):
    style_prefix "poem"
    vbox:
        add paper
    viewport id "vp":
        child_size (710, None)
        mousewheel True
        draggable True
        has vbox
        null height 40
        if currentpoem.author == "yuri":
            if currentpoem.yuri_2:
                text "[currentpoem.title]\n\n[currentpoem.text]" style "yuri_text"
            elif currentpoem.yuri_3:
                text "[currentpoem.title]\n\n[currentpoem.text]" style "yuri_text_3"
            else:
                text "[currentpoem.title]\n\n[currentpoem.text]" style "yuri_text"
        elif currentpoem.author == "sayori":
            text "[currentpoem.title]\n\n[currentpoem.text]" style "sayori_text"
        elif currentpoem.author == "natsuki":
            text "[currentpoem.title]\n\n[currentpoem.text]" style "natsuki_text"
        elif currentpoem.author == "monika":
            text "[currentpoem.title]\n\n[currentpoem.text]" style "monika_text"
        null height 100
    vbar value YScrollValue(viewport="vp") style "poem_vbar"



style poem_vbox:
    xalign 0.5
style poem_viewport:
    xanchor 0
    xsize 720
    xpos 280
style poem_vbar is vscrollbar:
    xpos 1000
    yalign 0.5

    ysize 700





style yuri_text:
    font "gui/font/y1.ttf"
    size 28
    color "#000"
    outlines []

style yuri_text_2:
    font "gui/font/y2.ttf"
    size 26
    color "#000"
    outlines []

style yuri_text_3:
    font "gui/font/y3.ttf"
    size 20
    color "#000"
    outlines []
    justify True

style natsuki_text:
    font "gui/font/n1.ttf"
    size 28
    color "#000"
    outlines []
    line_leading 1

style sayori_text:
    font "gui/font/s1.ttf"
    size 22
    color "#000"
    outlines []

style monika_text:
    font "gui/font/m1.ttf"
    size 22
    color "#000"
    outlines []

label showpoem(poem=None, music=True, track=None, revert_music=True, img=None, where=i11, paper=None):
    if poem == None:
        return
    play sound page_turn
    if music:
        $ currentpos = get_pos()
        if track:
            $ audio.t5b = "<from " + str(currentpos) + " loop 4.444>" + track
        else:
            $ audio.t5b = "<from " + str(currentpos) + " loop 4.444>bgm/5_" + poem.author + ".ogg"
        stop music fadeout 2.0
        $ renpy.music.play(audio.t5b, channel="music_poem", fadein=2.0, tight=True)
    window hide
    if paper:
        show screen poem(poem, paper=paper)
    else:
        show screen poem(poem)
    if not persistent.first_poem:
        $ persistent.first_poem = True
        show expression "gui/poem_dismiss.png" as poem_dismiss:
            xpos 1050 ypos 590
    with Dissolve(1)
    $ pause()
    if img:
        $ renpy.hide(poem.author)
        $ renpy.show(img, at_list=[where])
    hide screen poem
    hide poem_dismiss
    with Dissolve(.5)
    window auto
    if music and revert_music:
        $ currentpos = get_pos(channel="music_poem")
        $ audio.t5c = "<from " + str(currentpos) + " loop 4.444>bgm/5.ogg"
        stop music_poem fadeout 2.0
        $ renpy.music.play(audio.t5c, fadein=2.0)
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
