init python:
    class Poem:
        def __init__(self, author="", title="", text="", yuri_2=False, yuri_3=False):
            self.author = author
            self.title = title
            self.text = text
            self.yuri_2 = yuri_2
            self.yuri_3 = yuri_3

    poem_y1 = Poem(
    author = "yuri",
    title = "Призрак при свете",
    text = """\
Концы волос моих янтарным блеском промелькнули.
Омовение.
Должно быть так.
Последний уличный фонарь уже давно замкнули. 
Последний, не заменённый противным оттенком в зелёную синеву,
Я омываюсь. Спокойствие... Вдыхаю воздух настоящий, былым покуда я живу.
Мерцает свет.
Ему мерцаю я в ответ."""
    )

    poem_y2 = Poem(
    author = "yuri",
    title = "Енот",
    text = """\
Случилось это поздней ночью, когда (грешна) я нарезала хлеб.
Моё внимание привлёк енот, шумящий за окном.
Это был мой первый раз, когда я поняла, что я странный человек.
Дала еноту хлеба, тревогу вдруг забило подсознание моё.
Предупреждало, что, поев, вернётся за добавкой вновь енот.
Болезнь моя - мой нож блеск соблазнительный несёт.
Хлеб - голод интереса моего.
Енот - желание моё.

Луна сменила фазу, и больше света отразилось в лезвии ножа.
Тот самый свет, что врезался еноту, другу моему, в глаза.
Я отрезала хлеб, что свеж и мягок. Енот немного взволновался.
Или, передав свои переживания зверьку, мне просто показалось.

Енот стал следовать за мной.
Привыкли словно мы друг к другу.
Он голодал всё чаще, не зря готов был хлеб мой.
Когда взмахнула я ножом, енот вдруг показал мне часть испуга.
Прилив крови. Классический рефлекс Павлова. И хлеб я нарезаю.
Кормлю себя я снова, утопая."""
    )

    poem_y3 = Poem(
    author = "yuri",
    title = "Пляж",
    text = """\
Чудо, что создавалось миллионы лет,
Земли утроба встретится с поверхностью извне,
Простор блаженства под чистым небом голубым...
Но под облаками серыми загадок след.
Ведь потеряться проще в мире дней,
В которых можно всё найти самим.

Построить замок можно лишь на влажном песке.
Но туда, где влажен песок, приходит волна.
Коснётся ли нежно тебя, не поддашься пока?
Или ударом внезапным вернётся к тебе?
Итог один и тот же — беспрекословна она.
И мы по-прежнему строим замки из песка.

Стою я там, где море пенится у ног,
Где мои пальцы погружаются в песок.
Морской полезен для здоровья воздух.
Бриз нежен, но силён.
Я погружаю свои ноги в пленящую витками воду.
Коль поверну - разрушу мир, себе не внемля.
Плывя вперёд, я навсегда вернусь на Землю."""
    )

    poem_y3b = Poem(
    author = "yuri",
    title = "Призрак при свете -- часть 2",
    text = """\
Концы волос моих янтарным блеском промелькнули.
Омовение.
Вдалеке мерцает свет зелёной синевы.
Одинокая фигура идёт по дороге - силуэтом зловещее свечение качнув.
Моё сердце стучит. Силуэт приближается всё ближе и ближе в тени.
Я раскрываю свой зонтик, чтобы скрыться от взгляда.
Но всё слишком поздно.
Он выходит на уличный свет. Вздыхаю. Мой зонт начал падать.
Мерцает свет. Моё сердце стучит. Поднял он руку серьёзно.

Остановилось время.

И светит фонарь напротив его вытянутой руки.
Мерцание света с сердца биение сплело.
Запретными чувствами меня вовлеки.
Ты слышал, чтобы призраки чувствовали тепло?
Я смеюсь, не понимая ничего.
Ведь пониманье моё переоценено .
Касаюсь его я руки. Мерцание прекратилось в инерции.
Призраки из зелёной синевы. Фонарь - моё сердце."""
    )

    poem_y22 = Poem(
    author = "yuri",
    yuri_2 = True,
    title = "Колесо",
    text = """\
Вращающееся колесо. Вокруг своей оси. Скрежет. Головки болтов. Линейная коробка передач. Падающее небо. Семь священных кольев. \
Пришвартованный корабль. Портал в другой мир. Тонкая верёвка, привязанная к толстой верёвке. Разорванный жгут. Параболическая коробка передач. \
Расширяющаяся вселенная. Время, контролируемое вращающимися шестернями. Существование Бога. Плавание в открытом водоёме во всех направлениях. \
Утопление. Молитва, написанная кровью. Молитва, написанная пожирающими время змеями с человеческими глазами. \
Нить, соединяющая все глаза живых людей. Калейдоскоп святых кольев. Экспоненциальная коробка передач. \
Небо, полное взрывающихся звёзд. Бог, опровергающий существование Бога. Колесо вращается в шести измерениях. \
Сорок шестерней и тикающие часы. Часы, которые отмеряют секунду за каждое вращение планеты. \
Часы, которые тикают сорок раз каждый раз, когда они тикают каждый второй раз. Священные колья, привязанные к \
существованию пришвартованного корабля в другом мире. Калейдоскоп крови, написанный в часах. Поглощающая время \
молитва соединяет небо сорока шестерней и раскрытые человеческие глаза во всех направлениях. Дыхание коробки передач. Дыхание болтов. \
Дыхание корабля. Дыхание портала. Дыхание змей. Дыхание Бога. Дыхание крови. Дыхание святых кольев. \
Дыхание человеческих глаз. Дыхание времени. Дыхание молящегося. Дыхание неба. Дыхание колеса."""
    )

    poem_y23 = Poem(
        author = "yuri",
        yuri_3 = True,
        title = "ьвзтаищ,оказ",
        text = """\
ед,,ремарка суивант,,теле ручное плетение заканчивает,,полная решетка кувшинопод\
обных мешковых моллюсков,,вырезая кораблики влажной легкомысленности налорфинов,,\
бензоловый ответ кухарок сосновых шишек,,псевдожурнализма узор ёлочкой бесполезен,,\
эпизодичные болячки,,зачинщик биметаллический,,советы в долг,,уверенность трезвенн\
ик компьютерофоб,,пик экзотически затеняет проталлий,,задние ухищрения оплаты че\
канки пеленуют внешние сделки,,потроха лыжи песчаные очки канноли,,вырезанный ниш\
самовлюблённости,, сумасбродство флиртовало,,югозападнонаправленный,,яичник хруст\
нул,,запретная не кола колпоскопическая,,содрогается,,откровение,,работа дома изо\
тропные моносинаптические эксцизионные стоны,,энтероцентез джакузи занято,,гиппод\
ром внешних черных глаз,,полосатые ондуляторы,,метатезировать,,староста шариата,,\
эпителиальный чувствительный орган скупец дееспособность,,приукрасить стариной кр\
аснеющий просчёт пташки,,безумцы физостигмин искусство править нервные трубки поб\
иты,,мягчайший злой дух смерти крузадо доверие,,рабочие единицы дардзи аэрофоны,,\
тростниковый козёл расстройственно,,растяжители,,однозадачная джелаба,,принаждлеж\
ности подручные средства остроумный,,каллиграфии уэльские парламентарии неудовлет\
ворительность непоколебимый,,бракованный погребённый благодаритель мазня истеричка,,\
разглагольствовать тетива желатин плита,,выборы концептуализация подавать триплику,,\
контрмера ракка,,нумерационный,,агент делирий метилтионин,,мантра динамист атомизи\
рован,,увековечение перкалина гривны прагматизирование,,укоризненность удалённая ра\
бота скот устаревший открыватель,, сделать огнестойким кариоптерис угловатые бесы,,\
трансвеститы окитаенные нарцисс,,ходок менее,,дегазированние,,посткризис схожести,,\
низкопоклонство сероконверсировать страховать,,символы рафиды обрывистейший хам,,зоо\
терапия хлориды всенародное ничтожество юри,,совместная аренда кастаноспермин обрат\
ные ходы возбудить,,содействия однозначный палафит,,пуф соединение,,водолей,,тералит \
переоправдывающий,,привлекательный допустимости заглушать,,найм перецеловать клави\
корд форельнее,,близорукости неотвлекаемые эвакуации уловимее суперклей,,деаминизи\
ровать аптеки теф гебефрении,,умники омоним ланцетник,,лизательный бездомный,,зама\
ненный,,вертлюжная впадина атенолол,,осмотр скуднее ободранный,,патологическое без\
волие,,регулировщик жакет тщеславно,,галравитч хаплохромисы междуассоциации мульти\
пара увеличение,,nэмбриональный рак кооптация цыгане нечасто,,хвостики деликатности \
штатные,,выставить на осмеяние перерейтинг,,катафорезный,,мебилирования молочные би\
доны,,гетит понизить белокопытник,,транскрибировать плаксивейшие серноватистые поло,,\
рычажная лебёдка волокна шерсти перекрытой дороги переделанных внутренних монологов,,\
посредничество лживость паразитизм противоположный мир,,открытия буры с жаром,,оно \
матопоэзия раскаивающийся,,рамекин,,плинтус напыщенно,,вольта донесённые аллантоисы,,\
бор букле поднятия поддерживающие,,дьяволист палки раздача лёгко играя,,процессуаль\
ных бисексуализмов приступы гемолизированны,,отвратительности изгнания поводы,,пере\
ферийная конга,,двухатомность,,дурачеств выплаты,,местоположения пришли его,,кося\
щие лунные камни кашевидные ужасные,,сердцевина фаготист предеспозиция жаргонных гос\
подств,,скромнейшая неуравнимая вторсырьевая одежда неизбежно,,умоляя сеточную тран\
квилизацию,,единородительные товарищи,,аллотропный,,форзацный абиогенетический,,охла\
девание взятое односторонние медали,,удаление волос ствол эффективно шатается,,одетый \
удачливо воспламенняя завершённые икающие муниципализровать,,пентаграфы посылки мар\
китант ведёт раскопки,,звёздная пыль неправильно процитированная благодарность,,мало\
ценный продырявленный,,напиханное,,лечит гилотеизм,,пи
Свежая кровь сквозит через полоску разделяющую её кожу и медленно окрашивает её грудь\
в красный. У меня начинается гипервентиляция по мере усиления позывов. Образы не \
выходят из головы. Образы того, как я вонзаю нож в её плоть раз за разом, насилуя \
её тело лезвием, размазывая её в кашу. Моя голова идёт кругом от возвращающихся \
мыслей. Острая боль вместе с мыслями преследуют каждый уголок моего сознания. Это \
мерзко. Просто мерзко. Как я могла о таком подумать? Но ошибки в этом нет. Похоть \
ещё сныряет по моим венам. Боль в мышцах началось из-за невыпущенного напряжения \
по всему телу. Её третий глаз притягивал меня всё ближе."""
    )

    poem_n1 = Poem(
    author = "natsuki",
    title = "Орлы могут летать",
    text = """\
Обезьяны могут карабкаться,
Сверчки могут прыгать,
Лошади могут скакать,
Совы могут рыскать,
Гепарды могут бежать,
Орлы могут летать,
Люди могут пытаться,
Но на этом и всё."""
    )

    poem_n2 = Poem(
    author = "natsuki",
    title = "Эми любит пауков",
    text = """\
Знаешь, что я слышала про Эми?
Эми любит пауков.
Пауков извивающихся, волосатых, уродливых, мерзких!
Я не дружу с ней, мой выбор таков.

Эми очень красиво поёт.
Я слышала, как она пела мою любимую песню о любви.
Когда она пела в хоре, билось сердце в ритме слов моё.
Но она любит пауков.
Я не дружу с ней, мой выбор таков.

Однажды я сильно поранила ногу.
Эми помогла мне и отвела меня к медсестре.
Я не дала ей коснуться меня всю дорогу.
Её руки, возможно, мерзки, она любит пауков.
Я не дружу с ней, мой выбор таков.

У Эми друзей очень много.
Она с кем-то говорит постоянно.
Возможно, она говорит про пауков.
Что если её друзья тоже начнут любить пауков?
Я не дружу с ней, мой выбор таков.

Не важно, есть ли у неё другие интересы.
Не важно, если не говорит об этом она.
Не важно, если это никому не причиняет вреда.

Это мерзко.
Она мерзкая.
Станет лучше без любителей пауков наш мир.

И я всем это расскажу."""
    )

    poem_n2b = Poem(
    author = "natsuki",
    title = "0KDQsNGB0LrRgNC+0Lkg0YHQstC+0Lkg0YLRgNC10YLQuNC5INCz0LvQsNC3",
    text = """\
0K8g0YfRg9Cy0YHRgtCy0YPRjiDQ
vdC10LbQvdC+0YHRgtGMINC10ZEg
0LrQvtC20Lgg0YfQtdGA0LXQtyDQ
vdC+0LYsINGB0LvQvtCy0L3QviDQ
vtC9INGA0LDRgdGI0LjRgNGP0LXQ
vCDQvNC+0ZEg0YfRg9Cy0YHRgtCy
0L4g0L7RgdGP0LfQsNC90LjRjy4g
0JzQvtGRINGC0LXQu9C+INC/0YDQ
sNC60YLQuNGH0LXRgdC60Lgg0LIg
0LrQvtC90LLRg9C70YzRgdC40Y/R
hS4g0KLQsNC8INC90LXRh9GC0L4g
0L3QtdCy0LXRgNC+0Y/RgtC90L4g
0YHQu9Cw0LHQvtC1LCDQs9C70YPQ
sdC+0LrQviDQstC90YPRgtGA0Lgs
INGH0YLQviDQutGA0LjRh9C40YIg
0Lgg0YHQvtC/0YDQvtGC0LjQstC7
0Y/QtdGC0YHRjyDRjdGC0L7QvNGD
INC90LXQutC+0L3RgtGA0L7Qu9C4
0YDRg9C10LzQvtC80YMg0YPQtNC+
0LLQvtC70YzRgdGC0LLQuNGOLiDQ
ndC+INGPINGD0LbQtSDQt9C90LDR
jiwg0YfRgtC+INC80LXQvdGPINGC
0L7Qu9C60LDRjtGCINC30LAg0LrR
gNCw0LkuINCvINC90LUg0LzQvtCz
0YMuLi7QryDQvdC1INC80L7Qs9GD
INC+0YHRgtCw0L3QvtCy0LjRgtGM
0YHRjy4="""
    )

    poem_n3 = Poem(
    author = "natsuki",
    title = "Я буду твоим пляжем",
    text = """\
Так много забот и страхов в твоей голове —
Это тебя давно уже гложет.
Но сегодня я покажу особое место тебе —
Пляж, на который пойти вместе мы сможем.

Берег, выходящий за пределы сознания,
Море ярким светом сверкает —
Преграды в голове твоей растают 
Перед солнечным сиянием.

Я буду пляжем, что смоет тревоги твои.
Я буду пляжем, о котором ты будешь мечтать.
Я буду пляжем, от которого биение сердца не утаить.
И ты уже понял, что ты начал себя покидать.

Давай закопаем твои тяжёлые мысли в гуще песка!
Купайся в солнца лучах, мою руку держи,
Свои сомнения в солёном море смой навсегда
И дай мне увидеть, как засияешь ты.

Давай оставим следы воспоминаний твоих —
Освободи себя ты парусом моим
И помни, что прекрасен ты, от слов моих,
Когда прикасаешься своими губами к моим.

Я буду пляжем, что смоет тревоги твои.
Я буду пляжем, о котором ты будешь мечтать.
Я буду пляжем, от которого биение сердца не утаить.
И ты уже понял, что ты начал себя покидать.

И если ты позволишь мне с тобою быть там,
Где собственный твой пляж, твоё убежище,
Ты вновь научишься себя любить."""
    )

    poem_n3b = Poem(
    author = "natsuki",
    title = "Ведь ты",
    text = """\
Завтра будет светлее, и я загорюсь,
Но в этот тусклый день я вниз лишь смотрю
И чуть поднимаю свой взгляд,
Ведь смотришь ты на меня.

Когда я хочу что-то сказать, я начинаю кричать!
Но мои настоящие чувства не выйдут на свет никогда.
Но в моих словах будет чуть больше тепла,
Ведь ты слушаешь меня.

Когда я чувствую себя на высоте, могу как звёзды я сиять.
Когда мне плохо, я ниже себя самой.
Но становлюсь чуть выше я,
Когда рядом ты сидишь со мной.

Я верю в себя всем сердцем своим.
Но что, если всё вокруг против меня?
Моя вера станет чуть сильней,
Ведь ты веришь в меня.

Моя ручка проверяет чувства мои.
Я не писатель, стать лучше стараюсь.
Стали дороже мне поэмы свои.
Ведь думаешь обо мне ты.

Ведь ты, ведь ты, ведь ты..."""
    )

    poem_n23 = Poem(
    author = "natsuki",
    title = "",
    text = """\
Не знаю, как ещё поговорить с тобой. Но есть кое-что, о чем я очень волнуюсь. \
Юри очень странно себя ведёт. Ты у нас всего несколько дней, поэтому, наверно, не понимаешь, о чём я. \
Но это ненормально для неё. Она всегда была тихой, вежливой \
и заботливой... и всё такое.

Хорошо... Это очень стыдно, но я заставлю себя сказать это. Правда в том, что я СЕРЬЁЗНО \
волнуюсь за неё. Но если я попробую поговорить с ней, она снова взбесится. Я не знаю, \
что делать. Я думаю, ты единственный человек, кого она послушает. Я не знаю почему. \
Но, пожалуйста, попробуй сделать что-нибудь. Может, ты убедишь её показаться доктору.

Я всегда хотела быть для неё хорошим другом, и мне больно видеть то,\
что происходит. Знаю, я буду ненавидеть себя за то, что призналась в этом, но сейчас \
мне плевать. Я чувствую себя такой беспомощной. Пожалуйста, если ты можешь хоть чем-то помочь... \
Я не хочу, чтобы с ней случилось что-то плохое. Я испеку тебе кексов, если нужно. Только, \
пожалуйста, сделай что-нибудь.

Насчёт Моники... Не знаю почему, но она не обращает на это внимания. Как будто хочет, чтобы мы \
игнорировали это. Так что я очень злюсь на неё сейчас, и поэтому пришла к тебе за помощью. \
НЕ ГОВОРИ ЕЙ, ЧТО Я ЭТО НАПИСАЛА!!!! Просто притворись, что я написала хорошую поэму, хорошо? \
Я рассчитываю на тебя. Спасибо, что прочёл."""
    )

    poem_s1 = Poem(
    author = "sayori",
    title = "Дорогое Солнышко",
    text = """\
Когда ты светишь в глаза мне каждое утро,
Мне кажется, что ты скучало по мне.
Чтобы встала скорей, мой лоб ты целуешь.
Прогоняешь сонливость с глаз моих.

Хочешь, чтоб вышла я поиграть?
Доверишь дождливые дни мне прогнать?
Небо голубое. Я смотрю вверх.
Это секрет, но я тоже доверяю тебе.

Если б не ты, я бы вечно спала...
Но я не в обиде.

Я бы завтрак предпочла."""
    )

    poem_s2 = Poem(
    author = "sayori",
    title = "Бутылки",
    text = """\
Как банку с печеньем, открою голову свою зажатую.
Это секретное место, где я храню свои мечты.
Маленькие солнечные шарики трутся друг о друга, словно котята.
Я залезаю внутрь и аккуратно достаю один.
Он тёплый и нежный.
Но нельзя тратить время! Я кладу его в бутылку, чтоб сохранить.
И кладу бутылку на полку, ко всем остальным таким.
Счастливые мысли, счастливые мысли, счастливые мысли в бутылках, все вместе.

С их помощью нашла себе много друзей.
Каждая бутылка может заменить звёздный свет.
Иногда друзьям становится немного грустней.
Я выпускаю один шарик, чтобы день был согрет.

Ночь за ночью, больше шариков.
Друг за другом, больше бутылок.
Глубже и глубже мои пальцы идут.
Словно исследуя тёмную пещеру, ищу секреты в закоулках и щелях.
Копаю и копаю.
Шкребу и шкребу.

Сдуваю я пыль с бутылочных крышек —
Время пролетело так незаметно.
На полке не осталось ничего выше.
Моя друзья стоят за закрытой дверью.

Ну вот, всё готово. Я открываю дверь и впускаю друзей.
Все идут в спешке. Они так сильно хотят того, что в бутылках лежит?
Я вытаскиваю их с полки, одну за другой, быстрей.
Я для всех и каждого держу.
Все до единой бутылки храню.
Но каждый раз она разлетается на куски у моих ног, когда я отдаю одну
Счастливые мысли, счастливые мысли, счастливые мысли в осколках по всему полу.

Они должны были быть для моих друзей, моих друзей, которые не улыбаются.
Они все кричат, просят. Чего-то.
Но все что я слышу это эхо, эхо, эхо, эхо, эхо.
В моей голове."""
    )

    poem_s3 = Poem(
    author = "sayori",
    title = "%",
    text = """\
Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы. Убирайся из моей головы.
Убирайся.
Из.
Моей.
Головы.\n\n\n
Убирайся из моей головы, пока я не сделала то, что будет лучше для тебя.
Убирайся из моей головы, пока не выслушала всё, что она сказала мне.
Убирайся из моей головы, пока я не показала, как сильно я люблю тебя.
Убирайся из моей головы, пока я не закончила писать эту поэму.\n\n\n\n\n\n\n
Но поэма на самом деле никогда не заканчивается.
Она просто перестаёт двигаться."""
    )

    poem_m1 = Poem(
    author = "monika",
    title = "Дыра в стене",
    text = """\
Это не могла быть я.
Видишь, откуда выступает шпаклёвка?
Шумный сосед? Разгневанный друг? Меня не было дома, не узнаю я.
Я всматриваюсь глубже, чтобы тайны развязать верёвку.
Нет! Я ничего не вижу. Ослепшая, кружусь, как оставленная на солнце киноплёнка.
Но слишком поздно. Мои глаза.
На них уже выжжен бессмысленный образ.
Это была всего лишь дырка. Она даже не ярка.
Она слишком глубока.
Растянувшись навсегда.
Дыра бесконечных решений.
Теперь я понимаю, что смотрела не во внутрь.
Я смотрела изнутри.
И он, на той стороне, смотрел вовнутрь."""
    )

    poem_m21 = Poem(
    author = "monika",
    title = "Дыра в стене",
    text = """\
Но он смотрел не на меня.
Растерявшись, я лихорадочно оглядываюсь вокруг.
Но мои выжженные глаза более не различают цвета.
Есть ещё кто-то в этом месте? Что-то говорят они вдруг?
Или это их незамысловатые поэмы на листах бумаги
Звучат безумными каракулями в ушах моих?
Все вокруг начинает изгибаться.
Приближаясь ко мне, затишье у них.
Воздух, которым я дышу, рассеивается прежде, чем достигает лёгких моих.
Я паникую. Должен быть выход.
Выход прямо там. Он прямо там.

Отбрасывая страхи, я взмахиваю ручкой."""
    )

    poem_m2 = Poem(
    author = "monika",
    title = "Сохрани меня",
    text = """\
Цвета, они не остановятся.
Яркие, красивые цвета,
Мерцающие, расцветающие, пронзающие.
Красный, зелёный, синий —
Бесконечная
какофония
Бессмысленных 
шумов.


Шумы, они не остановятся.
Жестокие, скрипучие колебания,
Пищащие, визгливые, пронзающие.
Синус, косинус, тангенс.
    Как доска, играющая на музыкальном проигрывателе,
        Как виниловый диск, играющий на корке пиццы,
Бесконечная
поэма,
Не имеющая смысла\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n
Загрузи меня
    """
    )

    poem_m22 = Poem(
    author = "monika",
    title = "Спаси меня",
    text = """\
Цвета, они не
Яркие, кра и ые ц е а,
Мерцаю ие, расцв та щие, пронзающие.
Красный, зеленый, синий —
    онечная
КАКОФОНИЯ
Бессмысленных 
шумов.


Шумы, они не ОСТАНОВЯТСЯ.
Жест  ие, скрипучие к ле а ия,
Пи а ие, визг   ые, пронзающие.
СИНУС, КОСИНУС, ТАНГЕНС.
    Как до к   игра     на музыка  ом    и   вателе,
        Как НОЖ, играющий на ГРУДНОЙ КЛЕТКЕ,
   с оне  ая
п   а,
Не и е ю ая с   ла\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n
Удали Её
    """
    )

    poem_m3 = Poem(
    author = "monika",
    title = "Дама, которая всё знает",
    text = """\
Старая история рассказывает о леди, бродящей по Земле.
Леди, которая Всё Знает.
Красивая леди, которая нашла все ответы,
И смысл всего,
Все цели,
И всё, что когда-либо искали.

А вот и я,


              пёрышко


Потерянная, плывущая по небу, жертва потоков ветра.

День за днём я ищу.
Я ищу с крошечной надеждой, зная, что сказок не бывает.
Но когда всё остальное наутёк я пущу,
Когда все остальные меня отвергали,
Легенда - это всё, что осталось - последняя тусклая звезда, что в сумеречном небе мерцает.

Пока однажды, когда ветер перестанет дуть.
Я упаду.
И падаю, и падаю, и падаю ещё больше.
Нежная, как пёрышко.
Сухое пёрышко, бесстрастное.

Но рука ловит меня между большим и указательным пальцами.
Рука прекрасной дамы.
Я смотрю в её глаза и встречаюсь с её пристальным взглядом.

Леди, которая Всё Знает, знает, о чем думаю я.
Прежде, чем я начинаю говорить, пустым голосом она отвечает.
"Я знаю все ответы, все они сводятся к нулю.
Нет никакого смысла.
Нет цели.
И ищем мы лишь только невозможное.
Я - не твоя легенда.
Сказок не бывает."

Со вздохом, она сдувает перо прочь из рук, и меня подхватывает ветряной порыв."""
    )

    poem_m4 = Poem(
    author = "monika",
    title = "Счастливый Конец",
    text = """\
Держа ручку в руке, я силу свою обретаю. 
Отвага любовью меня наделила. 
И вместе рушащийся мир разбиваем
И напишем новеллу из фантазий, нам милых.

С щелчком ручки, потерянная путь свой найдёт.
В мире бесконечных выборов, узри этот особый день.

Всё же,
Не всё хорошее должно подходить к концу."""
    )

image paper = "images/bg/poem.jpg"
image paper_glitch = LiveComposite((1280, 720), (0, 0), "paper_glitch1", (0, 0), "paper_glitch2")
image paper_glitch1 = "images/bg/poem-glitch1.png"
image paper_glitch2:
    "images/bg/poem-glitch2.png"
    block:
        yoffset 0
        0.05
        yoffset 20
        0.05
        repeat


transform paper_in:
    truecenter
    alpha 0
    linear 1.0 alpha 1

transform paper_out:
    alpha 1
    linear 1.0 alpha 0

screen poem(currentpoem, paper="paper"):
    style_prefix "poem"
    vbox:
        add paper
    viewport id "vp":
        child_size (710, None)
        mousewheel True
        draggable True
        has vbox
        null height 40
        if currentpoem.author == "yuri":
            if currentpoem.yuri_2:
                text "\n[currentpoem.title]\n\n[currentpoem.text]" style "yuri_text"
            elif currentpoem.yuri_3:
                text "\n[currentpoem.title]\n\n[currentpoem.text]" style "yuri_text_3"
            else:
                text "\n[currentpoem.title]\n\n[currentpoem.text]" style "yuri_text"
        elif currentpoem.author == "sayori":
            text "\n[currentpoem.title]\n\n[currentpoem.text]" style "sayori_text"
        elif currentpoem.author == "natsuki":
            text "\n[currentpoem.title]\n\n[currentpoem.text]" style "natsuki_text"
        elif currentpoem.author == "monika":
            text "\n[currentpoem.title]\n\n[currentpoem.text]" style "monika_text"
        null height 100
    vbar value YScrollValue(viewport="vp") style "poem_vbar"



style poem_vbox:
    xalign 0.5
style poem_viewport:
    xanchor 0
    xsize 720
    xpos 280
style poem_vbar is vscrollbar:
    xpos 1000
    yalign 0.5

    ysize 700





style yuri_text:
    font "gui/font/y1.ttf"
    size 28
    color "#000"
    outlines []

style yuri_text_2:
    font "gui/font/y2.ttf"
    size 40
    color "#000"
    outlines []

style yuri_text_3:
    font "gui/font/y3.ttf"
    size 18
    color "#000"
    outlines []
    kerning -8
    justify True

style natsuki_text:
    font "gui/font/n1.ttf"
    size 28
    color "#000"
    outlines []
    line_leading 1

style sayori_text:
    font "gui/font/s1.otf"
    size 26
    color "#000"
    outlines []
    justify True

style monika_text:
    font "gui/font/m1.ttf"
    size 30
    color "#000"
    outlines []

label showpoem(poem=None, music=True, track=None, revert_music=True, img=None, where=i11, paper=None):
    if poem == None:
        return
    play sound page_turn
    if music:
        $ currentpos = get_pos()
        if track:
            $ audio.t5b = "<from " + str(currentpos) + " loop 4.444>" + track
        else:
            $ audio.t5b = "<from " + str(currentpos) + " loop 4.444>bgm/5_" + poem.author + ".ogg"
        stop music fadeout 2.0
        $ renpy.music.play(audio.t5b, channel="music_poem", fadein=2.0, tight=True)
    window hide
    if paper:
        show screen poem(poem, paper=paper)
    else:
        show screen poem(poem)
    if not persistent.first_poem:
        $ persistent.first_poem = True
        show expression "gui/poem_dismiss.png" as poem_dismiss:
            xpos 1050 ypos 590
    with Dissolve(1)
    $ pause()
    if img:
        $ renpy.hide(poem.author)
        $ renpy.show(img, at_list=[where])
    hide screen poem
    hide poem_dismiss
    with Dissolve(.5)
    window auto
    if music and revert_music:
        $ currentpos = get_pos(channel="music_poem")
        $ audio.t5c = "<from " + str(currentpos) + " loop 4.444>bgm/5.ogg"
        stop music_poem fadeout 2.0
        $ renpy.music.play(audio.t5c, fadein=2.0)
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
