

label ch2_main:
    scene bg club_day
    with dissolve_scene_half
    play music t2
    "Уроки закончились, и подошло время собрания клуба."
    "За последние пару дней я немного в нём освоился."
    "В помещении клуба меня встретила знакомая картина."
    show sayori 2x zorder 2 at t11
    s "Ха-ай, [player]!"
    mc "Йоу, Саёри."
    mc "Ты сегодня в хорошем настроении?"
    s 1q "Хи-хи-хи..."
    s "Просто ещё не привыкла к тому, что ты теперь в клубе, только и всего."
    mc "Ясно..."
    mc "...Тебя оказалось так просто порадовать."
    mc "Но с тобой, в принципе, всегда просто, чего бы это ни касалось."
    s 1d "Кстати..."
    s "Я немного проголодалась..."
    s "Не сходишь со мной в буфет?"
    mc "Нет уж, спасибо."
    s 4h "А-а-а?"
    s "Ты же мне обычно не отказываешь!"
    mc "У меня есть на то причины."
    mc "Может, заглянем в твой кошелёчек, Саёри?"
    s 4l "Э-э-э?"
    show sayori at s11
    s "Чего это ты... вдруг?"
    mc "Да ничего особенного."
    mc "Просто захотелось на него посмотреть."
    s 1l "А-а..."
    show sayori zorder 2 at t11
    "Саёри с опаской вытащила свой кошелёк."
    "Немного повозилась с защёлкой и открыла его."
    "Затем перевернула его вверх тормашками, позволяя содержимому высыпаться на парту."
    "О столешницу стукнулось всего две мелкие монетки."
    s 5a "Ха. Ха-ха..."
    mc "Так и знал..."
    mc "Я вижу тебя насквозь, Саёри."
    s 5c "Так нечестно!"
    s "Откуда ты вообще узнал?"
    mc "Всё просто."
    mc "Если бы у тебя были деньги, ты бы купила себе поесть заранее."
    mc "Так что либо ты не голодна и ищешь повод прогуляться..."
    mc "Либо решила под шумок сделать вид, будто забыла, что всё истратила, и попросить у меня взаймы!"
    mc "Ах да, и ещё один нюанс..."
    mc "...Не уверен, что хоть раз видел тебя сытой!"
    mc "Таким образом, остаётся только одно."
    s 4p "А-а-а-а!"
    s "Сдаюсь!"
    s "Не буди мою совесть!"
    mc "Если тебя мучает совесть, значит, есть за что мучить..."
    show yuri 1c zorder 2 at t33
    y "Ха-ха-ха..."
    "Неожиданно рассмеялась Юри."
    show sayori 4g
    mc "Эм-м?"
    "Я даже не думал, что она нас слышит."
    "Она, как обычно, уткнулась в свою книгу."
    show yuri 3n at h33
    y "О-ой!"
    y "Не подумайте, что я подслушивала!.."
    y 3o "Просто там... в книге... такое..."
    show sayori zorder 3 at f32
    s 1h "Ю-у-ури-и-и..."
    s "[player] не хочет одалживать мне деньги! Скажи ему!.."
    show sayori zorder 2 at t32
    show yuri zorder 3 at f33
    y 3h "Т-ты!.."
    y "Не нужно втягивать в это меня, Саёри!.."
    y "К тому же..."
    y 1k "Тебе следовало бы покупать только то, что ты можешь себе позволить..."
    y "И, откровенно говоря, твои страдания — справедливое воздаяние за подлую попытку надувательства."
    show sayori 1b
    mc "..."
    y 3n "Ой!.."
    y "Я сейчас..."
    y 4c "Я... Я не то хотела сказать!"
    y "Я слишком увлеклась книгой..."
    y "Э-э-э..."
    show yuri zorder 2 at t33
    show sayori zorder 3 at f32
    s 1r "А-ха-ха-ха!"
    s 3x "Мне так нравится, когда ты открыто выражаешь свои мысли, Юри..."
    s "Это случается нечасто, но ты в эти моменты такая забавная!"
    show sayori zorder 2 at t32
    show yuri zorder 3 at f33
    y 3v "Это..."
    y "Ты не можешь считать так на самом деле..."
    show yuri zorder 2 at t33
    show sayori zorder 3 at f32
    s 1x "Хотя в целом ты права..."
    s "Я поступила плохо и должна принять возлияние."
    show sayori zorder 2 at t32
    show yuri zorder 3 at f33
    y 3h "Воздаяние..."
    show yuri zorder 2 at t33
    show sayori zorder 3 at f32
    s 1l "Да, его!"
    show sayori zorder 2 at t32
    show yuri zorder 3 at f33
    y "Вот смотрю на тебя, Саёри..."
    y 1a "И думаю, что в каждом из нас скрывается маленький дьявол."
    show yuri zorder 2 at t33
    show sayori zorder 3 at f32
    s 1q "Хи-хи..."
    show sayori zorder 2 at t32
    mc "Не обманывайся."
    mc "Саёри отдаёт отчёт своим действиям."
    mc "Она сообщила вам, что завербовала меня в клуб, ещё до того, как поставила об этом в известность меня..."
    show sayori zorder 3 at f32
    s 1h "Н-но ты!.."
    s "Ты даже не заглянул бы, если бы не кексики..."
    s "Поэтому мне пришлось обмануть Нацуки, чтобы она их испекла!"
    show sayori zorder 2 at t32
    mc "Да ладно тебе, Саёри, я не настолько непрошибаемый."
    show sayori zorder 3 at f32
    s 1l "Хи-хи..."
    play sound "sfx/slap.ogg"
    show white zorder 4:
        alpha 0.6
        linear 0.25 alpha 0.0
    show sayori 4p zorder 3 at hf32
    "{i}Чвяк!{/i}"
    hide white
    s 4p "А-а-а!"
    "Что-то звучно шмякнулось об лицо Саёри и упало на парту."
    s 4j "Ой..."
    s "Ч-что это..."
    s 4n "А-а?!"
    s "К-кексик!"
    "Стопудово, здоровенный кекс, упакованный в пластик."
    "Саёри огляделась."
    s 4m "Эт-то... знак свыше?"
    s "Знак, что я получила своё воспитание!"
    show sayori zorder 2 at t32
    mc "Воздаяние..."
    show sayori 4n
    show yuri zorder 3 at f33
    y 1u "Ну, в этот раз почти угадала..."
    show yuri zorder 2 at t33
    show natsuki 3z zorder 3 at f31
    n "Ха-ха-ха-ха-ха!"
    n "Я {i}сначала{/i} хотела просто угостить тебя им."
    n 3d "Но потом услышала твою болтовню насчёт кексиков."
    n "В общем, твоя реакция определённо того стоила. А-ха-ха-ха!"
    show natsuki zorder 2 at t31
    show sayori zorder 3 at f32
    s 4m "Н-Нацуки!"
    s "Это так мило с твоей стороны!"
    s 4s "Мне так приятно..."
    "Саёри обняла кекс."
    show sayori zorder 2 at t32
    mc "Блин, просто съешь его..."
    "Она молниеносно разломала упаковку и вгрызлась в кекс."
    show sayori zorder 3 at f32
    s 4q "Так фкущно..."
    show sayori zorder 3 at hf32
    s 4o "Ум-м-м!"
    "И тут же резко прижала руки к губам."
    s 4p "Я прикусила язык..."
    show sayori zorder 2 at t32
    show natsuki zorder 3 at f31
    n 3a "Хи-хи-хи."
    n "Всего один кексик, а сколько приключений."
    "Нацуки надкусила свой."
    show natsuki zorder 2 at t31
    show sayori zorder 3 at f32
    s 1c "О, твой тоже выглядит аппетитно, Нацуки!"
    s "Можно попробовать?"
    show sayori zorder 2 at t32
    show natsuki zorder 3 at f31
    n 4e "Блин..."
    n "Попрошайки не перебирают!"
    show natsuki zorder 2 at t31
    show sayori zorder 3 at f32
    s 1h "Но твой — шоколадный..."
    show sayori zorder 2 at t32
    show natsuki zorder 3 at f31
    n 4c "Точно. Почему, по-твоему, я отдала тебе другой?"
    show natsuki zorder 2 at t31
    show sayori zorder 3 at f32
    s 1g "Ладно..."
    s 1q "Я всё равно очень рада, что ты со мной поделилась."
    s "Хи-хи-и-и..."
    show sayori behind natsuki zorder 2 at t21
    "Саёри встала со своего места и зашла за спину Нацуки, обнимая её."
    n 12c "Ох... Бли-и-ин..."
    n "Я поняла, поняла."
    "Не расставаясь с кексом, Нацуки потянулась, чтобы отцепить от себя Саёри."
    show sayori 1n at h21
    s "...{i}Мням.{/i}"
    "Саёри вдруг перегнулась через неё и откусила кусок кекса Нацуки."
    n 1p "{i}Э-э-эй!!{/i}"
    n "Ты реально это сделала?!"
    s 1q "У-ху-ху-ху!"
    show sayori at lhide
    hide sayori
    "Саёри с набитым ртом отскочила на безопасное расстояние."
    show yuri 1c
    "Мы с Юри тоже рассмеялись."
    show yuri 1a
    show natsuki zorder 3 at f31
    n 1w "Блин! Ты иногда ведёшь себя как ребёнок!"
    n 1h "Моника! Скажи Саёри..."
    n 1c "...А-а?"
    "Нацуки огляделась."
    "Моники в помещении не нашлось."
    n 4q "Эм-м..."
    n "А куда делась Моника?"
    show natsuki zorder 2 at t31
    show yuri 2f zorder 3 at f33
    y "Хороший вопрос..."
    y "Она никого из вас не предупреждала, что опоздает?"
    show sayori 1b zorder 3 at f32
    show yuri zorder 2 at t33
    s "Меня — нет..."
    show sayori zorder 2 at t32
    mc "Угу, и меня тоже."
    show yuri zorder 3 at f33
    y 2l "Хм-м..."
    y "Как-то непривычно."
    show yuri zorder 2 at t33
    show sayori zorder 3 at f32
    s 1g "Надеюсь, с ней всё в порядке..."
    show sayori zorder 2 at t32
    show natsuki 3k zorder 3 at f31
    n "Естественно, с ней всё в порядке."
    n "Наверное, у неё просто появились какие-то неотложные дела."
    n 3t "Всё-таки она многим нравится..."
    show natsuki zorder 2 at t31
    show sayori 4m zorder 3 at f32
    s "Что?"
    s "Ты же не думаешь, что она..."
    s "Что у неё есть!.."
    show sayori zorder 2 at t32
    show yuri 1a zorder 3 at f33
    y "Ха-х. Не удивлюсь, если это так."
    y "Её, наверное, желают больше, чем всех нас вместе взятых."
    show yuri zorder 2 at t33
    show sayori 1r zorder 3 at f32
    s "Хи-хи, и правда..."
    show sayori zorder 2 at t32
    show natsuki 1p zorder 3 at f31
    n "Ч-что, прости?!"
    hide natsuki
    hide sayori
    hide yuri
    with wipeleft
    "Дверь неожиданно распахнулась."
    show monika 1g at l41
    m "Извиняюсь! Дико извиняюсь!"
    mc "О, а вот и она..."
    m "Не собиралась опаздывать..."
    m "Надеюсь, вы не сильно волновались!"
    show sayori 4n zorder 3 at f42
    s "О-о!"
    s "Всё-таки между клубом и парнем Моника выбрала клуб!"
    s "У тебя железная воля!"
    show sayori zorder 2 at t42
    show monika zorder 3 at f41
    m 1l "П-парнем?.."
    m "Что за чушь ты несёшь?"
    "Моника с недоумением посмотрела на меня."
    show monika zorder 2 at t41
    mc "А, забудь..."
    mc "Так что там тебя задержало?"
    show monika zorder 3 at f41
    m 1e "А..."
    m "Ну, сегодня последним уроком было самообучение."
    m "Честно говоря, я просто потеряла счёт времени..."
    m "Ха-ха-ха..."
    show monika zorder 2 at t41
    show natsuki 2c zorder 3 at f43
    n "Только странно получается."
    n "Ты бы ведь по-любому услышала звонок."
    show natsuki zorder 2 at t43
    show monika zorder 3 at f41
    m 1m "Скорее всего, я не услышала его потому, что играла на фортепиано..."
    show monika zorder 2 at t41
    show yuri 1e zorder 3 at f44
    y "Фортепиано?.."
    y "Не знала, что ты занимаешься ещё и музыкой, Моника."
    show yuri zorder 2 at t44
    show monika zorder 3 at f41
    m 1l "Ох, ну не сказать, что прямо занимаюсь!.."
    m "Начала-то я совсем недавно."
    m 1m "Всегда хотела научиться играть на фортепиано."
    show monika zorder 2 at t41
    show sayori 4x zorder 3 at f42
    s "Это так круто!"
    s "Ты обязана сыграть что-нибудь для нас, Моника!"
    show sayori zorder 2 at t42
    show monika zorder 3 at f41
    m "Ну я..."
    "Моника бросила на меня взгляд."
    m 1a "Возможно, и сыграю, когда немножечко подучусь."
    show monika zorder 2 at t41
    show sayori zorder 3 at f42
    s 4q "Ура-а-а!"
    show sayori zorder 2 at t42
    mc "Звучит здорово."
    mc "Буду ждать с нетерпением."
    show monika zorder 3 at f41
    m 1b "Неужели?"
    m "В таком случае..."
    m "Я не подведу тебя, [player]."
    show sayori zorder 1 at thide
    show natsuki zorder 1 at thide
    show yuri zorder 1 at thide
    show monika 5 zorder 2 at t11
    hide sayori
    hide natsuki
    hide yuri
    "Моника мило улыбнулась."
    mc "Ох..."
    mc "Я совсем не собирался на тебя давить, правда!"
    m 1a "Ха-ха, не переживай."
    m "Я всё равно много тренируюсь в последнее время."
    m "И я ни за что не упущу возможности сыграть, когда буду готова."
    mc "Понятно..."
    mc "В таком случае желаю удачи."
    m 1j "Спа-а-асибо!"
    m 1a "Итак, я ведь ничего не пропустила?"
    mc "Да вроде нет..."
    show monika zorder 1 at thide
    hide monika
    "Я предпочёл не упоминать о некрасивой выходке Саёри."
    "Уверен, что Нацуки потом всё равно наябедничает."
    "А сейчас всё, кажется, как раз вернулось в норму."
    "Саёри уже каким-то образом умудрилась прикончить свой кекс."
    "Юри вернулась к брошенной книге, а Нацуки скрылась в кладовке."



    $ nextscene = poemwinner[1] + "_exclusive_" + str(eval(poemwinner[1][0] + "_appeal"))
    call expression nextscene from _call_expression_23



    return


label ch2_end:
    stop music fadeout 1.0
    scene bg club_day
    show monika 4b zorder 2 at t32
    with wipeleft_scene
    play music t3
    m "Так, ребята!"
    m "Все уже прочитали стихи друг друга?"
    m "Нам нужно по кое-чему пробежаться, так что будьте добры, сядьте в передних рядах..."
    show natsuki 3c zorder 3 at f31
    n "Это связано с фестивалем?"
    show natsuki zorder 2 at t31
    show monika 1j zorder 3 at f32
    m "Ну, вроде того."
    show monika 1a zorder 2 at t32
    show natsuki 1m zorder 3 at f31
    n "Бе. Нам правда придётся делать что-то для фестиваля?"
    n "Ничего годного всего за пару дней всё равно не склепаешь."
    n "Мы лишь выставим себя на посмешище, а не привлечём новых людей в клуб."
    show yuri 2g zorder 3 at f33
    show natsuki zorder 2 at t31
    y "Да, я тоже беспокоюсь по этому поводу."
    y "Я плохо справляюсь, когда что-то приходится делать в последний момент..."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m 1b "Да не переживайте вы так!"
    m "Мы обойдёмся чем-нибудь попроще, ладно?"
    m 1a "Потребуется всего лишь парочка декораций."
    m "Саёри уже занимается плакатами, а я набросала парочку стихов, которые мы сможем зачитать."
    show monika zorder 2 at t32
    show natsuki 3c zorder 3 at f31
    n "Окей, это, конечно, всё классно..."
    n "Но ты так и не сказала, что именно мы собираемся представлять на фестивале."
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 1d "Ох, извиняюсь. Я думала, все уже знают."
    m 1b "Мы будем выступать!"
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 3h "Выступать?"
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f33
    y 3n "В..."
    y 3o "Эм-м, Моника..."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m 1k "Да! Мы будем выступать со стихами."
    m 1b "Каждый из нас выберет себе по стиху и зачитает его на фестивале."
    m "Но фишка в том, что кто угодно сможет подняться на сцену и тоже прочесть какое-нибудь стихотворение!"
    m 1a "Саёри пишет об этом на плакатах на случай, если кому-то понадобится время, чтобы подготовиться заранее."
    show yuri zorder 2 at t44
    show monika zorder 2 at t43
    show natsuki zorder 2 at t42
    show sayori 4q at l41
    s "Хи-хи-и-и..."
    "Саёри, занятая разрисовыванием плаката, развернула его, показывая нам."
    show natsuki 4w zorder 3 at f42
    n "Моника, ты прикалываешься?"
    n "Ты же... ты же ещё не начала развешивать эти постеры по школе?"
    show natsuki zorder 2 at t42
    show monika zorder 3 at f43
    m 1d "Ну, начала... А что?"
    m "Ты категорически против этой идеи?.."
    show monika zorder 2 at t43
    show natsuki 1s zorder 3 at f42
    n "Так-то нет."
    n "Идея неплохая."
    n 1w "Но я на это не подписывалась, так и знай!"
    n 1x "{i}Фига с два{/i} я стану читать стишки перед толпой людей!"
    show natsuki zorder 2 at t42
    show yuri zorder 3 at f44
    y 3r "Я... я согласна с Нацуки!"
    y 3w "Я никогда... в жизни... не решусь на что-то подобное..."
    "Юри испуганно тряхнула головой, представляя это."
    show yuri zorder 2 at t44
    show sayori 1g zorder 3 at f41
    s "Ребята..."
    show sayori zorder 2 at t41
    show monika zorder 3 at f43
    m 1g "Нет, Саёри..."
    m "Я их понимаю."
    m "Вспомни, что прошла всего пара дней, как Нацуки и Юри стали кому-то показывать свои стихи... Раньше они этого никогда не делали."
    m "Требовать от них зачитывать свою поэзию перед целой аудиторией — это слишком."
    m 1r "Как-то я упустила это из виду."
    m "Так что прошу прощения."
    show monika zorder 2 at t43
    show natsuki 5g zorder 3 at f42
    n "..."
    show natsuki zorder 2 at t42
    show monika zorder 3 at f43
    m 1i "...Однако!"
    m "Я всё равно считаю, что мы обязаны выложиться на полную!"
    m 1d "Судьба этого клуба зависит только от нас."
    m "Если мы все хорошо выступим в начале..."
    m 3a "То это вдохновит других сделать то же самое!"
    m "И чем больше людей выступит, тем лучше мы покажем остальным, что за классная штука - литература!"
    show monika zorder 2 at t43
    show sayori 1r zorder 3 at f41
    s "Да!"
    s 1x "Она помогает выражать свои чувства..."
    s "Учит понимать себя..."
    s "Раскрывать новые горизонты..."
    s "И наслаждаться жизнью!"
    show sayori zorder 2 at t41
    show monika zorder 3 at f43
    m 4b "Именно!"
    m "Вот по этим причинам мы и находимся в клубе здесь и сейчас."
    m 4e "Разве вы не хотите поделиться этим с другими?"
    m "Вдохновить их на открытие в себе тех же чувств, которые изначально привели вас сюда?"
    m 1e "Знаю — хотите."
    m "Мы все хотим."
    m 1b "И если всё, что ради этого требуется — всего лишь пару минут постоять посреди класса и прочесть стих..."
    m "...Я знаю, вы сможете это сделать!"
    show monika 1a zorder 2 at t43
    show natsuki 5s zorder 3 at f42
    n "..."
    show natsuki zorder 2 at t42
    show yuri 4b zorder 3 at f44
    y "..."
    show yuri zorder 2 at t44
    show sayori 1g
    "Нацуки и Юри молчали."
    "Саёри нервничала."
    "У меня не оставалось выбора..."
    mc "Я согласен..."
    mc "Не думаю, что это такая уж невыполнимая просьба."
    mc "Саёри и Моника приложили массу усилий, чтобы клуб пополнился новыми людьми."
    mc "И мы должны хотя бы немного им в этом помочь."
    show natsuki zorder 3 at f42
    n 5h "Ну... Наверное, но..."
    n "..."
    "Кажется, у Нацуки не осталось аргументов."
    n "У-у-у..."
    n 1q "...Ладно, хорошо!"
    n "Видимо, придётся это как-нибудь пережить."
    show natsuki zorder 2 at t42
    show sayori zorder 3 at f41
    s 4r "О-отлично-о-о!"
    show sayori 4a zorder 2 at t41
    show monika zorder 3 at f43
    m 1e "Фух..."
    m "Спасибо, Нацуки."
    m "А что насчёт тебя, Юри?.."
    show monika zorder 2 at t43
    show yuri zorder 3 at f44
    y "..."
    "Юри окинула наши нетерпеливые лица безрадостным взглядом."
    y "*вздох*..."
    y "К-кажется, здесь уже всё решили за меня..."
    show yuri zorder 2 at t44
    show sayori zorder 3 at f41
    s 4r "Ха-ха! Единогласно!"
    s "Юри-и-и, ты лучшая!"
    show sayori 4a zorder 2 at t41
    show yuri zorder 3 at f44
    y "Этот клуб наверняка сведёт меня в могилу..."
    show yuri zorder 2 at t44
    show monika zorder 3 at f43
    m 1l "Господи..."
    m 1n "Всё будет хорошо, Юри."
    m "Но всё-таки..."
    m 1b "Давайте перейдём к основному действу!"
    m "Я хочу, чтобы каждый из вас выбрал по собственному стиху."
    m "Будем упражняться в чтении друг с другом."
    show monika 1a zorder 2 at t43
    show natsuki zorder 3 at f42
    n 1p "Щ-щас, разбежалась!"
    show natsuki zorder 2 at t42
    show yuri 3n zorder 3 at f44
    y "Моника!.."
    y "Эт-то слишком внезапно!"
    show yuri zorder 2 at t44
    show monika zorder 3 at f43
    m 2a "Скажи-ка мне, как ты собираешься читать стихи перед незнакомцами, если не можешь сделать этого перед членами клуба?"
    show monika zorder 2 at t43
    show yuri 4c zorder 3 at f44
    show natsuki 1o
    y "О нет..."
    show yuri zorder 2 at t44
    show monika zorder 3 at f43
    m 2a "Не переживай."
    m "Я начну первая, чтобы остальным было не так страшно."
    show monika zorder 2 at t43
    show sayori 1r zorder 3 at f41
    s "А можно я после тебя?"
    show sayori zorder 2 at t41
    show monika zorder 3 at f43
    m "Ха-ха-ха. Конечно."
    m 2d "Так-с, поглядим..."
    "Моника начала листать свою тетрадь, пока не нашла какой-то особенный стих, который ей захотелось прочесть."
    "А затем встала за кафедру."
    show monika zorder 2 at t11
    show sayori zorder 1 at thide
    show natsuki zorder 1 at thide
    show yuri zorder 1 at thide
    hide sayori
    hide natsuki
    hide yuri
    m 1a "Стихотворение называется {i}\"Как они летают?\"{/i}."
    m 1r "Кхм..."
    show monika 1a
    "Моника начала читать свои стихи."
    "Её чистый уверенный голос наполнил комнату."
    "Более того, она читала с безупречным выражением."
    "Очень тонко чувствуя, какой эмоцией выделить каждую строчку, она оживляла слова."
    "Что это, выработанная привычка или природный дар?"
    "Я огляделся."
    "Все взгляды были устремлены на Монику."
    "Саёри выглядела восхищённой."
    "На лице Юри застыло напряжённое выражение, которое я не мог расшифровать."
    show monika 1j
    "Наконец Моника дочитала."
    "Мы вчетвером тут же зааплодировали."
    "Моника перевела дыхание и улыбнулась."
    show monika 1a
    show sayori 4m zorder 3 at f33
    s "Это... это было так классно, Моника!"
    show sayori zorder 2 at t33
    show monika zorder 3 at f32
    m 1j "Ха-ха, спасибо большое."
    m 1a "Я просто стремилась подать хороший пример."
    m "Готова выступать следующей, Саёри?"
    show monika zorder 2 at t32
    show yuri 2r at l31
    y "Я... я буду следующей!"
    show sayori at h33
    s 1n "Ух ты! Юри внезапно загорелась!"
    "Юри смяла в руках лист бумаги и встала из-за парты."
    "Не поднимая головы, она спешно заняла место за кафедрой."
    show monika zorder 1 at thide
    show sayori zorder 1 at thide
    show yuri zorder 2 at t11
    hide monika
    hide sayori
    y 2v "Стихотворение называется!.."
    "Юри взволнованно обвела нас взглядом."
    s "Ты сможешь, Юри..."
    y "Оно... Оно называется...{i}Послеобраз Багрового Глаза{/i}."
    "Юри дрожащим голосом начала читать стихотворение."
    "Всего мгновение назад она фактически отказалась это делать."
    "Что же заставило её так стараться?"
    show yuri 2l
    "После первой пары строчек голос Юри изменился."
    "Это было похоже на то, как она растворяется в своих книгах."
    "Натужное блеянье сменилось чётким слогом сильной и уверенной женщины."
    "В стихе оказалось много смен и обрывов ритма, и она выделяла их с идеальной выверенностью."
    "Должно быть, это был редкий проблеск того самого вихрящегося пламени, что Юри прятала в своей голове!.."
    show yuri 2t
    "И вдруг она замолчала."
    "Все замерли."
    "Юри выпадала обратно в реальность и стала растерянно оглядываться, будто потеряла даже саму себя."
    y 3o "Я..."
    "...Спасение ситуации было в моих руках."
    "И я зааплодировал первым."
    "Остальные сразу же присоединились ко мне, награждая Юри заслуженным признанием."
    "Нет, мы не считали, что она не заслуживает аплодисментов."
    "Просто были настолько выбиты из колеи, что, должно быть, забыли."
    "Под наши аплодисменты Юри прижала свое стихотворение к груди и побежала обратно за парту."
    show yuri at lhide
    hide yuri
    show monika 1a zorder 2 at t11
    m "Юри, у тебя отлично получилось."
    m "Спасибо, что поделилась."
    y "..."
    "Кажется, Юри больше не с нами..."
    show sayori 1q zorder 2 at t31
    s "О-оке-е-ей!"
    s "Думаю, теперь моя очередь!"
    "Саёри вскочила со стула и бодро прошагала к кафедре."
    show sayori zorder 2 at t11
    show monika zorder 1 at thide
    hide monika
    s 1x "Стих называется...{i}Мой луг{/i}."
    s "Ах..."
    s 1s "...Ах-ха-ха-ха!"
    s 4s "Простите, вырвалось..."
    s 4q "Хи-хи-хи..."
    mc "Саёри..."
    s 1l "Это сложнее, чем я думала!"
    s "Как вам это так просто удалось?"
    show monika 3a zorder 2 at t31
    show sayori 1b
    m "Ох..."
    m "Постарайся не думать о том, что ты читаешь это перед публикой."
    m "Представь, что проговариваешь для себя, перед зеркалом, например, или прокручиваешь в голове."
    m "Это же твоё стихотворение, так что оно должно читаться само собой."
    show sayori 1i
    s "Поняла, поняла..."
    s "Окей, значит..."
    show monika zorder 1 at thide
    hide monika
    show sayori 1c
    "Саёри начала читать свой стих."
    "А у меня почему-то возникла мысль, что её мягкий голос идеально его дополняет."
    "В её стихотворении не было необоснованного веселья, которым жила Саёри."
    "Оно было умиротворяющим и горьковато-сладким."
    "Если бы я прочёл это на бумаге, то, наверное, не стал бы вникать..."
    "Но, рассказанное голосом Саёри, оно обретало совершенно новый смысл."
    "Возможно, именно это имела в виду Саёри, когда говорила, что ей нравятся мои стихи."
    "Это ощущение, что ты всё глубже и глубже проникаешь в душу того, кого, казалось, знал до мелочей."
    "Саёри закончила, и мы похлопали."
    s 3q "Я это сделала-а-а!"
    mc "Молодец, Саёри."
    s "Хи-хи, даже [player] оценил."
    s "По-моему хоро-оший зна-ак..."
    mc "Ты о чём вообще?.."
    show monika 2b zorder 3 at f31
    m "Миленько вышло, Саёри."
    m "Атмосфера произведения подошла тебе идеально."
    m "Но с другими стихами такая манера подачи может и не сработать..."
    show monika zorder 2 at t31
    show sayori zorder 3 at f32
    s 1g "Чего? Я не совсем поняла..."
    show sayori zorder 2 at t32
    show monika zorder 3 at f31
    m 1a "Я хочу сказать, что видела у тебя стихи, с которыми подобные мягкие интонации не будут сочетаться."
    m "Для некоторых из них тебе понадобится немного больше экспрессии..."
    show monika zorder 2 at t31
    show sayori zorder 3 at f32
    s 1x "Да, я понимаю, о чём ты!"
    s "Это... Ну, я немного упражнялась в этом..."
    s 5 "Но это как-то стыдно делать при всех..."
    s "Хи-хи..."
    show sayori zorder 2 at t32
    show monika zorder 3 at f31
    m 4a "Тогда в следующий раз я заставлю тебя выбрать стихотворение, над которым тебе придётся поработать чуть больше."
    m "Ты же в курсе, что до фестиваля осталось совсем немного времени?"
    show monika zorder 2 at t31
    show sayori zorder 3 at f32
    s 1q "Оке-е-е-ей."
    show sayori zorder 2 at t32
    show monika zorder 3 at f31
    m 1a "Так, кто там следующий?.."
    m "Нацуки?"
    show natsuki 5s zorder 3 at f33
    show monika zorder 2 at t31
    n "Хмпф."
    n "Пусть [player] идёт передо мной."
    n "Мне, конечно, в любом случае не сравниться с вами..."
    n "Но пускай [player] хотя бы немного понизит ваши стандарты к тому времени, как наступит моя очередь."
    show natsuki zorder 2 at t33
    show sayori zorder 3 at f32
    s 1g "Нацуки..."
    show sayori zorder 2 at t32
    mc "Ладно, ладно."
    mc "Мне всё равно пришлось бы через это пройти."
    mc "Но мне и выбирать-то не из чего..."
    mc "Остаётся только выступить с тем, что я написал к сегодняшнему дню."
    "Я поднялся и занял место у кафедры."
    show natsuki 2c zorder 2 at t44
    show sayori 1a zorder 2 at t43
    show monika 1a zorder 2 at t42
    show yuri 1e zorder 2 at t41
    "Все взгляды сошлись на мне, заставляя чувствовать себя жутко неловко."
    "Я зачитал свой стих."
    "Так как я не был особо уверен в своём творчестве, вкладывать силу в слова оказалось сложно."
    "Но, несмотря на это, по окончании я тоже получил свою порцию аплодисментов."
    mc "Извините, я действительно не дотягиваю до вашего уровня..."
    show monika zorder 3 at f42
    m 1a "Можешь об этом особо не переживать."
    m "Думаю, со способностями у тебя всё в порядке. Тебе просто не хватает уверенности в собственном творчестве."
    m "Но это приходит со временем."
    show monika zorder 2 at t42
    mc "Ага... Наверное."
    show monika zorder 3 at f42
    m 1j "Так, ладно!"
    m 1a "Осталась только ты, Нацуки."
    show monika zorder 2 at t42
    show natsuki zorder 3 at f44
    n 2g "Да, да."
    n "Иду."
    "Нацуки нехотя выбралась из-за парты и потащилась к кафедре."
    show sayori zorder 1 at thide
    show monika zorder 1 at thide
    show yuri zorder 1 at thide
    show natsuki zorder 2 at t11
    hide sayori
    hide monika
    hide yuri
    n 2c "Стихотворение называется..."
    n 2q "Называется..."
    n 1x "Ч-чё вы все на меня вытаращились?!"
    m "Потому что ты выступаешь..."
    n 2x "Хмпф..."
    n 2h "Короче... Стихотворение называется {i}Прыжок{/i}."
    "Нацуки сделала вдох."
    show natsuki 2c
    "Когда она начала читать стих, кислое выражение частично стёрлось с её лица."
    "Энтузиазма ей всё ещё не хватало, но ритм и рифмы было хорошо слышно."
    "Стихотворение было написано в фирменном стиле Нацуки и звучало на удивление хорошо."
    "Слова будто прыгали вверх-вниз, словно оправдывая название."
    show natsuki 2s
    "Нацуки дочитала, и все похлопали."
    "Сопя себе под нос, она вернулась на своё место."
    show monika 2a zorder 3 at f31
    m "Ну вот, ничего страшного же?"
    show monika zorder 2 at t31
    show natsuki 5w zorder 3 at f32
    n "Тебе легко говорить..."
    n "Лучше не заставляй меня делать это снова."
    show natsuki zorder 2 at t32
    show monika 1d zorder 3 at f31
    m "Ох, ну..."
    m "Ты хотя бы чувствуешь себя готовой к выступлению на публике?"
    show monika zorder 2 at t31
    show natsuki 2c zorder 3 at f32
    n "Я хотела сказать, что делать это перед другими будет в разы проще!"
    n "Для чужих людей я могу сделать морду кирпичом."
    n 2q "Но когда передо мной друзья..."
    n "Это как-то.... неудобно."
    show natsuki zorder 2 at t32
    show sayori 1b zorder 3 at f33
    s "Как удивительно, Нацуки..."
    s "Для меня вот совсем наоборот."
    show sayori zorder 2 at t33
    show natsuki zorder 3 at f32
    n "Ну а для меня вот так, поэтому..."
    show natsuki zorder 2 at t32
    show monika zorder 3 at f31
    m 1a "Ну, в таком случае..."
    m "Думаю, о фестивале сильно переживать не стоит."
    m 2b "Тем не менее хочу поблагодарить всех за то, что постарались."
    m "Пускай было нелегко, но зато, надеюсь, все теперь ощутили на себе, каково это."
    m 4b "Не забудьте выбрать стих и хорошенько подготовить его к фестивалю, окей?"
    m "Я буду делать программки, так что предупредите меня о своём выборе заранее."
    show monika zorder 2 at t31
    mc "Блин..."
    mc "Нужно будет, наверное, выбрать какой-нибудь другой стих."
    show monika zorder 3 at f31
    m 1j "Так тоже подойдёт!"
    m 1a "Это не обязательно должен быть твой собственный."
    m "Я и так приятно удивлена, что ты вкладываешь в клуб столько сил."
    m 5 "Это безумно меня радует."
    show monika zorder 2 at t31
    mc "А-а-а... Да ладно, мне нетрудно..."
    play music t8 fadeout 1.0
    show monika zorder 2 at t11
    show sayori zorder 1 at thide
    show natsuki zorder 1 at thide
    hide sayori
    hide natsuki
    m 4b "Так, ребята!"
    m "Думаю, на сегодня достаточно."
    m "Я понимаю, что на носу фестиваль, но давайте постараемся на завтра опять написать стихи."
    m "До сих пор у нас всё получалось, так что я собираюсь продолжить эту традицию."
    m "Что касается фестиваля, закончим обсуждение завтра, а затем у нас будут целые выходные на подготовку."
    m "Понедельник - ответственный день!"
    show sayori 4r zorder 2 at t31
    s "Жду не дожду-у-усь!"
    show yuri 4b zorder 2 at t33
    y "Я смогу... Я смогу..."
    mc "Так-с."
    hide sayori
    hide monika
    hide yuri
    with wipeleft
    "Я поднялся."
    "Естественно, столько энтузиазма, сколько у Саёри и Моники, я в себе не найду, но приложу все усилия."
    "Если это необходимо для клуба..."
    "И чтобы произвести впечатление на Монику..."
    "Мне следует постараться."
    show sayori 1a zorder 2 at t32
    mc "Пойдём, Саёри?"
    show sayori at h32
    s 1x "Ага!"
    show natsuki 2d zorder 3 at f33
    n "Неразлучная парочка. Вечно вот так вместе уходите."
    show monika 5 zorder 3 at f31
    show natsuki zorder 2 at t33
    m "Разве это не трогательно?"
    show monika zorder 2 at t31
    show sayori zorder 3 at f32
    s 1q "Хи-хи-и-и..."
    show sayori zorder 2 at t32
    mc "Блин, ребята..."
    mc "Не нужно делать из этого событие."
    show natsuki zorder 2 at t44
    show sayori zorder 2 at t43
    show monika zorder 2 at t42
    show yuri 1u zorder 3 at f41
    y "Но это, должно быть, так приятно..."
    show yuri zorder 2 at t41
    mc "Ну..."
    mc "Эм-м-м..."
    "И что мне на это отвечать?"
    show sayori zorder 3 at f43
    s 1d "Не напрягайся, [player], тебе не обязательно отвечать."
    show sayori zorder 2 at t43
    mc "...Ладно. Идём уже."
    scene bg residential_day
    with wipeleft_scene
    $ ch2_winner = poemwinner[1].capitalize()
    if ch2_winner == "Sayori":
        $ ch2_winner = "Yuri"
    if ch2_winner == "Natsuki":
        $ ch2_winner = "Нацуки"
    elif ch2_winner == "Yuri":
        $ ch2_winner = "Юри"
    "Я снова иду домой с Саёри."
    "Казалось бы - прошла всего пара дней, а изменилось многое."
    "Но сегодня по дороге домой Саёри вела себя немного тише, чем обычно."
    mc "Эй, Саёри..."
    show sayori 1k at t11
    s "..."
    s 1n "...Прости! Я задумалась!"
    mc "М-да, неудивительно..."
    s 1d "Эм-м..."
    s "Я... думала тут о том разговоре."
    s "Мне нравится, что мы вме..."
    s 1y "Т-то есть..."
    "Промямлила Саёри."
    s 1a "В общем... допустим, в один прекрасный день, [ch2_winner] захочет возвращаться со школы с тобой вместе..."
    mc "Чего?!"
    s "Что ты тогда будешь делать?"
    mc "Что это ещё за вопрос?.."
    mc "Ты ставишь меня в тупик..."
    s 1y "Хи-хи-хи..."
    menu:
        "Ну..."
        "Я стану ходить домой с [ch2_winner].":
            if ch2_winner == "Нацуки":
                call ch2_end_natsuki from _call_ch2_end_natsuki
            else:
                call ch2_end_yuri from _call_ch2_end_yuri
        "Я всё равно буду ходить домой с тобой.":
            call ch2_end_sayori from _call_ch2_end_sayori

    "До фестиваля осталась всего лишь пара дней..."
    "Кто знает, что может произойти за это время?"
    return
label ch2_end_sayori:
    mc "Саёри..."
    mc "Ты серьёзно считаешь, что я могу бросить тебя ради [ch2_winner]?"
    s 1e "Что?!"
    s "Н-но..."
    if ch2_winner == "Нацуки":
        s "Она такая милая и забавная..."
    else:
        s "Она такая красивая и умная..."
    mc "Блин..."
    mc "Я и так вижу её в клубе каждый день."
    mc "К тому же мне всегда казалось, что тебе нравится возвращаться домой в моей компании..."
    mc "Я бы не смог лишить тебя этого."
    s 1y "Ты такой глупый, [player]..."
    s "Иногда ты слишком много думаешь обо мне."
    s "Если бы [ch2_winner] захотела, она могла бы занять моё место, так что..."
    mc "Саёри, я не меняю своих решений."
    mc "Иногда я тебя совсем не понимаю..."
    s "Прости..."
    mc "Кстати, в чём прикол гадать о том, что всё равно никогда не случится?"
    s 1k "Хм..."
    show sayori at thide
    hide sayori
    "Беседа заглохла."
    "Непривычно, что Саёри переживает из-за подобных вещей..."
    "Но я уважаю её мнение и хочу, чтобы она была счастлива."
    return

label ch2_end_natsuki:
    mc "Ходить домой с Нацуки?.."
    "Почему от мысли об этом замирает сердце?.."
    mc "Не знаю..."
    mc "Боюсь, она жестоко бы мне отомстила, если б я ей отказал..."
    s 1x "Она такая милая и забавная, скажи?"
    jump ch2_end_shared

label ch2_end_yuri:
    mc "Ходить домой с Юри?.."
    "Почему от мысли об этом замирает сердце?.."
    mc "Не знаю..."
    mc "Учитывая, как тяжело ей даётся социализация, я бы просто не смог ей отказать, так что..."
    s 1x "Она такая красивая и умная, скажи?"
    jump ch2_end_shared

label ch2_end_shared:
    mc "Да при чём тут это!"
    s 4s "А-ха-ха-ха! Ты это признал!"
    mc "Чёрт..."
    mc "Бессмысленно гадать о том, что всё равно никогда не случится."
    s 1d "Ну, наверное..."
    s "Но мне нравится об этом думать."
    s 1y "Ты же понимаешь, что совсем скоро я стану тебе больше не нужна?"
    mc "Не нужна?.."
    mc "Саёри..."
    mc "Я сейчас совсем не понимаю, что творится в твоей голове."
    s "Прости..."
    mc "Все люди разные..."
    mc "Никто в клубе не заменит мне тебя."
    s 1k "Хм-м-м..."
    s "Ну раз ты так говоришь..."
    show sayori at thide
    hide sayori
    "Беседа заглохла, и на душе остался неприятный осадок."
    "Но она сама виновата, что подловила меня на таком странном вопросе..."
    "Я не умею ей лгать."
    "Но если что-то делает её счастливой, я ни за что это у неё не отниму."
    "Поэтому я и сказал, что гадать тут бессмысленно."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
