label ch3_main:
    scene bg club_day
    with dissolve_scene_half
    play music t3
    show monika 1g at l31
    m "Ну, вот..."
    m "Я снова последняя!"
    mc "Не волнуйся, я тоже только пришёл."
    show yuri 1f zorder 3 at f32
    y "Ты снова практиковалась в игре на пианино?"
    show yuri zorder 2 at t32
    show monika zorder 3 at f31
    m 1l "Ага..."
    m "Ахаха..."
    show monika zorder 2 at t31
    show yuri zorder 3 at f32
    y 1m "У тебя, должно быть, много решимости."
    y "Сначала ты основываешь собственный клуб, а теперь берёшься за пианино..."
    show yuri 1a zorder 2 at t32
    show monika zorder 3 at f31
    m 1a "Ну не то чтобы решимости..."
    m "Скорее страсти."
    m "Не забывайте, что этот клуб не существовал бы, если бы не все вы."
    m 1b "И я очень рада, что вы все хотите помочь мне с подготовкой к фестивалю!"
    show natsuki 1z zorder 3 at f33
    show monika zorder 2 at t31
    n "Эх, жду не дождусь начала фестиваля!"
    n "Будет здорово!"
    show natsuki zorder 2 at t33
    show monika zorder 3 at f31
    m 1d "Э?"
    m "Нацуки, а разве не ты вчера ворчала по этому поводу?"
    show monika zorder 2 at t31
    show natsuki 2a zorder 3 at f33
    n "Ну да."
    n "Я не имею в виду {i}нашу{/i} часть фестиваля."
    n 4l "Но целый день в школе, когда можно играть и есть всякие вкусности!"
    show natsuki zorder 2 at t33
    mc "Ты внезапно произнесла это в стиле Сайори..."
    show natsuki zorder 3 at f33
    n 4a "Моника! А там будет жаренный кальмар?"
    show natsuki zorder 2 at t33
    show monika 2a zorder 3 at f31
    m "Кальмар...?"
    m "Немного странно ждать именно этого..."
    show monika zorder 2 at t31
    show natsuki 2k zorder 3 at f33
    n "Ой, да ладно."
    n "Тебе что, кальмары не нравятся?"
    n "Из всех людей, именно тебе?"
    show natsuki zorder 2 at t33
    show monika 1d zorder 3 at f31
    m "Э? Я не говорила, что не нравятся."
    m "И что вообще значит 'из всех людей'?"
    show monika zorder 2 at t31
    show natsuki 1d zorder 3 at f33
    n "Но ведь!"
    n "Это же прямо в твоём имени!"
    n 4z "Мон-ика!"
    show natsuki zorder 2 at t33
    show monika 5b zorder 3 at f31
    m "Э?!"
    m "Мои имя произносится совсем не так!"
    m "И ещё, в этой шутке теряется смысл при переводе!"
    show monika zorder 2 at t31
    show natsuki zorder 3 at f33
    n 4m "...?"
    show natsuki zorder 2 at t33
    show monika 4l zorder 3 at f31
    m "Да... неважно!"
    m "Давайте сейчас сконцентрируемся на нашем собственном мероприятии, хорошо?"
    show monika zorder 2 at t31
    show natsuki 2a zorder 3 at f33
    n "Эхехе."
    n "Ладно, ладно."
    n "Твоя реакция всё равно не такая забавная, как у Юри или Сайори."
    show natsuki zorder 2 at t33
    show yuri 2h zorder 3 at f32
    y "Прошу прощения..."
    show yuri zorder 2 at t32
    mc "А где, вообще, Сайори...?"
    mc "О, вот ты где."
    hide monika
    hide yuri
    hide natsuki
    with wipeleft
    "Сайори сидит в дальнем углу комнаты и смотрит в пустоту."
    "Я подхожу к ней."
    mc "Эй, Сайори."
    show sayori 1k zorder 2 at t11
    "Я машу рукой перед её лицом."
    s 1n "А...?"
    mc "Ты опять в облаках витаешь."
    s "А-а..."
    s 4l "Эхехе, прости..."
    s "Не обращай внимания."
    s 4y "Можешь поговорить с остальными."
    mc "Эм..."
    mc "У тебя всё хорошо?"
    s 1h "К-конечно!"
    s "С чего бы чему-то быть не так?"
    mc "Просто такое чувство, будто бы у тебя что-то случилось..."
    mc "Прости, что волнуюсь."
    s "Блин, ты слишком обо мне беспокоишься."
    s 4r "Я в норме, видишь?"
    show sayori at h11
    "Сайори широко улыбается."
    s 1a "Не отвлекайся на меня, веселись с остальными ребятами."
    mc "Ну... ладно."
    mc "Раз ты говоришь, что всё нормально."
    show sayori zorder 1 at thide
    hide sayori
    "Я бросаю на Сайори ещё один обеспокоенный взгляд, прежде чем вернуться к остальным."
    "Но обсуждение уже сошло на нет, и все вернулись к обычным делам."
    "Может, стоит спросить Монику, не замечала ли она никаких странностей за Сайори в последнее время..."
    "Раз уж они готовятся к фестивалю, то должно быть, проводят немало времени вместе."
    "Я украдкой приблизился к Монике, уткнувшейся в какие-то документы на столе."
    show monika 2b zorder 2 at t11
    m "[player]! Как дела?"
    mc "Слушай, это может прозвучать странно, но..."
    mc "Ты не замечала ничего странного за Сайори в последнее время?"
    m 1d "С ней что-то не так?.."
    m "В каком смысле?"
    mc "Я, может, слишком мнительный, но мне кажется, что она сегодня какая-то подавленная..."
    m "Хм? Ты думаешь?"
    m "Не могу сказать, будто заметила, что с ней что-то не так..."
    "Моника мельком взглянула через классную комнату на Сайори, которая бездумно тёрла ластиком по парте."
    m "Может, она о чём-то задумалась..."
    m 2a "Но меня удивляет, что это не я тебя об этом спрашиваю, [player]."
    m "Ты ведь, определённо, знаешь её лучше меня."
    mc "Да, но знаешь, она никогда себя так не вела..."
    mc "Она всегда говорила со мной о том, что её беспокоит."
    mc "Но в этот раз, когда я её спросил, она ушла от ответа."
    mc "...Ты прости, знаю, это не твоя проблема!"
    mc "Я просто хотел спросить, не знаешь ли ты о чём-нибудь, потому всё и выложил, как есть..."
    m 1g "Нет, нет..."
    m "Для меня это тоже важно."
    m 1e "Ну, то есть, я ведь тоже её подруга..."
    m "И, кроме того, я должна заботиться о благополучии участников клуба."
    m 1i "Может, мне стоит попробовать с ней поговорить..."
    mc "Что? Ты уверена насчёт этого?"
    mc "Похоже, ей сейчас хочется побыть одной..."
    m "Думаешь?"
    m "Может, ей просто тяжело обсудить то, что её тревожит, с причиной этих мыслей..."
    mc "Причиной этих мыслей...?"
    mc "Что ты имеешь в виду?"
    m 2e "Ну, я говорю о том, что, может, её голова забита мыслями о тебе, [player]."
    mc "Обо мне?.."
    mc "Как ты вообще пришла к такому выводу?"
    m 1j "Ну..."
    m "Наверное, мне не стоит этого говорить, но..."
    m 1a "Сайори говорит о тебе больше, чем о ком-либо ещё."
    mc "Э?.."
    m "Она стала намного счастливее, когда ты присоединился к этому клубу."
    m "Как будто бы внутри неё зажёгся ещё один огонёк."
    mc "Чего?"
    mc "Да нет..."
    mc "Сайори... она всегда была такой."
    mc "Она всегда сияла, лучилась изнутри."
    mc "Нет никакой разницы между тем, какой она была раньше, и сейчас."
    m 5 "Хех."
    m "Забавный ты, [player]."
    m "Ты не думал, что, может, она постоянно так жизнерадостна на твоих глазах..."
    m "...оттого, что с ней рядом именно ты?"
    mc "..."
    m 1n "Ах... Разболталась я."
    m "Прости... и откуда мне вообще что-то знать наверняка?"
    m 1a "Я не собиралась строить тут предположения, так что просто забудь, что я сейчас наговорила."
    m "Я с ней попробую поговорить, так что не забивай себе этим голову."
    mc "Эм..."
    mc "Ладно..."
    "Моника многозначительно улыбнулась."
    "Да, она сказала не забивать голову..."
    "Но я понял, что мне так запросто не выкинуть её слова из головы."
    show monika zorder 1 at thide
    hide monika
    "Моника встала из-за стола, прошла по комнате туда, где сидела Сайори."
    "Я видел, как она присела рядом с Сайори и стала с ней ласково разговаривать."
    "Но она говорила так тихо, что со своего места я не слышал, о чём именно."
    "Я вздохнул и нашёл место, чтобы сесть."
    "Да, Сайори сказала о ней не беспокоиться и веселиться с остальными..."
    "Но это невозможно, когда она так себя ведёт."
    "Как же, оказывается, я за неё волнуюсь, раз меня настолько тяготит эта ситуация?"
    "Теперь мне кажется, что единственный, кто ведёт себя не так -- это я..."
    "Но мне ничего не остаётся, кроме как дожидаться Моники."





    if n_appeal == 0 and y_appeal == 0:
        jump ch3_start_none
    elif n_appeal > 1:
        jump ch3_start_natsuki
    elif y_appeal > 1:
        jump ch3_start_yuri
    elif poemwinner[1] == "natsuki":
        jump ch3_start_natsuki
    elif poemwinner[1] == "yuri":
        jump ch3_start_yuri
    elif poemwinner[0] == "natsuki":
        jump ch3_start_natsuki
    elif poemwinner[0] == "yuri":
        jump ch3_start_yuri
    else:
        jump ch3_start_none

label ch3_start_natsuki:
    play music t6 fadeout 1
    show natsuki 3c zorder 2 at t11
    n "Эй, ты."
    mc "Чего?"
    "Я заметил, что Нацуки стояла около меня."
    n "Ты так и собираешься сидеть и смотреть в никуда?"
    n "Времени-то не очень много, так что..."
    mc "Ой, прости."
    mc "Я не хотел заставлять тебя волноваться или типа того."
    n 1q "Д-да я и не волновалась, как бы!"
    n "Я просто..."
    "Нацуки потупила взгляд."
    "В руках она держит выпуск манги."
    mc "Да, ты права..."
    mc "Просто было тут кое-что, но сейчас мы можем начинать."
    mc "Не могу заставлять тебя ждать."
    n 5n "Блин..."
    n "Теперь из-за тебя я чувствую себя сволочью."
    n "Если тебя что-то беспокоит, и ты хочешь, чтобы я отстала, то так и скажи, и я отступлюсь."
    n 5u "Ну, то есть..."
    n "Ну, или, может, ты хочешь об этом поговорить, или типа того..."
    "Последнюю фразу она буквально промямлила."
    mc "Да нет... я скорее всего просто раздуваю из мухи слона."
    mc "Я просто о Сайори думал, вот и всё."
    n 1p "С-Сайори?.."
    n "Ты о ней думал?.."
    mc "Да, сегодня она выглядит несколько огорчённой."
    mc "Но она не хочет мне в этом признаваться."
    mc "Поэтому мне ничего не остаётся, кроме как гадать, что же с ней приключилось."
    n 1q "О..."
    "Нацуки протяжно выдохнула."
    n 4w "Ну, во-первых..."
    n "Тебе надо серьёзно подтянуть твои разговорные навыки!"
    n 4c "И всё-таки..."
    n "Она же твой лучший друг, так?"
    mc "Да, наверное..."
    n "Вот."
    n 3k "В таком случае, я думаю, тебе нужно больше ей доверять."
    n "Если она тобой дорожит, то к тебе первому она и подойдёт, если что, так ведь?"
    mc "Ну... наверное, так."
    n 3c "Наверное, у всех такие дни бывают."
    n "Их не всегда получается избегать."
    n "И если она не хочет, чтобы ты беспокоился о чём-то, то, наверное, она считает, что это не так уж и важно."
    mc "Да, что-то такое она мне и сказала..."
    mc "Наверное, не стоит идти против её воли."
    n 3a "Вот именно."
    n "Если бы она хотела, чтобы ты о ней беспокоился, то это было бы более заметно."
    mc "Да..."
    mc "Я так и думал с самого начала."
    show natsuki 3q
    "Нацуки перебирала книгу у себя в руках."
    n 1q "Она..."
    n "Она для тебя много значит, да ведь?.."
    mc "А..."
    mc "Ты только не пойми неправильно...!"
    mc "Это же обычное дело, волноваться о своих друзьях."
    mc "Мы просто очень долго были лучшими друзьями."
    mc "Ну, то есть ты ведь всё волновалась обо мне, поэтому..."
    n 4w "Ничего я не волновалась!!"
    n "Блин... если у тебя всё нормально, то давай уже быстрее начнём!"
    mc "Да, да..."


    if not n_exclusivewatched and poemwinner[2] == "natsuki":
        call natsuki_exclusive_2_ch3 from _call_natsuki_exclusive_2_ch3
    else:
        jump ch3_start_none
    return

label ch3_start_yuri:
    "Отчего у меня чувство, будто за мной наблюдают...?"
    "Я оглядел комнату."
    show yuri 2t zorder 2 at t11
    "Вдруг я увидел, что Юри поглядывает на меня поверх книги."
    show yuri 4b
    "Но она тут же отвернулась со смущённым выражением лица."
    "Я понял, что она так ничего не добьётся."
    "Я никогда не видел, как Юри сама, по собственному желанию, подходила к кому-нибудь и начинала разговор."
    "Поэтому у меня не оставалось выбора, кроме как самому подойти к ней."
    "Мне-то легче так сделать."
    "Я встал из-за своего стола и сел за тот, который был около неё."
    play music t6 fadeout 1
    y 2v "..."
    y "Я... не хотела тебя отвлекать..."
    mc "Не переживай, я не был ничем занят."
    y "Но ведь..."
    y "Я предположила, что тебе хотелось побыть со своими мыслями наедине..."
    mc "Наедине с моими мыслями...?"
    mc "Что же тебя заставило так думать?"
    y 1t "Ну..."
    y "Со мной такое часто бывает..."
    y "Поэтому я легко поняла это по твоей позе и выражению лица."
    y 3o "Н-не то чтобы я за тобой подглядывала или типа того...!"
    y "Я бы не стала заниматься такими жуткими вещами...!"
    mc "Ну, в любом случае, ты права."
    mc "Извини, что вызвал твоё беспокойство."
    y 1s "Не нужно извиняться..."
    y "Твои проблемы -- это беспокойства для тех, кто желают разделить эту ношу."
    y "Есть, конечно же, те, кому комфортнее от них оградиться..."
    y "Но если ты хотел бы поделиться со мной тем, что тебя гложет, то я была бы рада выслушать."
    mc "Что ты, это не такая уж и большая проблема..."
    mc "У меня просто душа не на месте из-за Сайори."
    y 2t "Сайори...?"
    mc "Да... похоже, что сегодня она немного не в себе, но когда я её об этом спросил -- она отнекивалась."
    mc "Поэтому мне ничего не остаётся, кроме как гадать, что же с ней приключилось."
    y 3u "О?"
    y "Это так романтично..."
    mc "Э...?"
    y 4c "И-извини!"
    y "Я не хотела говорить что-то глупое...!"
    mc "Всё не так, я не хотел бы вводить тебя в заблуждение."
    mc "Просто мы с Сайори уже долгое время лучшие друзья, вот и всё."
    y 2l "А... понятно..."
    y 2f "Тогда, наверное, для неё это не свойственно, избегать разговора с тобой о её чувствах..."
    mc "Ну, или может я слишком надумываю..."
    y 1u "[player]..."
    y "Мир наполнен смыслом, который очень часто скрыт прямо на виду."
    y 1s "И у каждого человека найдётся множество тайн, не важно, насколько хорошо ты его знаешь."
    mc "А..."
    mc "То есть ты думаешь, что тут всё-таки что-то кроется?"
    y 1l "Хм..."
    y "Я думаю, Сайори очень многогранная личность."
    y 1h "Её поведение не всегда соответствует тому, что происходит у неё в голове..."
    y "И она не всегда может точно знать, чего хочет на самом деле."
    y "Я тоже заметила сегодня её странное поведение..."
    y "И тоже беспокоюсь о ней."
    y 1f "Но в твоём случае, такое чувство, будто бы она полностью заняла всё твоё внимание?"
    mc "Ну..."
    mc "Думаю, так и есть."
    y 3u "Сайори..."
    y "Она для тебя... она много для тебя значит, да?"
    mc "Эм... ну... наверное"
    mc "Но не надо делать из этого выводы!"
    mc "Мы просто хорошие друзья, вот и всё..."
    y 2t "..."
    "Юри вдруг взглянула мне прямо в глаза."
    "У неё было ласковое, и в то же время любознательное выражение лица, будто бы она хочет что-то разглядеть."
    "Я смутился и отвёл взгляд."
    y 2m "А порой..."
    y "Тайны человека остаются тайнами и для него самого."
    y 2a "И ты, такой честный и заботливый..."
    y "Можешь открыть в себе чувства, о которых ты и не догадывался."
    y 4b "И..."
    y "Мне кажется..."
    y "Ей очень повезло, раз..."
    y "Такой человек, как ты... чувствует такое по отношению к ней."
    mc "Юри..."
    mc "Ты слишком хорошо обо мне думаешь."
    mc "Я просто обычный парень."
    mc "Так что прекрасно понимаю собственные чувства."
    mc "Я и близко не такой утончённый, как ты."
    y 2t "А..."
    y "Ты мне... комплимент высказал?"
    mc "Высказал, что высказал."
    mc "Короче, пока мы тут, может давай за чтение возьмёмся?"
    y 2s "Ну..."
    y "Если только всё нормально."
    mc "Да."
    mc "Мне нужно выкинуть это всё из головы."


    if not y_exclusivewatched and poemwinner[2] == "yuri":
        call yuri_exclusive_2_ch3 from _call_yuri_exclusive_2_ch3
    else:
        jump ch3_start_none
    return

label ch3_start_none:
    if not renpy.music.get_playing(channel='music') == audio.t3:
        stop music fadeout 1.0
    scene bg club_day
    with wipeleft_scene
    "..."
    if not renpy.music.get_playing(channel='music') == audio.t3:
        play music t3
    show monika 4b zorder 2 at t11
    m "Итак, ребята!"
    "Спустя некоторое время Моника обратилась к клубу."
    m "Почему бы нам не обменяться поэмами?"
    show monika zorder 1 at thide
    hide monika
    "Прежде чем я успел что-либо понять, всё стало как обычно."
    "Все начали вынимать свои поэмы. Я тоже вынул свою."
    "Наши с Моникой взгляды встретились, и она мне улыбнулась."
    "Интересно, о чём она поговорила с Сайори..."
    return


label ch3_end:
    stop music fadeout 1.0
    scene bg club_day
    show monika 4b zorder 2 at t32
    with wipeleft_scene
    play music t3
    m "...Ладно, вы трое!"
    m "Обмениваться поэмами мы закончили, так?"
    m "Может, нам стоит кое-что обсудить..."
    show natsuki 3c zorder 3 at f31
    n "Секундочку!"
    n "Мне показалось, или ты сейчас что-то странное сказала?"
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 4d "Чего?.."
    show monika zorder 2 at t32
    show yuri 1e zorder 3 at f33
    y "Что-то действительно прозвучало непривычно..."
    y "Это точно."
    y 1f "Ты изменила свою фирменную фразу, которой ты обращаешься к клубу."
    show yuri zorder 2 at t33
    show monika 1n zorder 3 at f32
    m "Ф-фирменную фразу?"
    m "Нет у меня такой фразы..."
    show monika zorder 2 at t32
    show natsuki 4q zorder 3 at f31
    n "Блин..."
    n "И чего сегодня у всех настроение такое?"
    n "Вон, даже Юри не может этого не замечать."
    show natsuki zorder 2 at t31
    show yuri 4b zorder 3 at f33
    y "Хм..."
    y "Есть в напряжённой атмосфере что-то, что предвещает, будто грядёт нечто ужасное..."
    show yuri zorder 2 at t33
    mc "Только в {i}твоих книгах{/i} так и бывает!"
    mc "Слушайте, единственное, что сегодня по-другому -- это отсутствие Сайори."
    show yuri 2g zorder 3 at f33
    y "..."
    y "...Похоже, ты прав.."
    show yuri zorder 2 at t33
    show monika 2r zorder 3 at f32
    m "Эх..."
    m 2d "Сайори всегда приходила на выручку, если нужно было разрядить обстановку, да?"
    m "У всех будто бы всё не так, когда её нет рядом..."
    show monika zorder 2 at t32
    show natsuki 3k zorder 3 at f31
    n "Куда она вообще убежала?"
    n "Я думала, она только по-маленькому."
    show natsuki zorder 2 at t31
    show yuri 1l zorder 3 at f33
    y "Нацуки, прояви немного уважения..."
    show yuri zorder 2 at t33
    show natsuki 4w zorder 3 at f31
    n "Ой, всё."
    show natsuki zorder 2 at t31
    mc "Эх, она почувствовала себя не очень хорошо и пошла домой пораньше..."
    show yuri 2t zorder 3 at f33
    y "Правда...?"
    y "Надеюсь, с ней всё нормально..."
    show yuri zorder 2 at t33
    show natsuki 5c zorder 3 at f31
    n "Серьёзно?"
    n "Из всех тех раз, когда ты не провожаешь её домой, ты выбрал тот день, когда она себя плохо чувствует?"
    n "Вот тебе и любвеобильная парочка."
    show natsuki zorder 2 at t31
    mc "Да нет!"
    mc "Во-первых, хватит надумывать на нашу с Сайори дружбу!"
    mc "А во-вторых..."
    mc "Сегодня она меня, в некотором роде, избегала, так что я не хотел докапываться..."
    show yuri 1g zorder 3 at f33
    y "У-у-у?"
    show yuri zorder 2 at t33
    mc "{i}Такое заинтересованное выражение лица, и именно у Юри?? {/i}"
    show monika 1r zorder 3 at f32
    m "Давайте все успокоимся...!"
    m 1d "Я с ней недавно общалась, и всё у неё нормально."
    show monika zorder 2 at t32
    mc "Что она сказала...?"
    show monika zorder 3 at f32
    show yuri 1e
    m 1a "Короче, нам нужно решить, что осталось подготовить к фестивалю, поэтому..."
    m "Давайте решим, чем каждый будет заниматься в эти выходные."
    show monika zorder 2 at t32
    show natsuki 4l zorder 3 at f31
    n "Я уже знаю, чем буду {i}лично я{/i} заниматься!"
    show natsuki zorder 2 at t31
    show monika 2b zorder 3 at f32
    m "Это верно."
    m "Нацуки будет печь кексы."
    m "Но нам понадобится немало порций, и ещё с разными вкусами..."
    m "Ты сможешь со всем справиться сама, Нацуки?"
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 4z "Вызов принят!"
    show natsuki 4a zorder 2 at t31
    show monika zorder 3 at f32
    m 1a "Что касается меня..."
    m "Я займусь распечаткой и составлением поэтических буклетов."
    m "Сайори будет мне с этим помогать."
    m "Теперь насчёт Юри..."
    m 1d "..."
    m 3n "Юри, ты могла бы..."
    m "А... Эм..."
    show monika zorder 2 at t32
    show natsuki 3c zorder 3 at f31
    n "...?"
    show natsuki zorder 2 at t31
    show monika 5 zorder 3 at f32
    m "Ребята..."
    m "Вы не могли бы мне помочь подобрать для Юри какое-нибудь дело...?"
    show monika zorder 2 at t32
    show yuri 4c zorder 3 at f33
    y "Я..."
    y "Я бесполезна..."
    show yuri zorder 2 at t33
    show monika 1g zorder 3 at f32
    m "Н-нет!"
    m "Что ты, вовсе нет!"
    m "Ты самая талантливая из всех нас, к твоему сведению!"
    show monika zorder 2 at t32
    show natsuki 5g zorder 3 at f31
    n "..."
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 1g "Ну вот, теперь и Нацуки надулась??"
    show monika zorder 2 at t32
    mc "Блин, теперь и я понял..."
    mc "Похоже, я недооценивал Сайори: видно, как тебе тяжело организовывать без её помощи."
    show monika zorder 3 at f32
    m "Э..."
    m "Пожалуй..."
    m 1i "Но если я самостоятельно не стану лидером, то не вырасту как личность."
    m 2i "Поэтому, Юри..!"
    m 2a "У тебя же красивый почерк, так ведь?"
    m "Значит, ты могла бы оформить какие-нибудь растяжки или украшения, чтобы добавить атмосферности."
    show monika zorder 2 at t32
    show yuri 4a zorder 3 at f33
    y "Атмосферности?.."
    y "Ну, вот это..."
    y "Мне..."
    y 2r "Мне нравится, когда атмосферно!"
    show yuri 2l
    "Юри вдруг переменилась в лице, сосредоточенно уставилась в точку на столе и начала кивать в такт своим мыслям."
    show yuri zorder 2 at t33
    mc "У тебя уже шестерёнки забегали в нужном направлении, как я погляжу..."
    show monika 2b zorder 3 at f32
    m "Вот и замечательно!"
    m "Твоя помощь будет очень кстати, Юри."
    m 2a "Но всё же..."
    m "Остался только ты, [player]."
    show monika zorder 2 at t32
    mc "Тот, кто по-настоящему бесполезен."
    show monika 1k zorder 3 at f32
    m "Ахаха! Не говори такого."
    m 1b "В целом..."
    m "На плечи Нацуки и Юри легли тяжёлые задачи."
    m "Хорошо бы тебе было помочь одной из них."
    m 1m "Ты также можешь помочь и мне..."
    m 1a "Я была бы очень благодарна."
    show monika zorder 2 at t32
    mc "Эм..."
    mc "Ну это..."
    "Моника что, предлагает мне провести выходные с одной из участниц клуба?"
    "Как они вообще отреагируют на подобное предложение...?"
    show yuri 1u zorder 3 at f33
    y "А..."
    y "Я... полагаю, мне не помешает некоторая помощь..."
    show yuri zorder 2 at t33
    show natsuki 3c zorder 3 at f31
    n "Ну, хоть ты и не умеешь делать выпечку, я могла бы найти для тебя какую-нибудь грязную работу."
    n 3q "Похоже, что выбора у меня особого нет, да и всё равно Моника с тебя не слезет и заставит что-нибудь делать..."
    "Нацуки пробубнила ещё какие-то оправдания, какие смогла придумать."
    show natsuki zorder 2 at t31
    show yuri 2k zorder 3 at f33
    y "Эм..."
    y "Насколько я помню, Нацуки..."
    y 2f "Ты говорила, что предпочла бы разобраться с выпечкой самостоятельно."
    y "[player] вряд ли будет в восторге, если станет для тебя обузой..."
    y 2i "Следовательно..."
    y "Ему больше придётся по нраву принять участие в подготовке оформления."
    show yuri zorder 2 at t33
    show natsuki 4e zorder 3 at f31
    n "Погоди-ка! Я такого не говорила!"
    n 4h "И вообще, насколько тяжело сделать парочку украшений?"
    n "Больше похоже, что ты выдумываешь оправдания, чтобы [player]..."
    show natsuki zorder 2 at t31
    show yuri 3n zorder 3 at f33
    y "Ч-что же ты такое говоришь?!"
    y "Это будет крайне кропотливая работа..."
    show yuri zorder 2 at t33
    show natsuki 5w zorder 3 at f31
    n "А готовка -- нет, что ли?"
    n "Да что ты вообще понимаешь..."
    show natsuki zorder 2 at t31
    show monika 2g zorder 3 at f32
    m "Ребята, ребята!"
    m "Давайте на секундочку успокоимся..."
    m 2d "Я думаю, что в итоге, именно [player] будет выбирать, кому он хочет помочь."
    m "Кроме того..."
    m 5 "Ему пока что не доводилось провести со мной хоть немного времени."
    m "Поэтому я уверена, ему будет интереснее..."
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 4f "Ты только что {i}буквально{/i} сказала, что..."
    show natsuki zorder 2 at t31
    show yuri 2h zorder 3 at f33
    y "Я-я тоже поражена!"
    show yuri zorder 2 at t33
    show monika 1l zorder 3 at f32
    m "Простите, извините!"
    m "Я просто заболталась, поэтому..."
    show monika zorder 2 at t32
    show natsuki 4x zorder 3 at f31
    n "Да блин..."
    n "Мы можем уже поскорее с этим закончить?"
    show natsuki zorder 2 at t31
    show monika 1e zorder 3 at f32
    m "Да..."
    m "[player], ты же не против, верно?"
    m 1a "В конце концов, решать тебе."
    show monika zorder 2 at t32
    mc "Эм..."
    mc "Конечно."
    show natsuki 5g zorder 3 at f31
    n "Хм."
    show natsuki zorder 2 at t31
    show yuri 1f zorder 3 at f33
    y "Хорошо..."
    show yuri zorder 2 at t33
    show monika 1a zorder 3 at f32
    m "Ну раз так..."
    show monika zorder 2 at t32
    "Все смотрят прямо на меня."
    menu:
        "Но я, конечно, собираюсь помочь..."
        "Нацуки.":
            call ch3_end_natsuki from _call_ch3_end_natsuki
        "Юри.":
            call ch3_end_yuri from _call_ch3_end_yuri
        "Монике.":
            call ch3_end_monika from _call_ch3_end_monika
        "Сайори...":
            call ch3_end_sayori from _call_ch3_end_sayori
    scene bg residential_day
    with wipeleft_scene
    $ ch4_name = ch4_scene.capitalize()
    if ch4_name == "Yuri":
        $ ch4_name = "Юри"
    else:
        $ ch4_name = "Нацуки"
    "Не могу поверить!"
    "[ch4_name] придёт ко мне домой в воскресенье...?"
    if help_sayori:
        "Хотя я предпочёл бы провести время с Сайори..."
        "Тревога во мне просто бьёт ключом."
        "Хоть мне кажется, что я уже понял как наладить с ней контакт..."
        "Но кто знает, что может произойти за пределами школы?"
        "Она даже сказала, что очень этого ждёт..."
        "Я помотал головой."
        "Почему мне не по себе от мысли, что Сайори об этом узнает?"
        "Мы ведь не в каких-то {i}особых{/i} отношениях..."
        "Кроме того, как сказала Моника, это же на благо клуба."
        "Не о чем беспокоиться."
        "Если я к этому буду так относиться, то всё пройдёт весело."
    else:
        "Тревога во мне просто бьёт ключом."
        "Хоть, мне кажется, что я уже понял как наладить с ней контакт..."
        "Но кто знает, что может произойти за пределами школы."
        "Она даже сказала, что очень этого ждёт..."
        "Неужели это шанс для меня стать с ней немного ближе?"
        "...Или для этого ещё слишком рано?"
        "Время покажет..."
        "Но до тех пор, я не смогу перестать об этом думать."
        "Просто не могу дождаться!"
    return

label ch3_end_sayori:
    $ help_sayori = True
    mc "Как бы..."
    mc "Если уж и помогать кому-то, то я выберу Сайори."
    mc "То есть мы же соседи, и..."
    show yuri 2f zorder 3 at f33
    y "Но Моника сказала..."
    show yuri zorder 2 at t33
    show natsuki 4w zorder 3 at f31
    n "Моника сказала, что Сайори будет помогать ей!"
    n "Блин..."
    n 4h "Ты что, настолько меня терпеть не можешь?"
    show natsuki zorder 2 at t31
    mc "Н-нет!"
    show monika 1e zorder 3 at f32
    m "Прости, я не думала, что это вдруг будет так сложно..."
    show monika zorder 2 at t32
    menu:
        m "Просто подумай о клубе, ладно?"
        "Нацуки.":
            call ch3_end_natsuki from _call_ch3_end_natsuki_1
        "Юри.":
            call ch3_end_yuri from _call_ch3_end_yuri_1
        "Моника." if help_monika == None:
            call ch3_end_monika from _call_ch3_end_monika_1
    return


label ch3_end_monika:
    $ help_monika = True
    mc "Что ж, наверное, мне стоит оказать помощь Монике..."
    show monika 5 zorder 3 at f32
    m "Ура, ты выбрал меня!"
    show monika zorder 2 at t32
    show natsuki 3e zorder 3 at f31
    stop music fadeout 1.0
    n "Погоди-ка секунду!"
    show natsuki zorder 2 at t31
    show yuri 2r zorder 3 at f33
    y "Д-да!"
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    play music t7
    n "Моника, тебе меньше всех нас потребуется помощь!"
    show natsuki zorder 2 at t31
    show monika 1d zorder 3 at f32
    m "А? Но..."
    show monika zorder 2 at t32
    show yuri 1h zorder 3 at f33
    y "Я соглашусь с Нацуки."
    y 1l "Мало того, что твоя работа больше всего подходит для работы в одиночку..."
    y "Так у тебя ещё есть и Сайори."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m 1p "Но ведь [player] сам ..."
    m "А..."
    show monika zorder 2 at t32
    show natsuki 3c zorder 3 at f31
    n "Это не важно."
    n "Это же ты его изначально запугала, что ему нужно выбрать тебя."
    n 3e "Ты же президент клуба, Моника."
    n "Ты должна принимать ответственные решения на благо клуба!"
    show natsuki zorder 2 at t31
    show yuri 2f zorder 3 at f33
    y "Моника, тебе следует принимать решения безо всяких задних мыслей."
    show yuri zorder 2 at t33
    show monika 2i zorder 3 at f32
    m "Задних мыслей?"
    m "Д-да о чём ты вообще говоришь, Юри?"
    m "Это вообще звучит так, будто бы это у вас, ребята, есть какие-то корыстные цели!"
    show monika zorder 2 at t32
    show natsuki 1x zorder 3 at f31
    n "{i}Чего{/i}, простите?"
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m "Если бы было не так... то весь этот выбор не был бы таким серьёзным событием!"
    show monika zorder 2 at t32
    show yuri 3r zorder 3 at f33
    y "Моника... это совершенно не так!"
    show yuri zorder 2 at t33
    show natsuki 3e zorder 3 at f31
    n "Да!"
    n "Нам многое предстоит сделать, к твоему сведению!"
    n "Вряд ли мы со всеми делами хорошо управимся, если будем делать в одиночку."
    show natsuki zorder 2 at t31
    show monika 1p zorder 3 at f32
    m "Э... ну может... это так и есть..."
    show monika zorder 2 at t32
    show yuri 2l zorder 3 at f33
    y "Подумай о клубе, Моника..."
    y "Если мы хотим, чтобы наше мероприятие снискало успех, то мы должны с ответственностью подойти к распределению ресурсов."
    show yuri zorder 2 at t33
    show monika 3n zorder 3 at f32
    m "Эм..."
    m "А..."
    show monika zorder 2 at t32
    show natsuki 4x zorder 3 at f31
    n "Ну так, ты примешь верное решение, а, {i}президент{/i}?"
    show natsuki zorder 2 at t31
    show monika 1p zorder 3 at f32
    m "Ладно-ладно!"
    m "Я поняла!"
    stop music fadeout 1.0
    show natsuki 4g
    show yuri 2g
    m 1r "Вздох..."
    m 1g "Тогда... технически, будет гораздо логичнее, если [player] поможет кому-то из вас двоих."
    m "Поэтому..."
    m 1c "Наверное... так мы и решим."
    show monika zorder 2 at t32
    play music t3
    menu:
        m "Есть какие-нибудь предпочтения, [player]?"
        "Нацуки.":
            call ch3_end_natsuki from _call_ch3_end_natsuki_2
        "Юри.":
            call ch3_end_yuri from _call_ch3_end_yuri_2
        "Сайори..." if help_sayori == None:
            call ch3_end_sayori from _call_ch3_end_sayori_1
    return

label ch3_end_natsuki:
    $ ch4_scene = "natsuki"
    mc "Что ж, как по мне, выпечка -- занятие не из весёлых..."
    mc "А вас послушаешь -- так это ещё настолько сложно, что потребуется второй человек."
    show natsuki 4l zorder 3 at f31
    n "Да не переживай!"
    n "Выпекать -- это очень весело!"
    n "Сам увидишь!"
    show natsuki zorder 2 at t31
    show monika 1d zorder 3 at f32
    m "Э?"
    m "Лишь минуту назад ты говорила, что..."
    show monika zorder 2 at t32
    show natsuki 1q zorder 3 at f31
    n "Ну я это...!"
    n "..."
    n "...Слушай, пофиг уже, ок?"
    show natsuki zorder 2 at t31
    show monika 2a zorder 3 at f32
    m "Ну, ладно тогда..."
    m "Ты ведь справишься сама, Юри??"
    show monika zorder 2 at t32
    show yuri 1j zorder 3 at f33
    y "Конечно."
    y "Я уже к этому привыкла..."
    show yuri 1g zorder 2 at t33
    show monika 1e zorder 3 at f32
    m "..."
    show monika zorder 2 at t32
    mc "..."
    show monika zorder 3 at f32
    m 1n "Ну, вот... и хорошо..."
    "Пусть Юри немного драматизирует, но трудно не чувствовать себя виноватым..."
    show monika 1m zorder 2 at t32
    show natsuki 3a zorder 3 at f31
    n "Значит, на этом всё?"
    n "Нам ещё что-нибудь надо обсудить??"
    show natsuki zorder 2 at t31
    show monika 1a zorder 3 at f32
    m "Нет, я думаю, на этом всё..."
    m "Вы, ребята, взволнованы?"
    show monika zorder 2 at t32
    show natsuki 1z zorder 3 at f31
    n "Ага!"
    n "Всё, кроме выступления, будет офигенным!"
    show natsuki 1a zorder 2 at t31
    mc "Не думаю, что это стоит учитывать..."
    show monika zorder 3 at f32
    m "А как ты думаешь, [player]?"
    show monika zorder 2 at t32
    mc "Я?"
    mc "Ну, я думаю, что мне интересно будет посмотреть, чем вся эта история обернётся..."
    show monika 2b zorder 3 at f32
    m "Меня это устраивает!"
    m "А что насчёт тебя, Юри?"
    m 2d "...Юри?"
    show monika zorder 2 at t32
    show natsuki 3c zorder 3 at f31
    n "Снова она мрачнее тучи."
    show natsuki zorder 2 at t31
    show yuri 4b zorder 3 at f33
    y "..."
    show yuri zorder 2 at t33
    show natsuki 5n zorder 3 at f31
    n "..."
    "Нацуки надула губки."
    n "Это же..."
    n 5m "Ну, то есть, это ведь не такое уж и грандиозное событие или типа того..."
    show natsuki zorder 2 at t31
    mc "Ну, дело может и не только в этом..."
    show natsuki zorder 3 at f31
    n "...?"
    show natsuki zorder 2 at t31
    mc "Она, наверное, просто в целом чувствует себя недооценённой."
    mc "Вызвалась сделать что-то, и никто не предложил помощи."
    show natsuki zorder 3 at f31
    n 5q "Это же не значит..."
    n "..."
    n 5r "Мм..."
    show natsuki 5u
    "Нацуки переводила взгляд с одного из нас на другого с обеспокоенным выражением лица."
    n 1u "Слушай..."
    "Нацуки подошла и положила руки на плечи Юри."
    n 1h "Юри."
    n "Ты самая талантливая из всех нас, к твоему сведению!"
    n "И..."
    n "Твоя помощь позволит сделать мероприятие гораздо более весёлым и привлекательным."
    n 1q "Кексы, надо сказать, тоже очень сильно помогут..."
    n 3h "Но ведь ты создашь особую атмосферу."
    n "Это так важно для впечатлений, которые останутся у людей от выступлений."
    n "Поэтому..."
    n 4w "Тебе пора завязывать тупить и уже начать ценить себя хоть немного больше!"
    "Нацуки отпустила руки и отвернулась в другую сторону."
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f33
    y 4a "..."
    y "Ты же... на самом деле так не думаешь, да?"
    show yuri zorder 2 at t33
    show natsuki 5u zorder 3 at f31
    n "Эм..."
    n "Ну не совсем, но..."
    show natsuki zorder 2 at t31
    "Не одна Юри была ошарашена."
    "И Моника, и я стояли, поражённые словами Нацуки."
    "Трудно поверить, что Нацуки может говорить вдохновляющие вещи."
    "Но я начал понимать."
    "Нацуки пыталась звучать, как Сайори."
    "Даже если получилось не идеально, надо признаться, что она пыталась сказать что-то, что сказала бы Сайори в такой момент."
    "Ведь Сайори всегда помогает другим улыбнуться и почувствовать себя немного лучше."
    show yuri 2l zorder 3 at f33
    y "Прости... что тупила."
    y 2i "Я буду очень стараться."
    y "Мы все потрудимся, чтобы сделать потрясающее мероприятие."
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 5j "Ага."
    show natsuki zorder 2 at t31
    show monika 2k zorder 3 at f32
    m "Ура!"
    m 2b "Надеюсь, что у всех всё получится."
    m "Ну и на этом..."
    m "На сегодня у нас всё."
    m "Поэтому я думаю, что пора нам уже расходиться."
    show monika zorder 2 at t32
    show natsuki 3k zorder 3 at f31
    n "Ладно, но мне нужно тут немного задержаться."
    n "Я совсем не успела сегодня почитать, поэтому..."
    show natsuki zorder 2 at t31
    show monika 2a zorder 3 at f32
    m "Ну конечно, в этом ничего такого."
    hide natsuki
    hide monika
    hide yuri
    with wipeleft
    "Все стали собираться."
    "Я последовал к двери вслед за Моникой и Юри, которые болтали друг с дружкой."
    play music t6 fadeout 1
    show natsuki 4g zorder 2 at t11
    n "Эм, ну и куда ты собрался?"
    mc "Э...?"
    n 4c "Нам же ещё надо уточнить наши планы на выходные."
    n "Ты бы сейчас просто пришёл бы домой и понял, что никак со мной не свяжешься."
    mc "Ой, точно ведь..."
    mc "И как это вылетело у меня из головы."
    n 2c "Блин, хорошо хоть я тебя остановила."
    n "Я тебе свой номер дам, ладно?"
    n 2q "И не вздумай выкинуть что-нибудь странное!"
    mc "С чего бы мне...?"
    n 1s "Хм..."
    "Нацуки дала мне свой номер телефона."
    n 1c "Ладно..."
    n "Я приду в воскресенье."
    n "И принесу с собой все необходимые ингредиенты."
    mc "Погоди!"
    mc "Ты придёшь ко {i}мне{/i} домой?"
    n 2c "Да, верно."
    n "А что не так-то?"
    mc "Ну как бы..."
    mc "Я просто подумал, что раз уж я тебе помогаю, то это я должен к тебе прийти..."
    n "Ага, щас."
    n 5x "Так уж мне разрешат пустить домой парня..."
    n "Папа меня убьёт."
    mc "Правда?"
    mc "Жестковато как-то, как по мне."
    n 5r "Ну да, а мне каково?"
    n "Мне дома вообще ничего нельзя, когда там отец..."
    n 2q "Ладно, проехали... мне надо было немного поворчать."
    n 2c "Значит, номерами мы обменялись."
    n "На данный момент мне от тебя больше ничего не нужно."
    n "Если что-то потребуется, я тебе напишу."
    mc "Хорошо, договорились."
    n "Ага."
    n 4a "Вот уж я тебе покажу, за что я так люблю выпечку."
    n "Так что жди с нетерпением."
    mc "О?"
    mc "Разве ты не сказала, что дашь мне грязную работу?"
    n 1r "Ну...!"
    n "Ну я это... так сказала."
    n 1q "Просто я бы не стала... при других говорить..."
    n "Что так этого сильно жду."
    mc "Что, серьёзно?"
    n 5w "Ну, немного!"
    n "Просто потому, что... раньше мне ни с кем другим печь не доводилось."
    n 5h "Это вся причина, вот..."
    mc "Ладно, я понял."
    mc "Прости за бурную реакцию."
    mc "Тогда я пошёл."
    mc "Увидимся в воскресенье."
    n 5m "А..."
    n "..."
    n 5u "...Да, не важно."
    return

label ch3_end_yuri:
    $ ch4_scene = "yuri"
    mc "Ну, наверное, я буду более полезен, помогая Юри..."
    show yuri zorder 3 at f33
    y 2n "М-мне...?"
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 4e "Ты серьёзно?"
    n "И с чего бы..."
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 1i "Нацуки."
    m "Я уже почувствовала, что ты хочешь что-то грубое сказать."
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 5r "Н-нет..."
    n "Просто говорю, что..."
    n "Агрх..."
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 2a "Значит, ты будешь помогать Юри, да, [player]?"
    show monika zorder 2 at t32
    mc "Да."
    mc "Этим и займусь."
    show yuri zorder 3 at f33
    y 1u "Я рада."
    y "У меня дурная привычка -- накручивать себя в таких вещах..."
    y "Поэтому, я думаю, твоя помощь будет очень кстати."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m "Так приятно это слышать."
    m "Нацуки, ты справишься сама с приготовлением выпечки?"
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 3w "Ну как бы да."
    n "Я уже сказала, что сама справлюсь."
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 1i "Хорошо, хорошо..."
    "Всем было ясно, что Нацуки сейчас немного досадно."
    show monika zorder 2 at t32
    mc "Значит... это всё, что мы должны были обсудить?"
    show monika zorder 3 at f32
    m 1a "Да, это, вроде как, всё."
    m 2a "Ну что, вы, ребята, в предвкушении?"
    show monika zorder 2 at t32
    show yuri zorder 3 at f33
    y 1i "Ну, здесь не совсем подходит 'в предвкушении'..."
    y "Скорее, я думаю, я буду этого ждать."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m "А как твои ощущения, [player]?"
    show monika zorder 2 at t32
    mc "Мои?"
    mc "Эм, я думаю, мне интересно, чем вся эта история обернётся..."
    show monika zorder 3 at f32
    m 2b "Понятно!"
    m 2a "А что насчёт тебя, Нацуки?"
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 5s "..."
    show monika zorder 2 at t32
    show yuri zorder 3 at f33
    y 2h "Нацуки!"
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 1o "Чего??"
    n 1m "Чё все на меня орут?"
    n "Я же ничего не сделала...!"
    show natsuki 1n zorder 2 at t31
    show yuri zorder 3 at f33
    y 3n "Н-нет..!"
    y "Я совсем не это имела в виду!"
    y 3o "Аа..."
    "Юри оторопело оглядывает всех в классной комнате."
    y 2w "Мне очень жаль!"
    y 2v "Я правда не знаю, почему [player] выбрал именно меня..."
    y "И к тому же..."
    y 2t "Твои кексы -- самые лучшие из тех, что я когда-либо видела!"
    y "С чаем они сочетаются просто идеально!"
    y "И что бы я не готовила для мероприятия, с ними не сравнится, поэтому..."
    y 4b "Поэтому..."
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 3q "Да, поняла, я, поняла."
    n 3h "Хотя и немного удивлена..."
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f33
    y "П-почему?"
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 3q "Эм..."
    n "Ну это я тут себя по-детски веду..."
    n "Это я уже знаю."
    n 5h "Но ты вдруг начинаешь меня всячески подбадривать..."
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f33
    y "Я-я знаю, что у меня не очень это получается..."
    y 2v "Ты прости, если я что-то не так сказала!"
    "Не одна Нацуки была удивлена."
    "Моника и я тоже были шокированы словами Юри."
    "При её-то коммуникативных проблемах пытаться кого-то подбодрить, наверно, выходит далеко за рамки зоны комфорта."
    "Но я начал понимать."
    "Юри пытается вести себя как Сайори."
    "Пусть это и не было идеально, но она пыталась сказать то, что Сайори сказала бы в такой момент."
    "Сайори ведь всегда помогает окружающим улыбнуться и почувствовать себя лучше."
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 1h "Нет..."
    n "Мне даже немного приятно."
    n 1u "Прости, что... сделала из мухи слона."
    n 1m "Но вот что я тебе скажу."
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f33
    y 2e "...?"
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 4e "Будь уверена -- мои кексы будут самой лучшей частью мероприятия!"
    show natsuki 4a zorder 2 at t31
    show yuri zorder 3 at f33
    y 2f "А..."
    y 1s "...Охотно верю."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m 2b "Ура!"
    m "Надеюсь, у всех всё получится."
    m "Ну, а на этом..."
    m "На сегодня у нас -- всё."
    m "Поэтому, я думаю, нам пора расходиться."
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n "Ладно, погнали отсюда."
    hide monika
    hide natsuki
    hide yuri
    with wipeleft
    "Все стали собираться."
    "Я последовал к двери вслед за Моникой и Нацуки, которые болтали друг с дружкой."
    play music t6 fadeout 1
    show yuri 2t zorder 2 at t11
    y "Эм!.."
    mc "А?"
    "Я повернулся."
    y "Прости..."
    y 2s "Я поняла, что у нас нет способа связаться на этих выходных..."
    mc "Ой, ты права."
    mc "Не могу поверить, что это вылетело у меня из головы."
    mc "Может, мне дать тебе свой номер телефона?"
    y 1a "Я думаю... да, это будет идеально."
    mc "Отлично, тогда..."
    "Мы с Юри обменялись номерами телефона."
    y "Хорошо."
    y "Тогда я подойду к тебе домой в воскресенье..."
    mc "А?"
    mc "Ко мне домой?"
    y 2t "А-а что, что-то не так...?"
    mc "Нет, конечно..."
    mc "Я просто подумал, что это мне нужно дойди до тебя, раз уж я тебе помогаю."
    y "А, думаю в этом есть смысл..."
    y "Но, если ты не против..."
    y 1u "Я думаю, что предпочла бы прийти к тебе домой."
    mc "Ну, ладно."
    mc "Раз так, то никаких проблем."
    "Я решил не давить на Юри с расспросами."
    "Мне не то чтобы вообще это важно, просто нужно убедиться, что в моей комнате чисто."
    mc "Надеюсь, что смогу хоть как-то пригодиться..."
    mc "Я ведь и близко не такой творческий человек, как ты."
    y 1a "Не стоит недооценивать себя, [player]."
    y "Я думаю, из нас получится очень продуктивная команда."
    y 1u "Даже если ты выбрал меня из жалости или что-то в этом роде..."
    mc "Постой...!"
    mc "Ты же всерьёз так не думаешь?"
    y 4b "..."
    y "Я... не знаю."
    y "Тяжело придумать ещё причину, почему ты выбрал меня..."
    mc "Ты забываешь о самом важном!"
    mc "Я выбрал помочь тебе, потому что я сам этого хотел."
    y 2v "Н-но..."
    "Юри задумалась с крайне сосредоточенным выражением лица."
    mc "Юри... ты надумываешь."
    mc "Ты же хотела, чтобы я указывал тебе, когда ты начинаешь слишком загоняться, так?"
    y "Э...?"
    y 4 "Я... я и не понимала..."
    mc "Я же говорю, я просто хочу."
    mc "Это и есть причина."
    mc "Ты же мне веришь?"
    y 1t "Я..."
    "Юри снова крепко задумалась."
    "Она долго смотрела мне прямо в глаза."
    y 3l "...Я тебе верю!"
    "Будто бы это стоило ей неимоверных усилий, Юри, наконец, сказала это, и выражение её лица стало спокойнее."
    y 3s "И я буду очень ждать этого воскресенья."
    mc "Ага..."
    mc "Я тоже."
    show yuri zorder 1 at thide
    hide yuri
    "После этого я вышел из класса, Юри проследовала следом."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
