label sayori_exclusive_1:
    scene bg club_day
    with wipeleft_scene
    if not renpy.music.get_playing(channel='music') == audio.t2:
        play music t2 fadeout 1
    "Блин..."
    "Кажется, сегодня никто не хочет, чтобы его отвлекали."
    "Я плюхнулся на ближайшую парту."
    "Как я должен занять себя чем-то, связанным с литературой в такой ситуации?"
    "Думаю, я всегда могу полистать ту книгу, что дала мне Юри..."
    "...Но я чувствую себя слишком уставшим, чтобы читать."
    "Кажется, я мог бы заснуть прямо сейчас."
    "Я закрыл глаза и невольно стал слушать разговор Сайори с Моникой."
    show sayori 1g zorder 2 at t21
    s "Мы наверняка будем выглядеть очень отстойно на фоне всех остальных клубов, но это неважно..."
    show monika 2r zorder 3 at f22
    m "Хм..."
    m 2b "Ну, мы не можем сдаться."
    m "Фестиваль — это наш шанс показать всем, что такое литература!"
    m 2d "Проблема в том, что идея литературного клуба звучит слишком мудреной и интеллектуальной..."
    m "Но ты ведь знаешь, что это совершенно не так?"
    m 2a "Нам просто нужно найти способ показать это всем..."
    m "Что-то, что будет говорить с их творческим мышлением."
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 1i "Ммммммммммм....."
    s "Но это всё равно не решает проблему!"
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 2d "Э-э? Что ты имеешь в виду?"
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 1c "Даже если мы придумаем что-то очень веселое..."
    s "Никто изначально не придет, если это будет литературным мероприятием."
    s "Поэтому куда важней понять, как заставить людей заглянуть к нам вообще, понимаешь?"
    s 1a "И после того как все придут, мы уже сможем сделать что-то, что поможет говорить с их творческим мышлением."
    "...Как это понимать?"
    "Сайори относится к этому очень серьёзно."
    "Редко услышишь, как она вот так рассуждает."
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 2a "Хм, это хорошая мысль..."
    m "В таком случае, думаешь, еда сработает как нужно?"
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 1n "К-какая еда?!"
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 2b "Ах... Ну, думаю, мы могли бы--"
    show monika zorder 2 at t22
    show sayori 4r zorder 3 at f21
    s "Кексики!"
    show sayori zorder 2 at t21
    show monika 1k zorder 3 at f22
    m "Ахаха. Хорошая идея."
    m 1a "Нацуки с радостью бы этим занялась."
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 4x "Ах! Ты права!"
    s "Нацуки делает лучшие кексики!"
    s "Они сработают идеально~"
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 1d "Ты не только из-за этого предложила их...?"
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 4q "Кексики говорят с моим творческим животиком~"
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 1l "..."
    m "Тогда пусть будут кексики."
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 1g "Я проголодалась..."
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 1a "В любом случае, нам нужно ещё поработать над деталями самого мероприятия..."
    scene black
    with close_eyes
    "Я поймал себя на улыбке."
    "В конце концов, Сайори остается самой собой."
    "Но в этом и заключается неожиданная причина, по которой я восхищаюсь ей."
    "В отличие от меня, всегда испытывающего сложности в нахождении какой-либо мотивации..."
    "Сайори может собрать свою волю в кулак ради определенной цели и воплотить её в жизнь."
    "Думаю, поэтому я, в конечном счёте, позволяю ей иногда заботиться обо мне."
    "Я не могу не задуматься, каково это -- увидеть мир ее глазами..."
    scene bg club_day
    show sayori 1b at face
    with open_eyes
    mc "Ва-а--!"
    "Я открыл глаза и обнаружил что лицо Сайори закрывает весь мой обзор."
    "Я чуть не упал со стула."
    show sayori zorder 2 at t11
    s 4q "Эхехе, извини~"
    s 4i "Стоп!"
    s 1j "На самом деле совсем не извини!"
    s "Это ты виноват, что заснул тут!"
    s "Это не клуб любителей поспать!"
    mc "В нашей школе есть клуб любителей поспать...?"
    s 1h "Ты опять поздно лёг спать, да?"
    s "Теперь, когда ты в клубе, у тебя будет меньше времени на аниме, знаешь ли!"
    s "Тебе нужно привыкнуть к этому!"
    mc "Не говори об этом так громко...!"
    "Я посмотрел через плечо, чтобы убедиться, что Моника не услышала."
    s 1g "Но это правда..."
    mc "Да..."
    mc "Я знаю, знаю."
    mc "Ты всегда присматриваешь за мной, Сайори."
    s 4q "Эхехе~"
    s "Это то, что у меня лучше всего получается!"
    mc "...В этом и проблема!"
    mc "А что насчёт тебя?"
    mc "Ты приглядываешь за мной лучше, чем за собой."
    mc "Ты всё ещё поздно встаешь каждый день, не так ли?"
    s 1l "Э-э?"
    s "Н-не каждый день!"
    mc "Это не очень убедительно..."
    mc "Сколько раз на прошлой неделе ты просыпалась вовремя?"
    s 1m "Это..."
    s 1o "...Это секрет!"
    mc "Я так и знал..."
    s 5a "Нуууу же!"
    s "Хотя бы поверь мне на слово..."
    mc "Я не могу сделать даже этого."
    mc "Посмотри, Сайори, это же прямо на тебе написано."
    s 1b "Э-э...?"
    "Сайори осматривает себя."
    s "Как это написано на мне?"
    mc "Ты явно торопилась этим утром..."
    mc "Смотри, у тебя тут все волосы торчат."
    show sayori at h11
    s 1e "Ах--"
    "Я провёл пальцами по волосам Сайори, пытаясь выпрямить их."
    mc "Блин, тут серьёзно нужна расческа..."
    s 1y "Мои волосы просто трудно уложить..."
    mc "Я на это не поведусь."
    mc "Дело не только в твоих волосах."
    mc "Смотри, ещё бантик сидит неровно."
    mc "И след от зубной пасты на воротнике, вот здесь."
    "Я попытался стереть след своим пальцем."
    show sayori at s11
    s "Н-но никто никогда бы не заметил этого..."
    mc "Конечно заметили бы."
    mc "Никто и не сказал бы тебе об этом, потому что не захотел бы смущать тебя."
    mc "К счастью, меня это совсем не волнует."
    s 5c "Эй, ты злюка..."
    mc "И ты даже не застёгиваешь свой пиджак."
    mc "Серьёзно, Сайори..."
    mc "Думаешь, почему у тебя до сих пор нет парня?"
    show sayori 1h zorder 2 at t11
    s "Э-э??"
    s "Это {i}супер{/i} грубо!"
    mc "Извини, но потом ты сама отблагодаришь меня..."
    "Я начал застегивать её пиджак с нижних пуговиц."
    mc "Как только ты увидишь, насколько лучше так будет выглядеть, то сразу передумаешь."
    $ persistent.clear[6] = True
    scene s_cg1
    with dissolve_cg
    s "Эхехе~"
    s "Это так забавно."
    mc "Что именно?"
    s "Ну..."
    s "Я просто подумала, как это странно — иметь друга, который делает такие вещи."
    mc "Э?"
    mc "Н-не говори такое!"
    mc "Из-за тебя {i}я{/i} начинаю чувствовать себя странно, глупая..."
    s "Но всё в порядке."
    s "Я рада, что мы с тобой такие."
    s "А ты?"
    mc "Ах--"
    mc "Н-наверное..."
    s "Эй, осторожнее..."
    s "Пуговица может оторваться!"
    mc "Почему эту так сложно застегнуть...?"
    "Я попытался полностью застегнуть пуговицу возле её груди."
    mc "Эта вещица вообще подходит тебе по размеру?"
    s "Эхехе~"
    s "Подходила раньше, когда я только её купила."
    mc "Эх......"
    mc "Если бы ты хоть иногда застёгивала пиджак, ты бы заметила раньше, что он тебе больше не подходит."
    mc "Почему ты улыбаешься?"
    s "Это значит, что моя грудь снова выросла!"
    mc "Н-не говори об этом так громко!"
    s "Эхехе~"
    mc "В любом случае..."
    mc "Теперь ты выглядишь намного лучше, поэтому..."
    mc "Ах..."
    "...Почему так странно видеть, что пиджак Сайори полностью застёгнут?"
    s "Но он такой тесный..."
    s "У-у..."
    s "Оно того совсем не стоит!"
    "Сайори спешно расстёгивает свой пиджак."
    scene bg club_day
    show sayori 1q zorder 2 at i11
    with dissolve_cg
    s "Фуф!"
    s "Так намного лучше~"
    "Сайори расставила руки в стороны и покружилась."
    s 1a "Значит, если я буду держать его расстегнутым, то у меня не будет парня, верно?"
    mc "Что это за логика такая?"
    mc "И почему ты говоришь это так, будто это что-то хорошее?"
    s "Потому что..."
    s 4h "...Если бы у меня был парень, то тогда он не дал бы тебе делать такие вещи!"
    s 4y "И ты заботишься обо мне лучше, чем кто-либо ещё, в любом случае..."
    s "Поэтому я оставлю его расстёгнутым!"
    mc "Прекрати говорить все эти смущающие вещи!"
    s 1b "Э?"
    s "Я не сказала ничего смущающего..."
    mc "Блин..."
    mc "Ну, в любом случае, просто сосредоточься на попытках встать чуть пораньше..."
    s 1j "Только если ты сосредоточишься на попытках лечь раньше!"
    mc "Ладно, ладно..."
    mc "Договорились."
    s 4q "Эхехе~"
    s 4x "Я думаю, что мы и правда лучше заботимся друг о друге, чем о самих себе."
    mc "Да, думаю, это и правда так, хех..."
    s 4y "Так, может, тебе следует приходить и будить меня по утрам!"
    mc "Опять ты за своё, Сайори..."
    s 1h "Оу, но в тот раз я пошутила!"
    mc "Блин, с тобой иногда невозможно сказать наверняка."
    show monika 3b behind sayori at l31
    m "Итак, всем внимание!"
    mc "Э-э?"
    "Моника внезапно позвала всех."
    m "Почему бы теперь нам не поделиться поэмами, которые мы написали?"
    show sayori 4r at h11
    s "Ура~!"
    s 4x "[player], не могу дождаться, когда смогу прочитать твою!"
    mc "Да, я тоже..."
    "Я не смог сказать это восторженно, но Сайори всё равно умчалась за своей поэмой."
    show sayori behind monika at thide
    return

label sayori_exclusive_2:
    if not renpy.music.get_playing(channel='music') == audio.t2:
        stop music fadeout 1.0
    scene bg club_day
    with wipeleft_scene
    if not renpy.music.get_playing(channel='music') == audio.t2:
        play music t2
    s "[player], [player]!"
    "Сайори внезапно подошла ко мне."
    show sayori 1x zorder 2 at t11
    s "Я собираюсь принести кое-какие вещи из другого класса."
    s "Хочешь пойти со мной?"
    mc "Вещи?"
    mc "Для чего?"
    s 2a "Ну, ты же знаешь, что приближается фестиваль?"
    s "Мы с Моникой собираемся сделать несколько постеров и всё в этом духе."
    s "Так что мне нужно найти какие-нибудь карандаши, маркеры и клей..."
    mc "А, я понял."
    mc "Конечно, я пойду с тобой."
    s 4q "Ура-а~"
    s 4x "Хорошо, Моника, мы скоро вернемся!"
    show sayori zorder 2 at t22
    show monika 1a zorder 3 at f21
    m "Ах, [player] пойдёт с тобой, чтобы принести всё необходимое?"
    m "Необязательно утруждать себя."
    m "Я бы с радостью пошла с ним."
    show monika zorder 2 at t21
    show sayori 1h at s22
    s "Оу, но я хочу пойти!"
    s "Это так весело, исследовать пустующие классы и всё такое!"
    show monika zorder 3 at f21
    m 2j "Хехе, хорошо, хорошо."
    m 2a "Я просто предложила."
    m "Посмотри, если сможешь найти бумагу для плакатов, хорошо?"
    show monika zorder 2 at t21
    show sayori zorder 3 at f22
    s 1r "Хорошо~!"
    s 1a "Готов, [player]?"
    mc "Да, вперёд."
    scene bg corridor
    show sayori 4a zorder 2 at t11
    with wipeleft_scene
    "Мы с Сайори вышли из клубной комнаты."
    "Я следовал за Сайори, которая скакала по коридору и насвистывала что-то себе под нос."
    "Честно говоря..."
    "Такое чувство, будто я иду с ребёнком в торговом центре или вроде того."
    "Иногда Сайори находит повод для радости в простейших вещах."
    mc "Эй, Сайори..."
    mc "И всё же, что именно мы собираемся делать для фестиваля?"
    mc "Я не представляю, как можно сделать мероприятие на основе литературы..."
    s 1q "Эхехе!"
    s 1x "Мы с Моникой уже всё спланировали!"
    s "Не волнуйся~"
    mc "Вот как...?"
    s "Да!"
    s "Мы сделаем поэтическое представление!"
    mc "Представление...?"
    mc "Как оно будет проходить?"
    s 1c "Ну..."
    s "Все по очереди будут выходить на сцену..."
    s 1x "И зачитают свои любимые поэмы!"
    mc "Ах..."
    mc "Это звучит..."
    "...Немного скучно?"
    s 1h "[player]!"
    s "Ты думаешь об этом совершенно неправильно!"
    s "Дело не просто в чтении поэм..."
    s 1x "А в их представлении!"
    s "Типа, ты говоришь строки поэмы, как..."
    s 2j "{i}Меж ног моих...{/i}"
    s "{i}Меня манил единственный оставшийся цветок.{/i}"
    s 1c "{i}Скрутила стебель я, освобождая его от надоедливых корней...{/i}"
    s "{i}Ласкаясь в последних, радостных моментах, проходящих меж моих пальцев.{/i}"
    s 3g "{i}Но чем закончится это кроткое веселье, призванное мной?{/i}"
    s "{i}В момент я оглядела всё вокруг, со всех сторон...{/i}"
    s 1j "{i}Цветущее когда-то поле предо мной...{/i}"
    show sayori at h11
    s 4m "{i}Теперь ничто, а лишь бесплодная пустошь!{/i}"
    s "..."
    s 1r "Вот так!!"
    mc "Сайори..."
    "Как бы это сказать..."
    mc "Уверен, что дело во мне, но я не могу воспринимать тебя всерьёз, когда ты так говоришь..."
    show sayori 5c at s11
    s "Э-э?"
    s "Ты злюка!"
    s "Я работала над этим суперусердно, знаешь ли!"
    mc "Ах, я знаю, знаю!"
    mc "Я просто хочу сказать, что это довольно необычный контраст с твоей умильной личностью."
    show sayori 4s zorder 2 at t11
    s "Ахаха! Не говори такие вещи, это смущает!"
    s 4y "Но, думаю, это значит, что я хорошо справляюсь~"
    mc "Да, думаю, что так и есть..."
    show sayori at h11
    s 4r "Ааах, я так взволнована!"
    s "Фестиваль будет таким весёлым~"
    "Сайори вновь кружится на пути по коридору."
    s 1x "Эй, [player], класс вон там пустует!"
    s "Давай начнем нашу миссию!"
    show sayori zorder 1 at thide
    hide sayori
    mc "Миссию, э-э...?"
    "Прошло много времени с тех пор, как я вот так проводил время вместе с Сайори."
    "Но в конце концов, она совсем не изменилась."
    "Она вся как яркий шарик света, притягивающий счастливые флюиды из окружающего мира..."
    "Для меня это довольно ностальгическое чувство."
    "С течением лет я всё больше и больше закрывался в своей комнате."
    "Так что такие приключения с Сайори возвращают мне то особое чувство, о котором я уже забыл."
    scene bg class_day
    with wipeleft_scene
    "Мы вдвоем вошли в классную комнату."
    "Сайори направилась прямо к шкафу, а я последовал за ней."
    show sayori 1b zorder 2 at t11
    s "Давай посмотрим, что у нас здесь..."
    s 4x "...Карандаши!!"
    "Сайори достала коробочку, полную карандашей, с полки."
    s "К тому же лучшей марки!"
    s 1b "Хотя они немного грязные..."
    "Сайори начала доставать разные карандаши из коробки, читая названия цветов."
    mc "Хорошо, с этим разобрались."
    mc "Не отвлекайся, нам всё ещё нужно найти--"
    s 1a "Подожди, я ищу свой любимый цвет..."
    mc "Хорошо, хорошо..."
    mc "Тогда хотя бы подвинься, чтобы я мог поискать бумагу для плакатов."
    s 1b "Ах, я случайно уронила один--"
    play sound "sfx/smack.ogg"
    show white zorder 4:
        alpha 0.6
        linear 0.25 alpha 0.0
    show sayori 2p at h11
    "{i}Бам!{/i}"
    hide white
    s "Ай--!"
    "Сайори наклонилась и ударилась своим лбом прямо о шкаф."
    "Она упала на пол, и карандаши раскатились вокруг неё."
    show sayori 4p at s11
    s "Ойойойойой..."
    mc "Ты в порядке?"
    s "Мой лобик..."
    "Сайори схватилась за свой лоб."
    mc "Блин, Сайори..."
    mc "Ты как всегда, да?"
    mc "Ну же, дай мне взглянуть."
    "Так как Сайори сидит на полу, то я взял её за талию и вытащил из шкафа."
    mc "Ты должна убрать свои руки, Сайори..."
    s 4g "Но ведь больно..."
    mc "Просто на секундочку."
    $ persistent.clear[7] = True
    scene s_cg2_base1
    show s_cg2_exp2
    with dissolve_cg
    "Сайори медленно опустила руки со своего лба."
    "Я осторожно убрал её чёлку в сторону."
    show s_cg2_exp1 at cgfade
    show s_cg2_exp3 at cgfade
    s "Ай--!"
    mc "Извини..."
    "В центре её лба красовалась огромная красная отметка."
    "И шишка уже начала появляться."
    mc "Блин, опухнет же."
    mc "Надо бы найти немного льда..."
    hide s_cg2_exp3
    hide s_cg2_exp1
    s "[player]..."
    mc "Где я вообще найду здесь лёд в такое время...?"
    mc "Ах, думаю, холодный напиток подойдет..."
    s "Тебе необязательно--!"
    show s_cg2_exp2 at cgfade
    hide s_cg2_exp2
    s "Я не против того, чтобы--выглядеть как единорог--"
    "Даже морщась от боли, Сайори всё равно глупо шутит."
    mc "Ахаха, что ты такое говоришь?"
    mc "Я скоро вернусь, хорошо?"
    s "Х-хорошо..."
    stop music fadeout 1.0
    scene bg corridor with wipeleft_scene
    "Я похлопал Сайори по плечу и выбежал в коридор."
    "Я нашёл ближайший торговый автомат."
    mc "Что мне выбрать...?"
    "Это не так уж важно, раз он будет использован как пакет со льдом, а не как напиток."
    "Но я знаю, что Сайори любит яблочный сок, так что я куплю его."
    "Спустя мгновенье я уже возвращался в класс, в котором я оставил Сайори."
    scene s_cg2_base1
    show s_cg2_exp2
    with wipeleft_scene
    play music t9
    "Одной рукой она держалась за свой лоб, а другой неуклюже складывала карандаши назад в коробку."
    s "По крайней мере, они уже были не на своих местах, до того, как я рассыпала их..."
    mc "Сайори, вот."
    show s_cg2_base2 behind s_cg2_exp2 at cgfade
    "Я передал Сайори бутылку яблочного сока."
    show s_cg2_exp2 at cgfade
    hide s_cg2_exp2
    s "Какая приятная и прохладная..."
    "Сайори открыла бутылку и начала пить."
    mc "Сайори, что ты делаешь?!"
    mc "Это для твоего лба, глупая!"
    show s_cg2_exp3 at cgfade
    s "Ах--"
    s "Извини, я забыла~"
    s "Ахаха!"
    mc "Насколько же сильно ты ударилась головой...?"
    "Сайори прижала бутылку к шишке на своей голове."
    show s_cg2_exp1 at cgfade
    s "Щиплет..."
    mc "Просто потерпи, скоро станет лучше."
    mc "Похоже, ты убрала большинство карандашей, это хорошо."
    hide s_cg2_exp1
    hide s_cg2_exp3
    s "Эй, [player]..."
    s "Это, вроде как, напоминает о том, что мы выросли, правда...?"
    mc "Э-э? Что ты имеешь в виду?"
    s "Знаешь, раньше мы всё время играли на улице..."
    s "Я всегда старалась быть рядом с тобой."
    s "Ты был немного безразличный ко всему..."
    s "Я часто отставала, или мне было сложно добраться туда, куда ты смог..."
    s "Но иногда, когда я пыталась сделать что-то, что не могла, я могла пораниться."
    s "Я могла упасть и поцарапаться, или получить шишку..."
    s "И начала бы очень сильно плакать."
    show s_cg2_exp3 at cgfade
    s "Ахаха!"
    s "И ты бы спешил ко мне так быстро, как только мог."
    hide s_cg2_exp3
    s "Ты очень старался сделать что-нибудь, чтобы я перестала плакать."
    s "Это было почти как, если бы ты винил себя и боялся попасть в неприятности, если бы кто-нибудь узнал..."
    s "Даже если это была совсем не твоя вина, знаешь?"
    mc "Я правда делал такое...?"
    s "Да... ты не помнишь?"
    mc "Если подумать, то, кажется, я помню немного..."
    mc "Похоже, я всегда был так сосредоточен на играх, что не уделял тебе достаточно внимания."
    mc "Так что в каком-то смысле это была моя вина."
    mc "Вроде как, и в этот раз тоже..."
    mc "Если бы я не подгонял тебя выйти из шкафа, ты, скорее всего, не ударилась бы головой."
    s "[player]..."
    s "Я не уверена, что ты осознаешь это, но ты всегда думаешь о других."
    s "Даже через столько лет..."
    s "Ты поспешил помочь мне, даже если это я была неуклюжей."
    show s_cg2_exp3 at cgfade
    s "Ты и правда душка..."
    mc "Н-не называй меня так!"
    mc "И я не то чтобы постоянно делаю такие вещи..."
    mc "Наверное, когда речь заходит о тебе, то для меня это естественно."
    mc "Я даже не понял, как начал относиться к тебе так."
    mc "Думаю, это то, что происходит, когда дружишь с кем-то так долго."
    hide s_cg2_exp3
    s "Правда...?"
    s "Возможно, ты прав..."
    s "[player]..."
    s "Я так рада, что между нами ничего не изменилось."
    s "Думаешь, так будет всегда?"
    mc "Всегда...?"
    "Если быть честным..."
    "Никто пока не знает, в каком колледже каждый из нас окажется, или даже после этого."
    "Так что будет нечестно, если я что-то пообещаю."
    "Но..."
    mc "Ну, я надеюсь."
    mc "Прошло уже столько времени, верно?"
    mc "Я не могу представить, что ты когда-нибудь изменишься, так что, надеюсь, так и будет."
    s "Я так счастлива..."
    "Глаза Сайори причудливо заблестели."
    "Мы замолчали на секунду."
    "Она такая глупенькая и неуклюжая снаружи, что, когда я вижу её в такой задумчивости..."
    "Я не хочу её тревожить."
    s "Думаю, нам стоит возвращаться..."
    s "Я не хочу заставлять Монику волноваться."
    mc "Удачи с этим."
    mc "Она в любом случае увидит твой лоб."
    s "Нет, если я спрячу его под своей чёлкой~"
    play music t8 fadeout 1.0
    scene bg class_day
    show sayori 1a zorder 2 at i11
    with dissolve_cg
    "Сайори вскочила на ноги."
    show sayori 4p at s11
    s "А-Ааай--!"
    "Она опять схватилась за свой лоб."
    mc "Не вставай резко после такого ушиба!"
    s "У-у..."
    mc "Ну, думаю, теперь уже слишком поздно..."
    mc "В любом случае, пойдём."
    scene bg corridor
    with wipeleft_scene
    "Я последовал за Сайори к выходу из класса."
    "Сайори копошилась со своей чёлкой, пытаясь скрыть шишку, но без особого успеха."
    "Через момент мы вернулись в клубную комнату."
    scene bg club_day
    show sayori 1a zorder 2 at t21
    show monika 1b zorder 2 at t22
    with wipeleft_scene
    show monika zorder 3 at f22
    m "Ах, вы вернулись!"
    m "Вы вовремя, я как раз собиралась начать обмен нашими поэмами."
    m 1d "Э-э? Сайори, твой лоб..."
    show monika zorder 2 at t22
    mc "Она в порядке, не волнуйся об--"
    show sayori 4r zorder 3 at f21
    s "Я игралась с карандашами и ударилась лбом о шкаф!"
    show sayori zorder 2 at t21
    mc "..."
    show monika 3m zorder 3 at f22
    m "..."
    m 3l "...Ну, в любом случае!"
    m 1a "Вы смогли найти всё, что нам было нужно?"
    show monika zorder 2 at t22
    show sayori 1x zorder 3 at f21
    s "Ага! У меня всё прямо--"
    s 1n "...Э-э?"
    "Сайори суматошно огляделась."
    show sayori 4m zorder 3 at hf21
    s "Я... забыла все вещи!!"
    show sayori zorder 2 at t21
    mc "Успокойся, Сайори."
    mc "У меня всё прямо здесь."
    mc "Ещё я нашёл бумагу для плакатов."
    show sayori 4b
    show monika 5a zorder 3 at f22
    m "Ахаха!"
    m "Звучит так, будто в конце концов ты сделал всю работу, [player]."
    show monika zorder 2 at t22
    mc "Ах, ну, Сайори--"
    "Я не смог придумать оправдание для Сайори."
    show sayori 1q zorder 3 at f21
    s "Я сделала это приключением!"
    show sayori 1a zorder 2 at t21
    mc "...Да, именно так."
    show monika 1j zorder 3 at f22
    m "Ахаха, ладно, ладно."
    m 1a "В любом случае, хорошая работа!"
    m "Я займусь постерами сегодня вечером."
    show monika zorder 2 at t22
    show sayori 4x zorder 3 at f21
    s "Я тоже!"
    show monika zorder 2 at t11
    show sayori behind monika at thide
    hide sayori
    m 4b "...Итак, всем внимание!"
    m "Вы готовы поделиться своими поэмами?"
    mc "Думаю, мне нужно взять свою..."
    "Убедившись, что коробка с карандашами крепко закрыта, я вернулся на своё место."
return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
