label natsuki_exclusive_1:
    scene bg club_day
    with wipeleft_scene
    n "Ух...!"
    "Из кладовки раздался раздражённый вздох Нацуки."
    "Судя по всему, она была чем-то недовольна."
    "Я подошёл к ней на случай, если ей нужна помощь."
    play music t6 fadeout 1
    scene bg closet
    show natsuki 4r zorder 2 at t11
    with wipeleft_scene
    mc "Ты что-то там ищешь?"
    n 4x "Грёбаная Моника..."
    n "Она никогда не возвращает мои вещи на место!"
    n "Какой смысл хранить свою коллекцию в правильном порядке, если кто-то всё равно его испортит?"
    "Нацуки продвинула по полке стопку книг и коробки."
    mc "Манга..."
    n 2c "Ты же читаешь мангу, да?"
    mc "Ну..."
    mc "Иногда..."
    "Манга — это одна из тем, интерес к которой обычно не признаёшь, пока не узнаешь о том, как к ней относится собеседник."
    mc "А ты откуда знаешь?"
    n 2k "Я слышала, как ты упоминал о ней в разговоре."
    n "К тому же этот факт у тебя прям на лице написан."
    "И как это понимать?.."
    mc "П-понятно..."
    "На краю одной из полок, среди кучи разных книг, стоял одинокий томик манги."
    "Мне стало любопытно, и я вытащил его оттуда."
    n 1b "{i}Вот он!{/i}"
    "Нацуки выхватила книгу из моих рук."
    "Затем она повернулась к коробке с мангой и сунула томик к остальным."
    n 4d "Уф-ф, так-то лучше!"
    n "Видеть собрание, в котором не хватает единственного тома, пожалуй, самая бесячая на свете штука."
    mc "Знакомое чувство..."
    "Я присмотрелся к собранию манги, которым так восхищалась Нацуки."
    mc "Parfait Girls?.."
    "Никогда не слышал об этой серии."
    "А это,скорее всего, значит, что либо я не вхожу в её целевую аудиторию, либо она просто отстой."
    n 5g "Если есть желание поосуждать, можешь делать это через стекло вон той двери."
    "Она указала на дверь в класс."
    mc "Э-эй, я ничего не осуждал!.."
    mc "Я же не сказал ни слова."
    n 5c "Тебя выдала интонация."
    n "Но вот что я тебе скажу, [player]."
    n 4l "Считай это уроком от Литературного клуба: \"Не суди книгу по обложке\"!"
    n "И вообще..."
    "Нацуки вытащила первый том \"Parfait Girls\" из коробки."
    n "Я покажу тебе, почему именно!"
    "Она впихнула книгу прямо мне в руки."
    mc "А..."
    "Я уставился на обложку."
    "На ней были изображены четыре девушки в красочных нарядах, застывшие в женственных позах."
    "Это... чересчур \"моэ\"."
    n 4b "Ну, и чего ты там стоишь?!"
    mc "У-а..."
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацуки схватила меня за руку и вывела из кладовки."
    "А затем села под окном, оперевшись на стену."
    "И похлопала по полу рядом с собой, приглашая меня сесть."
    show bg club_day
    show natsuki 2a zorder 2 at t11
    with wipeleft
    mc "Разве на стульях не будет удобнее?.."
    "Я занял своё место."
    n 2k "Стулья не годятся."
    n "Так у нас не получится читать одновременно."
    mc "Э? Почему это?"
    mc "А... Так, пожалуй, будет проще сидеть рядом..."
    n 2o "...!"
    n 5r "Н-ну ты чего!"
    n "От тебя это звучит как-то неприлично!"
    "Нацуки скрестила руки на груди и отодвинулась от меня на несколько сантиметров."
    mc "Извини..."
    show natsuki 5g
    "Я и сам не ожидал, что буду сидеть настолько близко к ней..."
    "Хотя не сказал бы, что считаю это чем-то плохим."
    "Я открыл книгу."
    "Через каких-то несколько секунд Нацуки снова придвинулась поближе ко мне в надежде, что я не замечу."
    "Я почувствовал её взгляд из-за своего плеча. Ей явно читать хотелось больше, чем мне."
    n 1k "Эх, как же давно я читала начало..."
    mc "Хм?"
    mc "Ты не пролистываешь время от времени предыдущие части?"
    n 2k "Да нет как-то."
    n "Разве что только когда полностью заканчиваю читать всю серию."
    n 2c "Эй, ты читаешь?"
    mc "Эм..."
    "Я читал, но ничего особенного в истории не происходило, поэтому мог заодно и разговаривать."
    "Похоже, это произведение о компании подруг-старшеклассниц."
    "Типичное дело для жанра \"повседневность\"."
    "Я уже вырос из подобного рода манги, потому как авторский стиль здесь редко бывал настолько интересным, чтобы компенсировать отсутствие сюжета."
    mc "Так..."
    mc "Чего мне стоит ожидать?"
    mc "Сюжет-то здесь будет?"
    n 4w "Очевидно же!"
    n "Ты что, думаешь, мне могло зайти что-то без сюжета?"
    n 4c "Ну это..."
    n 2c "Я, в общем, понимаю, о чём ты..."
    n 2k "Начало по большей части состоит из простых вещей..."
    n "Например, тут вот есть забавная глава, где они сходят с ума по парню из магазина мороженого..."
    n 2c "Но это лишь помогает тебе познакомиться с персонажами поближе!"
    n "Да и к тому же это всё равно забавно."
    n 2d "Но дальше будет достаточно разного рода драмы..."
    n "Например, когда мы дойдём до предысторий героинь, или когда начнёт развиваться романтическая ветка..."
    n "Вот что делает эту мангу такой хорошей."
    n 2a "В ней куча трогательных моментов."
    mc "Правда?"
    mc "Звучит так, будто ты действительно разбираешься в том, о чём говоришь."
    mc "Возможно, я недооценил тебя."
    n 2z "Хе-хе-хе..."
    n 1f "Эй, погоди!"
    n "И что {i}это{/i} должно значить?!"
    mc "У-а..."
    "Нацуки слегка пихнула меня."
    mc "Я лишь имел в виду, что ещё не успел увидеть, на что ты способна..."
    n 5s "Хм-хм. Выкрутился."
    mc "О... Эта глава, похоже, посвящена выпечке."
    mc "Это, конечно, только предположение, но в этой манге много времени уделено выпечке, да?"
    n 5b "Ну..."
    "Нацуки на мгновение замолкла, будто не хотела чего-то признавать.."
    n 2q "Да."
    n "А какая тебе разница?"
    mc "Да никакой, просто поинтересовался..."
    mc "Раз уж ты тоже увлекаешься выпечкой."
    n 1o "Это..."
    n "Всего лишь совпадение!"
    n 1t "Просто так вышло, что я заинтересовалась выпечкой примерно в то же время, когда мне в руки попала эта манга."
    n "Мда, будто я могла бы увлечься чем-то из-за манги."
    n 4y "Не завидую таким впечатлительным людям."
    n "Ха-ха-ха!"
    "Это точно не просто совпадение..."
    "Теперь понятно, откуда у Нацуки появился интерес к выпечке."
    "Надо сказать, что из всех хобби, которые можно было бы почерпнуть из манги, она выбрала одно из самых добротных."
    "Не говоря уже о том, что получается у неё здорово. Так что кто я такой, чтобы осуждать её?"
    $ persistent.clear[0] = True
    scene n_cg1_bg
    show n_cg1_base
    with dissolve_cg
    "..."
    "Мы провели за чтением несколько минут."
    "К этому моменту я уже закончил пару глав."
    mc "..."
    mc "...Уверена, что не скучаешь?"
    n "Уверена!"
    mc "Даже просто смотря, как я читаю?"
    n "Ну!.."
    n "Я... не против."
    mc "Как скажешь..."
    mc "Наверное, приятно делиться тем, что тебе нравится, с другими."
    mc "Меня всегда будоражит, когда удаётся убедить кого-то из своих друзей взяться за одно из моих любимых произведений."
    mc "Понимаешь, о чём я?"
    n "?.."
    mc "М?"
    mc "Нет?"
    show n_cg1_exp2 at cgfade
    n "Эм..."
    n "Не в этом..."
    n "Ну а мне-то откуда знать?"
    mc "В смысле?"
    mc "Ты разве не делишься своей мангой с друзьями?"
    hide n_cg1_exp2
    show n_cg1_exp3 at cgfade
    n "Не сыпь соль на рану, а?"
    n "Блин..."
    mc "Оу... Извини..."
    n "Хмпф."
    n "Как будто мои друзья станут это читать..."
    n "Они думают, что манга для детей."
    n "Стоит мне об этом заговорить, и они такие сразу..."
    n "'А? Ты ещё не выросла из этой фигни?'"
    n "Хочется дать им в морду после такого..."
    mc "Уф, знаю такой тип людей..."
    mc "Честно говоря, сложно найти друзей, которые не осуждали бы тебя за подобные увлечения, не говоря уже о таких, которые бы их разделяли..."
    mc "Я сам по себе слегка неудачник, так что, наверное, естественным образом притягиваю к себе других неудачников."
    mc "Но для людей вроде тебя всё, вероятно, намного сложнее..."
    hide n_cg1_exp3
    n "Хм."
    n "Да, верно подмечено."
    "{i}Стоп, а что именно???{/i}"
    n "Ну типа, я чувствую, что мне даже в собственной комнате её хранить нельзя..."
    n "Даже не знаю, что сделает батя, если найдёт это."
    n "В клубе она, по крайней мере, в безопасности."
    show n_cg1_exp3 at cgfade
    n "Разве что Моника слегка козлится по этому поводу..."
    n "Ар-р-р! Мне ваще реально добиться своего?"
    mc "Ну, в конце концов оно того стоило, не так ли?"
    mc "Ведь вот он я, сижу, читаю."
    n "Ага, типа это решает хоть одну из моих проблем."
    mc "Пускай так..."
    mc "Но ты по крайней мере получаешь удовольствие, верно?"
    hide n_cg1_exp3
    show n_cg1_exp2 at cgfade
    n "..."
    n "..."
    n "Ну и?.."
    mc "Ха-ха-ха."
    hide n_cg1_exp2
    show n_cg1_exp3 at cgfade
    n "Блин, хватит уже!"
    n "Ты будешь дальше читать, или как?"
    mc "Хорошо, хорошо..."
    "Я перевернул страницу."
    "Нацуки неожиданно засмеялась."
    hide n_cg1_exp3
    show n_cg1_exp1 at cgfade
    n "Ха-ха-ха-ха!"
    n "Я совсем забыла, что здесь происходит!"
    "Нацуки тыкнула пальцем в одну из панелей манги."
    n "Минори — мой любимый персонаж."
    n "Её всегда немного жалко из-за вечной невезучести."
    n "Но всё становится гораздо хуже, когда..."
    hide n_cg1_exp1
    n "У-у..."
    n "Рано ещё об этом говорить!"
    n "Заканчивай уже эту главу!"
    scene bg club_day
    with dissolve_cg
    "В голосе Нацуки слышались нотки волнения."
    "Полная противоположность её обычному властному тону."
    "Что можно понять, раз уж ей нечасто доводилось делиться своей любимой мангой с друзьями."
    "Чувство, которое вызывает подобная связь, сложно описать словами."
    "И осознание того факта, что я давал его Нацуки, для которой это большая редкость..."
    "Заставило меня украдкой улыбнуться."
    show monika 4b zorder 3 at f21
    m "Итак, мальчики и девочки!"
    mc "Э?"
    m "Все закончили свои сегодняшние стихотворения?"
    mc "..."
    show monika zorder 2 at t21
    show natsuki 4w zorder 3 at f22
    n "Ну ё-моё!"
    n "Ты могла появиться в ещё более неудачный момент?"
    show natsuki zorder 2 at t22
    show monika zorder 3 at f21
    m 5 "Извини-ите-е!"
    m "Мне лишь нужно было убедиться, что у нас достаточно времени."
    m "Хотя, конечно, вы там очень уютно устроились, как я погляжу. Ха-ха-ха!"
    show monika zorder 2 at t21
    show natsuki zorder 3 at f22
    n 4o "Чего?.."
    n 1p "А-ах!"
    "Нацуки вдруг заметила, как близко ко мне подобралась."
    "Она спешно отползла от меня на добрых полметра."
    show monika zorder 1 at thide
    show natsuki 1s zorder 2 at t11
    hide monika
    mc "Ну что ж..."
    mc "Пожалуй, пока остановимся здесь."
    "Я закрыл книгу и протянул её Нацуки."
    n 2m "Ты вот так просто отдашь её?.."
    n "Разве тебе не хочется узнать, что произойдёт дальше?"
    mc "А... Да, но..."
    mc "Моника же сказала..."
    n 2u "Не тупи."
    n "Забери её домой, да и всё."
    mc "Э?"
    mc "А точно можно?"
    "Я сказал это по большей части потому, что не особо планировал тратить своё свободное время на чтение вот этого..."
    n 4h "Конечно."
    n "Если ты не возьмешь её домой, то потом это растянется на целую вечность."
    n "Дочитай этот томик до завтра, чтобы мы могли взяться за следующий."
    n 4g "А если ты его помнёшь, я тебя убью."
    mc "До завтра?.."
    show natsuki zorder 1 at thide
    hide natsuki
    "Я пока ещё не добрался даже до середины тома."
    "Я отстану в просмотре сериалов, если попытаюсь дочитать это..."
    "Но, полагаю, это неизбежная плата за то, чтобы видеть энтузиазм на лице Нацуки."
    "Или же я просто боюсь того, что может произойти, если я {i}не закончу{/i} до завтра?.."
    mc "Тогда ладно!"
    "Я поднялся."
    "Вернулся к месту, где лежали мои вещи, и аккуратно опустил томик в свою сумку."
    return


label natsuki_exclusive_2:
    $ n_exclusivewatched = True
    play music t6 fadeout 1
    scene bg club_day
    show natsuki 4c zorder 2 at t11
    with wipeleft_scene
    n "..."
    "Нацуки не заставила себя долго ждать и подошла ко мне с крайне нетерпеливым видом."
    mc "Да, да."
    mc "Не переживай, я сдержал своё обещание."
label natsuki_exclusive_2_ch3:
    "Я вытащил первый том \"Parfait Girls\" из своей сумки."
    "Нацуки забрала его у меня и быстро покрутила в руках, предположительно проверяя, не помял ли я его."
    mc "Эй, я не настолько неосторожен..."
    mc "Не первый раз имею дело с мангой, знаешь ли."
    n 1m "Я просто хотела убедиться!"
    n 1c "Разве меня можно упрекнуть в паранойе?"
    n "Вообще-то я не каждый день даю свою мангу другим."
    mc "Верно..."
    mc "Да я тебя и не виню."
    n 2j "Ну да ладно, дай-ка я поставлю его на место."
    n "Заодно возьму следующий, окей?"
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацуки двинулась в сторону кладовки."
    "Я проследовал за ней."
    show bg closet
    show natsuki 2l zorder 2 at t11
    with wipeleft
    n "Ну что, расскажешь мне всё, что думаешь???"
    n 2k "Чем там заканчивается этот том? Я забыла."
    mc "А, глава закончилась тем, что Минори и Элис нашли..."
    show natsuki 1e at h11
    n "{i}Моника!!!{/i}"
    "Из кладовки раздался пронзительный крик."
    mc "А?.."
    "Я заглянул внутрь."
    "Все книги Нацуки были расставлены на верхней полке."
    n "Ты опять переставила мою мангу?!"
    show monika 3l at l31
    m "Ой, извини, извини!"
    m "Я получила от учителя нагоняй за то, что мы занимаем столько места в её кладовке..."
    m "Поэтому мне пришлось переставить кое-какие вещи и немного прибраться."
    m 3b "Там всё на месте, мне лишь нужно было слегка навести порядок!"
    show monika zorder 1 at thide
    hide monika
    n 1r "Ох..."
    "Верхняя полка размещалась значительно выше головы Нацуки."
    show natsuki at h11
    "Она подпрыгнула, тщетно пытаясь додуматься, как ей добраться до своей манги."
    n 1q "Да блин!.."
    n "Как же неудобно!"
    n 1c "Я переставлю всё обратно вниз."
    n "На этих полках полно места."
    n "К тому же..."
    n 4w "Они очень мило выглядят, когда стоят в ряд!"
    n "Зачем же прятать такую красоту на верхней полке?"
    mc "Эм, Нацуки..."
    mc "Тут на стене есть табурет."
    "На стене кладовки висел складной табурет."
    mc "Если хочешь, я могу достать и спустить тебе книги..."
    n 1g "Я и сама могу их достать!"
    "Нацуки схватила стул и разложила его."
    n "Ты что, считаешь меня коротышкой?"
    mc "Я считаю..."
    n 5x "Я {i}так{/i} и знала!"
    n 5w "Знаешь что?"
    n "Смотри и учись!"
    "Нацуки вспрыгнула на табурет; тот слегка пошатнулся из-за своей подвижной конструкции."
    n 1f "А-а..."
    mc "Осторожно..."
    n 1r "Я знаю, что делаю!!!"
    "Даже стоя на табурете, Нацуки могла дотянуться до верхней полки только кончиками пальцев."
    "Мне бы его высоты хватило, чтобы без проблем добраться до книг, но Нацуки как всегда упрямилась."
    n "У-у-у..."
    "Нацуки удалось подтолкнуть пальцами к краю полки одну из маленьких коробок."
    n 1t "Видишь?.."
    n 1v "Кья!"
    "Коробка внезапно покачнулась."
    "Нацуки еле-еле успела поймать её до того, как та рухнула на пол."
    "Табурет зашатался."
    show natsuki at h11
    n "Ва-ва-ва..."
    "Потеряв равновесие, Нацуки спрыгнула на пол."
    "К счастью, ей удалось удержаться на ногах."
    "Она победоносно держала коробку в своих руках."
    n 4y "В-вот!"
    "После того, как она чуть не упала, у Нацуки слегка тряслись коленки."
    mc "Боже..."
    mc "Не стоит пытаться что-то мне доказать."
    mc "Ты явно не сможешь достать большие коробки тем же способом."
    mc "Мне несложно до них добраться, так что просто..."
    n 2h "Я же сказала, что справлюсь!"
    n "Мне твоя помощь не нужна, понял?"
    mc "Эх..."
    n "Пойду за стулом, никуда не уходи."
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацуки протолкнулась мимо меня к выходу из кладовки."
    n "Так..."
    "Стулья в классе были присоединены к партам, поэтому было бы слишком затруднительно уместить их в кладовке."
    n "Ага!"
    "Нацуки торопливо направилась к учительскому столу, за которым стоял компьютерный стул."
    "Она схватила его и покатила в сторону кладовки."
    show natsuki 4a zorder 2 at t11
    mc "Эм..."
    "Это не совсем безопасно, ведь этот стул вращается и может укатиться."
    "Но я уже извлёк для себя урок, так что держал рот на замке."
    n 1 "Уф..."
    "Нацуки забралась на стул, а затем медленно нащупала равновесие."
    "Раз уж она отказалась от моей помощи, то я просто сел, опираясь на дверной косяк, и стал наблюдать."
    $ persistent.clear[1] = True
    scene n_cg2_bg
    show n_cg2_base
    with dissolve_cg
    n "Ага! Вот так!"
    n "Видишь? Теперь я спокойно дотягиваюсь."
    "Нацуки взяла стопку манги и наклонилась, чтобы переставить её на полку пониже."
    show n_cg2_base at n_cg2_wiggle
    n "У-у-а-а!.."
    "Стул завращался."
    "Нацуки удержалась, вцепившись в полку."
    show n_cg2_exp1 at cgfade
    n "Вот что ты творишь???"
    n "Нельзя что ли хотя бы придержать стул, а не сидеть сиднем?"
    "{i}(А кто же говорил, что моя помощь не требуется?..){/i}"
    mc "Хорошо, хорошо... Помощь в пути."
    hide n_cg2_exp1
    "Я взялся за стул, а Нацуки снова потянулась вверх."
    mc "!!!"
    "Я..."
    "{i}Я практически мог заглянуть ей под юбку!..{/i}"
    mc "Уф-ф..."
    "Я заставил себя отвернуться."
    "Нацуки действительно ничего не продумала!.."
    "Как только она всё поймет — я труп!"
    show n_cg2_base at n_cg2_wiggle
    n "Хоп..."
    "Нацуки обхватила коробку с \"Parfait Girls\", однозначно самую большую из всех."
    n "У-у... Тяжёлая..."
    show n_cg2_exp1 at cgfade
    n "Эй, [player]..."
    n "М-мне кажется, что я не смогу согнуться так, чтобы не упасть!.."
    n "Скорее возьми эту..."
    mc "Э?"
    mc "Но тогда мне придётся отпустить стул..."
    n "Всё нормально!.."
    n "Всего на секунду!"
    n "Скорее..."
    mc "Хорошо!..."
    mc "Сейчас, только поднимусь."
    "Я медленно ослабил свою хватку на стуле."
    n "Что значит, поднимусь?"
    "Нацуки посмотрела на меня сверху вниз."
    n "Ты почему так далеко?.."
    stop music fadeout 1
    n "Э-э-э?.."
    "Нацуки, казалось, что-то поняла, но если бы сдвинулась с места, то потеряла б равновесие."
    mc "Нацуки, коробка..."
    play music t7
    show n_cg2_exp2 at cgfade
    n "{i}Т-ты на что уставился?!{/i}"
    mc "!!!"
    show n_cg2_base at n_cg2_wiggle_loop
    show n_cg2_exp1 at n_cg2_wiggle_loop
    show n_cg2_exp2 at n_cg2_wiggle_loop
    n "Ты пытался посмотреть на мои... м-мои..."
    "У Нацуки затряслись ноги."
    mc "Да нет же, я просто..."
    mc "Нацуки, не двигайся!"
    mc "Просто отдай мне коробку!"
    n "Ты... Ты извращенец!"
    n "Ты всё это подстроил!!!"
    n "Уходи!"
    n "Вон!"
    mc "Но..."
    n "Сама справлюсь!!!"
    hide n_cg2_exp2
    n "А-а-а..."
    "Стул внезапно провернулся под у Нацуки под ногами."
    mc "Нацуки!"
    show n_cg2_base at n_cg2_wiggle_loop
    show n_cg2_exp1 at n_cg2_wiggle_loop
    show n_cg2_exp2 at n_cg2_wiggle_loop
    n "{i}А-а-а!{/i}"
    "Ситуация превратилась в хаос за долю секунды."
    "Стул вылетел из-под ног Нацуки."
    "Я отчаянно бросился ловить её."
    "Коробка вывалилась из её рук, и книги разлетелись по помещению."
    mc "Ловлю!"
    show n_cg2_base at n_cg2_zoom
    show n_cg2_exp1 at n_cg2_zoom
    show n_cg2_exp2 at n_cg2_zoom
    show black:
        alpha 0
        0.10
        linear 0.10 alpha 1
    pause 0.20
    stop music
    play sound "sfx/fall2.ogg"
    "{i}Бам!{/i}"
    "Нацуки приземлилась на меня всем телом и свалила на пол."
    "Целая куча книг протарабанила мне по лицу."
    "Нацуки попыталась закрыться от них руками и уткнулась лицом прямо мне в грудь."
    mc "Угх..."
    "Мои правая рука и спина пострадали от столкновения сильнее всего."
    play music t8 fadeout 1.0
    scene bg closet
    show natsuki 1v at face
    with dissolve_cg
    n "У-у..."
    "Нацуки постепенно пришла в себя."
    mc "Гх-х!"
    "Она опёрлась на меня руками, чтобы подняться."
    n 1h "А?.."
    "Нацуки, похоже, поняла, что под ней далеко не пол."
    n 1o "У-у-у-у!!!"
    n "Гадость! Гадость!"
    mc "Г-ха!"
    "Я получил удар кулаком в грудь."
    "Нацуки же вскочила на ноги."
    show natsuki 1x zorder 2 at t11
    n "Ты ваще думал, что делаешь?!"
    n "Больной!"
    show monika 1d zorder 3 at f31
    m "У вас там всё в порядке?..."
    m "Я слышала какой-то грохот..."
    "Моника заглянула в кладовку."
    show monika zorder 2 at t31
    show natsuki zorder 3 at f11
    n 1e "Моника!"
    n "Видишь, что случается, когда ты ставишь мангу на верхнюю полку?!"
    n 1w "Ты что, пытаешься убить членов своего клуба?"
    n "Блин!"
    show natsuki zorder 2 at t11
    show monika zorder 3 at f31
    m 5 "Извини, извини!"
    m "Ха-ха-ха..."
    show monika zorder 2 at t31
    show natsuki zorder 3 at f11
    n 5r "А, и вот ещё что."
    n "Похоже, что наш свежеиспечённый член клуба — грязный извращенец."
    n "Надеюсь, ты рада."
    show natsuki zorder 2 at t11
    mc "Я ничего!.."
    "Что-то сдаётся мне, что я не смогу объяснить эту неловкую ситуацию Монике."
    mc "Я ничего не делал!.."
    show monika zorder 3 at f31
    m 1l "Знаю, знаю, не пережива-ай."
    show monika zorder 1 at thide
    hide monika
    "Сказала тихонько Моника."
    "Похоже, пронесло..."
    stop music fadeout 1
    n 1p "О нет!.."
    n "Моя... моя..."
    show natsuki 1m
    mc "А?"
    "Я опустил взгляд."
    "Нацуки сидела на коленях и держала в руках одну из книг, что были разбросаны по полу."
    "Она отчаянно пыталась расправить страницу, поперёк которой красовалась огромная складка."
    mc "А, наверное, книга приземлилась на открытую страницу..."
    stop music fadeout 1
    "Нацуки ещё какое-то время пыталась расправить страницу, но складка не исчезала."
    show natsuki 12b
    "Неожиданно она сдалась, захлопнула книгу и швырнула её в сторону."
    "Только вместо того, чтобы продолжить кричать, она лишь опустила голову."
    play music t9
    show natsuki 12d at s11
    n "{i}*Хнык*{/i}"
    mc "Нацуки, ты что..."
    show natsuki zorder 2 at t11
    n 12f "Нет!"
    "Голос Нацуки скрипнул."
    "Я увидел слёзы на её лице."
    mc "Ох..."
    mc "Я помогу избавиться от этой складки, ладно?"
    mc "Это частично и моя вина, так что..."
    "Нацуки покачала головой, не поднимая взгляда."
    n "Нет..."
    n "Это не так уж и важно..."
    n "У меня просто..."
    n "Сегодня очень плохой день..."
    "Нацуки снова всхлипнула."
    n 12i "Я не хотела на тебя срываться..."
    n "Правда не хотела!"
    mc "Всё... Всё в порядке."
    mc "Ты не хочешь мне ничего рассказать?"
    show natsuki 12f
    "Нацуки снова помотала головой."
    n "Просто..."
    n "Так тяжело..."
    n "Каждый... день."
    n "Я просто хочу..."
    n "Приходить в клуб и..."
    n "..."
    "Нацуки снова замолкла."
    "Я не мог больше давить на неё, поэтому решил сделать то, что умею."
    mc "Что ж..."
    mc "Давай-ка я помогу тебе прибраться."
    mc "А заодно и переставить оставшуюся мангу."
    mc "Хм."
    "Я подобрал второй том \"Parfait Girls\"."
    mc "А вот это мы отложим."
    mc "Должно помочь тебе взбодриться."
    mc "Можем начать, как только я закончу с уборкой."
    show natsuki 12h
    "Нацуки подняла на меня взгляд. Её глаза блестели от слёз."
    "Её губы дрожали."
    n "Ты..."
    n "Ты так добр ко мне..."
    mc "А?"
    "Слышать такое от Нацуки было очень странно."
    "Я совершенно этого не ожидал."
    mc "Ну..."
    mc "Знаешь, я просто отношусь к тебе как к другу."
    n 12f "Нгх..."
    show natsuki at thide
    hide natsuki
    "Нацуки опустила взгляд и сдержала очередной всхлип."
    "Я не знал, что с ней случилось сегодня, так что мне оставалось хотя бы проявить заботу."
    "Следующие несколько минут, когда я начал собирать разбросанные по всей кладовке книги, прошли в тишине."
    "Я следил за тем, чтобы раскладывать их по коробкам в правильном порядке."
    "Через какое-то время мне начала помогать Нацуки."
    "Вдвоём мы довольно быстро расправились с нашей задачей, и я взгромоздил коробку на нужную полку."
    "Затем встал на табурет и шустро переместил оставшуюся на верхней полке мангу."
    mc "Ну что..."
    mc "Вроде всё."
    "Я спрыгнул с табурета."
    "Нацуки отвела свой взгляд в сторону."
    show natsuki 5u at t11
    n "С-спасибо..."
    mc "Ха-ха..."
    mc "Да не за что."
    "Нацуки держала в руках томик, отложенный мной ранее."
    mc "Окей, я готов."
    n 2n "Отлично."
    n "Хотя я бы тебя всё равно заставила."
    n 2u "Нужно отвечать за свои слова."
    n "Ну, про моё приободрение."
    mc "Как скажете!"
    play music t8 fadeout 1
    scene bg club_day
    with wipeleft_scene
    "Мы сели там же, где и в прошлый раз, и я открыл второй том."
    "У Нацуки довольно быстро поднялось настроение — она начала смеяться и указывать мне на всякие интересности."
    "Она оказалась на удивление проницательной, потому как смогла заметить множество повторяющегося тонкого юмора и всяких закадровых элементов."
    "В конце концов я остался доволен тем, как в этой манге всё увязали между собой."
    "Получается, что Нацуки всё же облает хорошим вкусом."
    "Прошло ещё немного времени, и Моника, как обычно, завладела нашим вниманием. Пришло время обмениваться стихами."
    show natsuki 2j zorder 2 at t11
    mc "Я пока оставлю это себе, пожалуй."
    n "Ага!"
    n "В твоём голосе значительно больше энтузиазма, чем в прошлый раз."
    mc "Ну, если честно, меня начинает затягивать."
    n 4z "Хе-хе-хе."
    n "Говорила же."
    mc "Да, да, да..."
    show natsuki zorder 1 at thide
    hide natsuki
    "Я вернулся к своему месту и засунул книгу в сумку."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
