label natsuki_exclusive_1:
    scene bg club_day
    with wipeleft_scene
    n "Уф...!"
    "Я слышу, как Нацуки издаёт раздражённый вздох изнутри шкафа."
    "Похоже, что она чем-то недовольна."
    "Я иду к ней, на случай, если ей нужна помощь."
    play music t6 fadeout 1
    scene bg closet
    show natsuki 4r zorder 2 at t11
    with wipeleft_scene
    mc "Ты что-то ищешь?"
    n 4x "Чёртова Моника..."
    n "Она никогда не кладёт мои вещи обратно на место!"
    n "Что толку раскладывать всю коллекцию по порядку, если кто-то может прийти и всё испортить?"
    "Нацуки сдвигает кучу сложенных книг и коробок на полке."
    mc "Манга..."
    n 2c "Ты же читаешь мангу, да?"
    mc "Ах--"
    mc "...Иногда..."
    "Манга -- это одна из тех вещей, признаться в любви к которой ты не можешь, пока не узнаешь, как другой человек к этому относится."
    mc "...Как ты догадалась?"
    n 2k "Я слышала, что ты как-то упоминал об этом."
    n "Кроме того, у тебя это на лице написано."
    "О чем это она...?"
    mc "Я-ясно..."
    "Одинокий том манги стоит посреди разнообразных книг, на краю одной из полок."
    "Заинтересованный, я вытаскиваю его."
    n 1b "{i}Вот{/i} он где!"
    "Нацуки выхватывает его из моих рук."
    "Потом поворачивается к коробке с мангой и вставляет том ровно в середину между остальными."
    n 4d "Ахх, так гораздо лучше!"
    n "Видеть полный сборник без одной книги -- так режет глаз."
    mc "Мне знакомо это чувство..."
    "Я присматриваюсь к сборнику, которым она восхищена."
    mc "Девочки Парфе...?"
    "Это серия, о которой я никогда не слышал."
    "Скорее всего, это потому, что она не для моего возраста, или, может, потому, что просто отвратительна."
    n 5g "Если собираешься осуждать, можешь делать это через стекло вот этой двери."
    "Она указывает на дверь класса."
    mc "Э-эй, я никого не осуждаю...!"
    mc "Я даже ничего не сказал."
    n 5c "Тон твоего голоса."
    n "Но я скажу тебе одну вещь, [player]."
    n 4l "Считай это уроком прямиком от Литературного Клуба: нельзя судить книгу по её обложке!"
    n "А вообще--"
    "Нацуки достаёт первый том Девочек Парфе из коробки."
    n "Я покажу тебе, почему!"
    "Она впихивает книгу мне в руки."
    mc "Ах..."
    "Я рассматриваю обложку."
    "На ней четыре девочки в разноцветных нарядах стоят в женственных позах."
    "Это такое 'моэ'."
    n 4b "Не стой столбом!"
    mc "Воу--"
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацуки хватает меня за руку и вытягивает из шкафа."
    "Затем она садится к стенке, под окном."
    "Она хлопает по полу рядом с собой, указывая мне, где сесть."
    show bg club_day
    show natsuki 2a zorder 2 at t11
    with wipeleft
    mc "Разве на стульях не удобнее...?"
    "Я сажусь."
    n 2k "На стульях не выйдет."
    n "Так мы не сможем читать одновременно."
    mc "Э? Почему?"
    mc "А... так проще сесть ближе друг к другу..."
    n 2o "--!"
    n 5r "Н-не говори так!"
    n "Ты заставляешь меня чувствовать себя странно!"
    "Нацуки скрещивает руки и отползает от меня на пару сантиметров."
    mc "Извини..."
    show natsuki 5g
    "Я тоже не ожидал, что буду сидеть так близко к ней..."
    "Не могу сказать, что это что-то плохое."
    "Я открываю книгу."
    "Всего через пару секунд Нацуки снова приближается, занимая оставшееся место, надеясь, что я не замечу."
    "Более устремлённая начать читать, чем я, она пристально смотрит через моё плечо."
    n 1k "Ого, как же много времени прошло с тех пор, как я читала начало...?"
    mc "Мм?"
    mc "Разве ты не перечитываешь старые тома время от времени?"
    n 2k "Если честно, нет."
    n "Может, как-нибудь позже, после того, как я закончу серию."
    n 2c "Эй, ты внимательно читаешь?"
    mc "Ух..."
    "Я внимателен, но ничего особенного не происходит, поэтому я могу говорить и читать одновременно."
    "Похоже, это про группу подруг в старшей школе."
    "Типичная 'повседневка'."
    "Я их уже перерос, поскольку редко какое произведение достаточно развлекает, чтобы был незаметен недостаток сюжета."
    mc "Итак..."
    mc "Что я должен от этого ожидать?"
    mc "Тут будет сюжет?"
    n 4w "Очевидно же!"
    n "Ты думаешь, мне бы понравилось что-то без сюжета?"
    n 4c "В смысле..."
    n 2c "Я поняла, о чем ты..."
    n 2k "Большая часть пролога рассказывает о простых вещах..."
    n "Например, тут забавная часть, где они одержимы парнем в магазине мороженого..."
    n 2c "Но всё это помогает узнать персонажей!"
    n "Да и вообще, это всё ещё развлекает."
    n 2d "А дальше тут есть всякая драма..."
    n "Например, все их предыстории, и когда начинается романтика..."
    n "Это всё делает её такой хорошей историей."
    n 2a "Тут так много по-настоящему трогательных вещей."
    mc "О, правда?"
    mc "Звучит так, словно ты знаешь, о чём говоришь."
    mc "Возможно, я тебя недооценил."
    n 2z "Хехехе."
    n 1f "...Эй, погоди-ка!"
    n "Что {i}это{/i} должно значить?!"
    mc "Эммм--"
    "Нацуки легонько пихает меня."
    mc "Я имел в виду, что я ещё не видел всей твоей мощи..."
    n 5s "Хм. Выкрутился."
    mc "Ах... Похоже, эта глава про выпечку."
    mc "Это просто догадка, но не многовато ли выпечки в этой манге?"
    n 5b "Что ж--"
    "Нацуки замирает на мгновение, словно она не желает чего-то признавать."
    n 2q "...Ага."
    n "Это так важно?"
    mc "Не очень, просто интересно..."
    mc "Ты ведь тоже любишь выпекать, да?"
    n 1o "Это--"
    n "Просто совпадение!"
    n 1t "Так случилось, что мне понравилось выпекать примерно тогда же, когда я нашла эту мангу."
    n "Будто я могла бы увлечься чем-то только потому, что это было в манге."
    n 4y "Мне жаль тех, кто может этим впечатлиться."
    n "Ахаха!"
    "Точно не совпадение..."
    "Полагаю, это объясняет интерес Нацуки к выпечке."
    "И всё равно, из всех хобби, подцепленных в манге, это, -- определённо -- одно из лучших."
    "А если ещё учесть, что она в этом хороша, то кто я такой, чтобы судить?"
    $ persistent.clear[0] = True
    scene n_cg1_bg
    show n_cg1_base
    with dissolve_cg
    "..."
    "Мы почитали вместе ещё пару минут."
    "К этому времени я закончил несколько глав."
    mc "..."
    mc "...Ты уверена, что тебе не скучно?"
    n "Не скучно!"
    mc "Несмотря на то, что ты просто смотришь, как я читаю?"
    n "Ну...!"
    n "Мне... и так нормально."
    mc "Ну, как скажешь..."
    mc "...Я думаю, что должно быть весело делиться с другими тем, что ты любишь."
    mc "Мне очень нравится, когда получается уговорить кого-то попробовать мангу, которая мне по душе."
    mc "Ты ведь понимаешь, о чём я?"
    n "...?"
    mc "Хм?"
    mc "Не понимаешь?"
    show n_cg1_exp2 at cgfade
    n "Умм..."
    n "Это не..."
    n "Ну, откуда мне знать."
    mc "...О чём ты?"
    mc "Разве ты не делилась мангой со своими друзьями?"
    hide n_cg1_exp2
    show n_cg1_exp3 at cgfade
    n "Ты не мог бы не давить на больное?"
    n "Блин..."
    mc "Ах... извини..."
    n "Пфф."
    n "Как будто я могу заставить своих друзей это читать..."
    n "Они думают, что манга -- это для детей."
    n "Я не могу даже упомянуть о ней, как они начинают, типа..."
    n "'Э? Ты ещё не выросла из этого?'"
    n "Как врезала бы..."
    mc "Эх, я знаю таких людей..."
    mc "Если честно, сложно найти друзей, которые не станут это осуждать, легче найти тех, кто так же это любит..."
    mc "Я уже, вроде как, неудачник, видимо меня притягивает к другим неудачникам."
    mc "Должно быть, это ещё сложнее для кого-то вроде тебя..."
    hide n_cg1_exp3
    n "Хм."
    n "Да, пожалуй."
    "{i}...Погодите, что 'да'??{/i}"
    n "Мне кажется, я даже не могу держать мангу в своей комнате..."
    n "Даже не знаю, что сделал бы отец, если бы нашёл это."
    n "По крайней мере, в клубной комнате она в безопасности."
    show n_cg1_exp3 at cgfade
    n "Разве что Моника ведёт себя как дура из-за этого..."
    n "Ух! Весь мир против меня, да?"
    mc "Ну, это же стоило того, да?"
    mc "В смысле, вот я, сижу, читаю."
    n "А толку-то?"
    mc "Ну..."
    mc "По крайней мере, тебе нравится, да?"
    hide n_cg1_exp3
    show n_cg1_exp2 at cgfade
    n "--"
    n "..."
    n "...И?"
    mc "Ахаха."
    hide n_cg1_exp2
    show n_cg1_exp3 at cgfade
    n "Блин, задолбал!"
    n "Ты читать будешь, или как?"
    mc "Да, да..."
    "Я переворачиваю страницу."
    "Нацуки внезапно рассмеялась."
    hide n_cg1_exp3
    show n_cg1_exp1 at cgfade
    n "Ахахаха!"
    n "Я совсем об этом забыла!"
    "Нацуки показывает пальцем на один из фреймов."
    n "Минори -- мой любимый персонаж."
    n "Её всегда немного жаль, потому что она такая невезучая."
    n "Но все становится совсем плохо когда--"
    hide n_cg1_exp1
    n "Мм..."
    n "Рано об этом говорить!"
    n "Просто дочитай главу!"
    scene bg club_day
    with dissolve_cg
    "Голос Нацуки наполнен восторгом."
    "Такой контраст с её обычным командным тоном."
    "Если она не привыкла делиться любимой мангой с друзьями, я могу понять почему."
    "Сложно описать словами это чувство, когда ты так соединяешься с кем-то."
    "Дать Нацуки, для которой это редкость, возможность сделать это..."
    "Эта мысль заставляет меня немного улыбнуться про себя."
    show monika 4b zorder 3 at f21
    m "Ладно, все!"
    mc "Э?"
    m "Вы и ваши поэмы готовы?"
    mc "..."
    show monika zorder 2 at t21
    show natsuki 4w zorder 3 at f22
    n "Ой, да ладно!"
    n "Так не вовремя!"
    show natsuki zorder 2 at t22
    show monika zorder 3 at f21
    m 5 "Извини~!"
    m "Должна была убедиться, что у нас хватит времени."
    m "Хотя, как я погляжу, вы тут уютно устроились. Ахаха!"
    show monika zorder 2 at t21
    show natsuki zorder 3 at f22
    n 4o "Э...?"
    n 1p "А-ах!"
    "Нацуки внезапно замечает, как близко она ко мне сидит."
    "Она резко сдвигается на добрых пол метра от меня."
    show monika zorder 1 at thide
    show natsuki 1s zorder 2 at t11
    hide monika
    mc "Хорошо..."
    mc "Тогда я остановлюсь на этом месте."
    "Я закрываю книгу и передаю её Нацуки."
    n 2m "Ты просто возвращаешь её назад...?"
    n "А тебе не хочется узнать, что произойдёт дальше?"
    mc "А... Да, но..."
    mc "Моника только что сказала--"
    n 2u "Не тупи."
    n "Просто возьми её домой."
    mc "Э?"
    mc "...А можно?"
    "Я спросил это, потому что не планировал тратить своё свободное время на чтение..."
    n 4h "Ну конечно."
    n "Если ты не возьмёшь её домой, уйдёт вечность на то, чтобы закончить читать."
    n "Только дочитай эту до завтра, чтобы мы могли начать новую."
    n 4g "К тому же, если погнёшь её, я тебя убью."
    mc "До завтра...?"
    show natsuki zorder 1 at thide
    hide natsuki
    "Я прочитал только часть тома."
    "Скорее всего, я пропущу несколько телепередач из-за этого..."
    "Полагаю, это вынужденная жертва в обмен на пылающее энтузиазмом лицо Нацуки."
    "Или я напуган тем, что будет со мной, если я {i}не{/i} закончу читать...?"
    mc "Ну ладно!"
    "Я встаю."
    "Я возвращаюсь к своим вещами и осторожно кладу книгу в свою сумку."
    return


label natsuki_exclusive_2:
    $ n_exclusivewatched = True
    play music t6 fadeout 1
    scene bg club_day
    show natsuki 4c zorder 2 at t11
    with wipeleft_scene
    n "..."
    "Немного времени прошло перед тем, как Нацуки подошла ко мне, смотря выжидающе."
    mc "Да, да."
    mc "Не волнуйся, я сдержал слово."
label natsuki_exclusive_2_ch3:
    "Я достал первый том Девочек Парфе из своей сумки."
    "Нацуки берёт его из моих рук, потом быстро переворачивает его, наверное, ищет вмятины."
    mc "Эй, я не настолько неосторожный..."
    mc "Я часто имею дело с мангой, знаешь ли."
    n 1m "Я просто хотела проверить!"
    n 1c "Хочешь упрекнуть меня в том, что я параноик?"
    n "Не каждый день я людям свою мангу даю, знаешь ли."
    mc "Верно..."
    mc "Я не упрекаю тебя."
    n 2j "Так или иначе, дай мне поставить её на место."
    n "Я возьму следующую, хорошо?"
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацуки идёт к шкафу."
    "Я за ней."
    show bg closet
    show natsuki 2l zorder 2 at t11
    with wipeleft
    n "Ты же расскажешь мне всё, что ты о ней думаешь??"
    n 2k "Где этот том заканчивается? Я не помню."
    mc "Глава закончилась, когда Минори и Алиса нашли--"
    show natsuki 1e at h11
    n "{i}Моника!!{/i}"
    "Голос Нацуки резонирует в шкафу."
    mc "Э...?"
    "Я заглядываю внутрь."
    "Все книги Нацуки сложены на верхней полке."
    n "Ты опять убрала мою мангу?!"
    show monika 3l at l31
    m "Ах, прости, прости!"
    m "Учитель был недоволен тем, что мы занимаем столько места в его шкафу..."
    m "Мне пришлось убрать некоторые вещи и немного прибраться."
    m 3b "Они всё ещё тут, просто я немного их упорядочила"
    show monika zorder 1 at thide
    hide monika
    n 1r "Уф..."
    "Верхняя полка намного выше головы Нацуки."
    show natsuki at h11
    "Она делает бесплодный прыжок в попытке достать свою мангу."
    n 1q "Блин...!"
    n "Это так неудобно!"
    n 1c "Я снова поставлю всё вниз."
    n "Тут куча места на нижних полках."
    n "Да и вообще..."
    n 4w "Они же так красиво выглядят, когда расставлены по порядку!"
    n "Зачем прятать такую красоту на верхней полке?"
    mc "Ах, Нацуки..."
    mc "Есть же стульчик, вот, на стене."
    "В шкафу есть складной стульчик, висящий на стенке."
    mc "Если хочешь, я достану и дам тебе..."
    n 1g "Я сама могу!"
    "Нацуки хватает стульчик со стенки шкафа и раскладывает его."
    n "Ты думаешь, что я слишком низкая, или что-то вроде того?"
    mc "Я имел в виду--"
    n 5x "Я так и {i}знала{/i}!"
    n 5w "Знала что?"
    n "Просто смотри!"
    "Нацуки вскакивает на стульчик, который немного пошатывается из-за того, что он складной."
    n 1f "А-ах..."
    mc "Осторожно..."
    n 1r "Я знаю, что делаю!!"
    "Даже стоя на стульчике, Нацуки дотягивается до верхней полки лишь кончиками пальцев."
    "Мне хватило бы этого стульчика, чтобы достать книги, но Нацуки как всегда упрямится."
    n "У-ууух..."
    "Нацуки кончиками пальцев сдвигает одну из маленьких коробок к краю полки."
    n 1t "Видишь...?"
    n 1v "Кья--!"
    "Неожиданно коробка соскальзывает."
    "Нацуки ловит её прямо у пола."
    "Стульчик шатается."
    show natsuki at h11
    n "Ваваа--"
    "Теряя равновесие, Нацуки спрыгивает со стульчика."
    "К счастью, она устояла на ногах."
    "Она победоносно держит коробку."
    n 4y "В-вот!"
    "Чуть не упав, Нацуки немного взбудоражилась."
    mc "Блин..."
    mc "Не надо мне ничего доказывать."
    mc "Да и взять более крупные коробки вот так у тебя не выйдет."
    mc "Я могу их достать, так что--"
    n 2h "Я сказала, я справлюсь!"
    n "Мне не нужна твоя помощь, ясно?"
    mc "Эх..."
    n "Я возьму стул, так что стой."
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацуки выходит из шкафа отпихивая меня."
    n "Посмотрим..."
    "Классные стулья соединены со столами, так что их будет неудобно заталкивать в шкаф."
    n "Ага!"
    "Нацуки делает рывок к столу учителя, около которого стоит компьютерное кресло."
    "Она закатывает его в шкаф."
    show natsuki 4a zorder 2 at t11
    mc "Ах--"
    "Это небезопасно, потому что кресло вертится и катается."
    "Но я уже учёный, так что молчу."
    n 1 "Уф--"
    "Нацуки залезает на кресло, затем осторожно балансирует на ногах."
    "От моей помощи она отказалась, так что я просто смотрю, оперевшись спиной на дверной косяк."
    $ persistent.clear[1] = True
    scene n_cg2_bg
    show n_cg2_base
    with dissolve_cg
    n "Ага! Вот так вот!"
    n "Видишь? Проще простого."
    "Нацуки берёт стопку манги и сгибается, чтобы поставить её на полку ниже."
    show n_cg2_base at n_cg2_wiggle
    n "В-Ваах--"
    "Кресло разворачивается."
    "Нацуки хватается за полку."
    show n_cg2_exp1 at cgfade
    n "Что ты делаешь??"
    n "Мог бы подержать кресло, вместо того, чтобы стоять и ничего не делать?"
    "{i}(И кто говорил мне не помогать...?){/i}"
    mc "Да, да... я понял."
    hide n_cg2_exp1
    "Я держу кресло, пока Нацуки встаёт."
    mc "--!"
    "Я..."
    "{i}Я почти вижу то, что у неё под юбкой?!{/i}"
    mc "Гух--"
    "Я заставляю себя отвернуться."
    "Нацуки как-то не подумала об этом...!"
    "Как только она поймёт -- я труп!"
    show n_cg2_base at n_cg2_wiggle
    n "Хоп--"
    "Нацуки крепко хватает большую коробку со сборником Девочек Парфе."
    n "Уу... тяжёлая..."
    show n_cg2_exp1 at cgfade
    n "Эй, [player]..."
    n "М-мне кажется, я не смогу поставить её вниз не упав...!"
    n "Быстрее, возьми её..."
    mc "Э?"
    mc "Но тогда я отпущу кресло..."
    n "Нормально...!"
    n "Всего-то на секунду!"
    n "Скорее..."
    mc "Хорошо...!"
    mc "Дай только встать."
    "Я осторожно отпускаю кресло."
    n "В смысле 'встать'?"
    "Нацуки смотрит вниз на меня."
    n "Почему ты там внизу--"
    stop music fadeout 1
    n "Э-ээ...?"
    "Нацуки выглядит так, словно она поняла что-то, но если она двинется, потеряет равновесие."
    mc "Нацуки, коробка--"
    play music t7
    show n_cg2_exp2 at cgfade
    n "{i}Н-на что ты уставился?!{/i}"
    mc "--!"
    show n_cg2_base at n_cg2_wiggle_loop
    show n_cg2_exp1 at n_cg2_wiggle_loop
    show n_cg2_exp2 at n_cg2_wiggle_loop
    n "Ты пытаешься посмотреть на мои... м-мои..."
    "Ноги Нацуки трясутся."
    mc "Н-нет! Я просто--"
    mc "--Нацуки, не двигайся!"
    mc "Просто отдай мне коробку!"
    n "Ты... ты извращенец!"
    n "Ты всё подстроил!!"
    n "Уйди!"
    n "Убирайся!"
    mc "Но--"
    n "Я сама всё сделаю!!"
    hide n_cg2_exp2
    n "А-ах--"
    "Кресло неожиданно прокручивается под ногами Нацуки."
    mc "Нацуки--!"
    show n_cg2_base at n_cg2_wiggle_loop
    show n_cg2_exp1 at n_cg2_wiggle_loop
    show n_cg2_exp2 at n_cg2_wiggle_loop
    n "{i}Кьяяяяя!{/i}"
    "Сцена превращается в хаос в течение секунды."
    "Кресло выскальзывает из-под ног Нацуки."
    "Я всеми силами пытаюсь поймать её."
    "Коробка вырывается из её рук, и книги взлетают в воздух."
    mc "Ловлю--"
    show n_cg2_base at n_cg2_zoom
    show n_cg2_exp1 at n_cg2_zoom
    show n_cg2_exp2 at n_cg2_zoom
    show black:
        alpha 0
        0.10
        linear 0.10 alpha 1
    pause 0.20
    stop music
    play sound "sfx/fall2.ogg"
    "{i}Бум!{/i}"
    "Вес тела Нацуки словно бросает меня на пол."
    "Целая куча книг колотит меня по лицу."
    "Нацуки пытается прикрыться руками, падая лицом на мою грудь."
    mc "Угхх..."
    "Моя правая рука и спина сполна прочувствовали удар."
    play music t8 fadeout 1.0
    scene bg closet
    show natsuki 1v at face
    with dissolve_cg
    n "У-уу..."
    "Постепенно Нацуки приходит в себя."
    mc "Гхк--!"
    "Она отталкивается от меня в попытках подняться."
    n 1h "Ээ...?"
    "Кажется, она поняла, что под ней нет пола."
    n 1o "Г-Гууууу...!!"
    n "Мерзость! Мерзость!"
    mc "Гхак--!"
    "Кулак прилетел мне в грудь."
    "Затем Нацуки поднимается на ноги."
    show natsuki 1x zorder 2 at t11
    n "О чем ты думал?!"
    n "Ты больной!"
    show monika 1d zorder 3 at f31
    m "Тут всё в порядке...?"
    m "Я услышала какой-то шум..."
    "Моника неожиданно заглянула в шкаф."
    show monika zorder 2 at t31
    show natsuki zorder 3 at f11
    n 1e "Моника!"
    n "Видишь, что происходит из-за того, что ты кладёшь мангу на верхнюю полку?!"
    n 1w "Ты что, пытаешься убить членов нашего клуба?"
    n "Блин!"
    show natsuki zorder 2 at t11
    show monika zorder 3 at f31
    m 5 "П-прости, прости!"
    m "Ахаха..."
    show monika zorder 2 at t31
    show natsuki zorder 3 at f11
    n 5r "О, и ещё кое-что."
    n "Похоже, что новенький член клуба -- полный извращенец."
    n "Надеюсь, ты довольна."
    show natsuki zorder 2 at t11
    mc "Я не--!"
    "Почему-то я не могу объяснить эту странную ситуацию Монике."
    mc "Я ничего не делал, клянусь...!"
    show monika zorder 3 at f31
    m 1l "Знаю, знаю, не беспокойся~"
    show monika zorder 1 at thide
    hide monika
    "Моника тихо говорит мне это."
    "Похоже, я как-то выпутался..."
    stop music fadeout 1
    n 1p "О нет...!"
    n "Моя... Моя..."
    show natsuki 1m
    mc "Э?"
    "Я смотрю вниз."
    "Нацуки стоит на коленях держа одну из книг, остальные раскиданы повсюду."
    "На странице видна большая замятина, которую она отчаянно пытается разгладить."
    mc "Ах, видимо упала прямиком на страницу..."
    stop music fadeout 1
    "Нацуки сильнее пытается выправить замятину, но у неё не выходит."
    show natsuki 12b
    "Внезапно она, сдавшись, захлопывает книгу и бросает её на пол."
    "Вместо того, чтобы продолжать возмущаться, она просто опускает голову."
    play music t9
    show natsuki 12d at s11
    n "{i}*Хнык*{/i}"
    mc "...Нацуки, ты--"
    show natsuki zorder 2 at t11
    n 12f "Нет!"
    "Голос Нацуки срывается."
    "Я вижу слезы на её лице."
    mc "Ах..."
    mc "Я помогу выправить, хорошо?"
    mc "Это отчасти моя вина, так что..."
    "Нацуки качает головой, всё ещё не поднимая её."
    n "Нет..."
    n "Это не так уж и важно..."
    n "Просто..."
    n "У меня сегодня очень плохой день..."
    "Нацуки снова всхлипывает."
    n 12i "Я не хотела срывать свою злость на тебе..."
    n "Я правда не хотела!"
    mc "Всё... всё хорошо."
    mc "...Может, ты хочешь о чем-то поговорить?"
    show natsuki 12f
    "Нацуки качает головой."
    n "Просто..."
    n "Каждый день..."
    n "...такой... сложный."
    n "Я просто хотела..."
    n "...прийти в клуб и..."
    n "..."
    "Нацуки снова замолкает."
    "Я не могу давить на неё, так что я могу делать только то, что умею."
    mc "Ладно..."
    mc "Что ж, я помогу это всё убрать."
    mc "И перенесу остальную мангу для тебя."
    mc "Ах."
    "Я поднимаю второй том Девочек Парфе."
    mc "Эту мы отложим."
    mc "Он тебя немного взбодрит, да?"
    mc "Можно начать, как только я закончу с остальным."
    show natsuki 12h
    "Нацуки смотрит на меня с блеском в глазах."
    "Её губы дрожат."
    n "Ты..."
    n "Ты так добр ко мне..."
    mc "Э?"
    "Слышать это от Нацуки очень странно."
    "Этого я совсем не ожидал."
    mc "Ну..."
    mc "Я всего лишь отношусь к тебе как к другу, понимаешь?"
    n 12f "Нн..."
    show natsuki at thide
    hide natsuki
    "Нацуки опускает голову и подавляет очередной всхлип."
    "Не знаю, что с ней сегодня случилось, но быть внимательным к ней -- это самое малое, что я могу для неё сделать."
    "Несколько следующих минут, пока я собираю разбросанные книги, наполнены тишиной."
    "Я должен поставить их все в правильном порядке."
    "Чуть позже Нацуки начинает помогать."
    "Мы довольно скоро закончили, и я поднимаю коробку на ту полку, на которую Нацуки собиралась её поставить."
    "После я встаю на стульчик и быстро заканчиваю перестановку книг с верхней полки."
    mc "Отлично--!"
    mc "Всё сделано."
    "Я спрыгиваю со стульчика."
    "Нацуки отводит глаза."
    show natsuki 5u at t11
    n "С-спасибо..."
    mc "Ахаха..."
    mc "Не за что."
    "Нацуки держит в руках тот том, который я отложил."
    mc "Отлично, я готов."
    n 2n "Хорошо."
    n "Даже если не готов, я заставлю."
    n 2u "Ты должен отвечать за свои слова."
    n "Насчёт того, чтобы меня взбодрить."
    mc "Если ты настаиваешь."
    play music t8 fadeout 1
    scene bg club_day
    with wipeleft_scene
    "Мы садимся на то же самое место, что и в прошлый раз, и открываем второй том."
    "Настроение Нацуки быстро улучшается, она смеётся и разъясняет мне некоторые вещи."
    "Она на удивление часто острит, замечая множество повторяющихся шуток и множество мелочей."
    "В конце концов, я весьма впечатлён, тем как всё в этой манге связанно."
    "Видимо, у Нацуки всё же хороший вкус."
    "Какое-то время спустя, Моника требует нашего внимания, это значит, что снова пора делиться поэмами."
    show natsuki 2j zorder 2 at t11
    mc "Полагаю, это остаётся у меня."
    n "Ага!"
    n "Ты выглядишь более заинтересованным сегодня."
    mc "Ну мне начинает это нравиться, знаешь ли."
    n 4z "Эхехе."
    n "Говорила же."
    mc "Да, да..."
    show natsuki zorder 1 at thide
    hide natsuki
    "Я возвращаюсь на своё место и кладу книгу себе в сумку."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
