label sayori_exclusive_1:
    scene bg club_day
    with wipeleft_scene
    if not renpy.music.get_playing(channel='music') == audio.t2:
        play music t2 fadeout 1
    "Ну вот..."
    "Похоже, сегодня до меня никому нет дела."
    "Я плюхнулся за ближайший стол."
    "Ну и как мне самому заниматься чем-то, связанным с литературой?"
    "Можно было бы, конечно, почитать ту книгу, что дала мне Юри..."
    "Но я слишком устал, чтобы читать."
    "Как бы сейчас не заснуть..."
    "В конце концов я закрыл глаза и прислушался к разговору Моники и Саёри."
    show sayori 1g zorder 2 at t21
    s "Мы, скорее всего, будем выглядеть отстойно на фоне других клубов..."
    show monika 2r zorder 3 at f22
    m "Хм-м..."
    m 2b "Ну, не стоит вешать нос."
    m "Этот фестиваль — наш шанс показать всем, что такое литература!"
    m 2d "Проблема в том, что сама идея литературного клуба выглядит слишком заумной..."
    m "Но на деле-то всё не так, понимаешь?"
    m 2a "Нам лишь нужно суметь показать это другим..."
    m "Найти что-то такое, с чем можно обратиться к их творческим умам."
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 1i "М-м-м....."
    s "Это не решает нашей проблемы!"
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 2d "А? Что ты имеешь в виду?"
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 1c "Даже если мы придумаем что-то невероятно весёлое..."
    s "Сразу могу сказать, что никто не придёт только потому, что представление связано с литературой."
    s "Так что нам в первую очередь важно найти способ заманить к себе людей, понимаешь?"
    s 1a "А уж потом заниматься обращением к их, этим, творческим умам."
    "Что это было?"
    "Саёри рассуждала очень серьёзно."
    "От неё нечасто услышишь подобные умозаключения."
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 2a "Да, верно подмечено..."
    m "Тогда, может, будем ловить на еду?"
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 1n "К-какую?!"
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 2b "Ох... Ну, я думаю, мы могли бы..."
    show monika zorder 2 at t22
    show sayori 4r zorder 3 at f21
    s "Пирожные!"
    show sayori zorder 2 at t21
    show monika 1k zorder 3 at f22
    m "Ха-ха. Хорошая мысль."
    m 1a "Нацуки с радостью их приготовит."
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 4x "О! Точно!"
    s "Нацуки печёт самые вкусные пирожные!"
    s "Это идеально нам подходит..."
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 1d "А ты разве не поэтому их предложила?.."
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 4q "Пирожные обращаются к моему творческому животику."
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 1l "..."
    m "Пирожные так пирожные."
    show monika zorder 2 at t22
    show sayori zorder 3 at f21
    s 1g "Есть хочу..."
    show sayori zorder 2 at t21
    show monika zorder 3 at f22
    m 1a "Ладно, нам нужно проработать детали самого представления..."
    scene black
    with close_eyes
    "Я почувствовал, как на лице расплылась улыбка."
    "В конце концов, Саёри продолжала быть собой."
    "Но было в ней что-то неожиданное, что заставляло восхищаться ею."
    "В отличие от неё, у меня постоянные проблемы с нахождением мотивации..."
    "Саёри может полностью отдаться делу и довести его до конца."
    "Наверное поэтому я и позволяю ей отчитывать меня по поводу некоторых вещей."
    "Крайне интересно было бы увидеть мир её глазами..."
    scene bg club_day
    show sayori 1b at face
    with open_eyes
    mc "У-а-а!"
    "Я открыл глаза и обнаружил, что мой обзор закрыт лицом Саёри."
    "Я чуть не упал со стула."
    show sayori zorder 2 at t11
    s 4q "Хе-хе, извини-и..."
    s 4i "Стоп!"
    s 1j "Вообще-то, мне не за что извиняться!"
    s "Сам виноват, что вот так заснул!"
    s "Тут тебе не клуб засонь, знаешь ли!"
    mc "У нас в школе есть такой клуб?.."
    s 1h "Ты опять не спишь по ночам, да?"
    s "Теперь, когда ты вступил в клуб, у тебя будет меньше времени на аниме!"
    s "Привыкай!"
    mc "Ну ты чего, тише!.."
    "Я обернулся, чтобы проверить, не услышала ли Моника."
    s 1g "Но ведь это правда..."
    mc "Да знаю..."
    mc "Знаю."
    mc "Ты всегда обо мне заботишься, Саёри."
    s 4q "Хе-хе."
    s "Тут я мастер!"
    mc "Вот в этом и проблема!"
    mc "Что насчёт тебя?"
    mc "Ты больше заботишься обо мне, чем о самой себе."
    mc "Ты до сих пор так и не научилась вовремя вставать, не так ли?"
    s 1l "Э?"
    s "И-иногда я встаю вовремя!"
    mc "Звучит как-то неубедительно..."
    mc "Сколько раз такое случалось за последнюю неделю?"
    s 1m "Это..."
    s 1o "Секрет!"
    mc "Так и знал..."
    s 5a "Ну-у-у!"
    s "Ты даже не дал мне шанса оправдаться..."
    mc "Незачем."
    mc "Тебя выдаёт твой вид."
    s 1b "А?.."
    "Саёри оглядела себя."
    s "Что значит, \"вид выдаёт\"?"
    mc "Ты сегодня явно торопилась..."
    mc "Смотри, вот тут у тебя волосы торчат."
    show sayori at h11
    s 1e "Ах..."
    "Я пробежался пальцами по волосам Саёри, пытаясь их пригладить."
    mc "Да уж, без расчёски тут, судя по всему, никак..."
    s 1y "У меня просто волосы непослушные..."
    mc "Меня не проведёшь."
    mc "Дело ведь не только в твоей причёске."
    mc "Смотри, у тебя бант набекрень."
    mc "А ещё пятно от зубной пасты на воротнике."
    "Я попытался вытереть это пятно своим пальцем."
    show sayori at s11
    s "Д-да на это никто даже внимания не обратит..."
    mc "Ещё как обратят."
    mc "Просто никто об этом не скажет, чтобы тебя не смущать."
    mc "Тебе повезло, что меня это совершенно не заботит."
    s 5c "У-у, злюка..."
    mc "И ты даже не застёгиваешь свой пиджак."
    mc "Нет, серьезно, Саёри..."
    mc "Как ты думаешь, почему у тебя всё ещё нет парня?"
    show sayori 1h zorder 2 at t11
    s "Э-э???"
    s "Ты — {i}супер{/i} злюка!"
    mc "Извини, но ты сама меня потом поблагодаришь..."
    "Я начал застёгивать её пиджак снизу вверх."
    mc "Ты сразу поменяешь своё мнение, когда увидишь, насколько лучше станешь выглядеть."
    $ persistent.clear[6] = True
    scene s_cg1
    with dissolve_cg
    s "Хе-хе..."
    s "Как забавно."
    mc "Что именно?"
    s "Ну..."
    s "Я просто подумала, что очень странно иметь друга, который занимается такими вещами."
    mc "А?"
    mc "Т-ты чего?!"
    mc "Ты так заставишь {i}меня{/i} считать это странным, дурочка..."
    s "Но всё ведь хорошо."
    s "Я рада нашим отношениям."
    s "Ты разве нет?"
    mc "А-а..."
    mc "П-пожалуй..."
    s "Эй, осторожнее..."
    s "Пуговица же оторвётся!"
    mc "Почему эту так тяжело застегнуть?.."
    "Мне не удавалось застегнуть пуговицу у её груди."
    mc "Эта вещь вообще твоего размера?"
    s "Хе-хе-хе..."
    s "Ну, когда я её покупала — была."
    mc "Эх..."
    mc "Вот если бы ты хоть иногда застёгивала свой пиджак, то давно бы уже поняла, что он тебе мал."
    mc "Ну чего ты лыбишься?"
    s "Это значит, что у меня снова выросла грудь!"
    mc "Д-да замолчи ты уже!!!"
    s "Хе-хе-хе..."
    mc "В любом случае..."
    mc "Теперь ты выглядишь намного лучше, так что..."
    mc "Ой..."
    "Почему я так странно себя чувствую, когда смотрю на застёгнутый пиджак Саёри?"
    s "Но мне так тесно..."
    s "У-у..."
    s "Это того не стоит!"
    "Саёри торопливо расстегнула свой пиджак."
    scene bg club_day
    show sayori 1q zorder 2 at i11
    with dissolve_cg
    s "Фух!"
    s "Так намного лучше!"
    "Саёри расставила руки в стороны и начала кружиться."
    s 1a "Так что, если я не буду застёгивать пиджак, то у меня не появится парня?"
    mc "Это что ещё за логика?"
    mc "И почему ты говоришь так, будто это что-то хорошее?"
    s "Потому что..."
    s 4h "Если бы у меня был парень, то он не позволил бы тебе делать такие вот вещи!"
    s 4y "Да и всё равно никто лучше тебя обо мне не позаботится..."
    s "Поэтому я не собираюсь его застёгивать!"
    mc "Хватит меня смущать!"
    s 1b "А?"
    s "Я вроде не сказала ничего особенного..."
    mc "Мда..."
    mc "Ладно... В общем, сконцентрируйся на том, чтобы просыпаться пораньше..."
    s 1j "Только если ты сконцетрируешься на том, чтобы пораньше ложиться спать!"
    mc "Ладно, ладно..."
    mc "По рукам."
    s 4q "Хе-хе-хе..."
    s 4x "Получается, что мы и правда заботимся друг о друге лучше, чем о себе."
    mc "Да, получается, что так..."
    s 4y "Поэтому, может, тебе стоит будить меня по утрам?"
    mc "Опять ты за своё, Саёри..."
    s 1h "У-у, я ведь сейчас пошутила!"
    mc "Чёрт, тебя иногда невозможно понять."
    show monika 3b behind sayori at l31
    m "Итак, мальчики и девочки!"
    mc "А?"
    "Нас внезапно окликнула Моника."
    m "Почему бы нам не обменяться написанными стихотворениями?"
    show sayori 4r at h11
    s "Ура-а!"
    s 4x "[player], я так хочу скорее прочитать твоё!"
    mc "А я — твоё..."
    "Изобразить заинтересованность мне не удалось, но Саёри всё равно унеслась за своими стихами."
    show sayori behind monika at thide
    return

label sayori_exclusive_2:
    if not renpy.music.get_playing(channel='music') == audio.t2:
        stop music fadeout 1.0
    scene bg club_day
    with wipeleft_scene
    if not renpy.music.get_playing(channel='music') == audio.t2:
        play music t2
    s "[player], [player]!"
    "Ко мне подскочила Саёри."
    show sayori 1x zorder 2 at t11
    s "Мне нужно забрать кое-какие принадлежности из другого класса."
    s "Пойдёшь со мной?"
    mc "Принадлежности?"
    mc "Для чего?"
    s 2a "Ну, знаешь, фестиваль ведь на носу!"
    s "Мы с Моникой собирались сделать плакаты и всё такое."
    s "Поэтому мне нужно найти мелки, маркеры, клей..."
    mc "А, понятно."
    mc "Конечно, я схожу с тобой."
    s 4q "Ура-а..."
    s 4x "Ладно, Моника, мы ненадолго!"
    show sayori zorder 2 at t22
    show monika 1a zorder 3 at f21
    m "Ой, [player] идёт с тобой за принадлежностями?"
    m "Не напрягайся."
    m "Я сама с ним с радостью схожу."
    show monika zorder 2 at t21
    show sayori 1h at s22
    s "У-у, но я хотела пойти!"
    s "Исследовать пустые классы так весело!"
    show monika zorder 3 at f21
    m 2j "Хе-хе, ладно, ладно."
    m 2a "Я не настаиваю."
    m "Постарайся ещё и ватман найти, хорошо?"
    show monika zorder 2 at t21
    show sayori zorder 3 at f22
    s 1r "О-оке-ей!"
    s 1a "Идём, [player]?"
    mc "Ага."
    scene bg corridor
    show sayori 4a zorder 2 at t11
    with wipeleft_scene
    "Мы вышли из помещения клуба."
    "Саёри что-то напевала и шагала по коридору вприпрыжку, а я следовал за ней."
    "Господи..."
    "Такое чувство, что я веду ребёнка в развлекательный центр."
    "Иногда Саёри находит удовольствие в сущих мелочах."
    mc "Эй, Саёри..."
    mc "А что мы вообще готовим для фестиваля?"
    mc "Даже и не знаю, как из литературы устроить представление..."
    s 1q "Хе-хе-хе!"
    s 1x "У нас с Моникой всё расписано!"
    s "Не пережива-ай..."
    mc "Да?.."
    s "Агась!"
    s "Мы выступим со стихами!"
    mc "Выступим?.."
    mc "Это как?"
    s 1c "Ну..."
    s "Все будут по очереди выходить на сцену..."
    s 1x "И читать свои любимые стихи!"
    mc "О..."
    mc "Звучит..."
    "...Как-то отстойно?"
    s 1h "[player]!"
    s "Ты совершенно ничего не понимаешь!"
    s "Мы ведь не просто будем читать стихи..."
    s 1x "Это будет целое шоу!"
    s "Вот ты, например, так зачитываешь строки..."
    s 2j "{i}У ног моих...{/i}"
    s "{i}Взывал ко мне цветок, оставшийся последним.{/i}"
    s 1c "{i}Свернул его я стебель, от корней освободил...{/i}"
    s "{i}Лелею бережно его последние мгновенья.{/i}"
    s 3g "{i}Но для чего ему сию я радость подарил?{/i}"
    s "{i}Куда бы ныне я ни кинул взор...{/i}"
    s 1j "{i}То поле, что когда-то благодатным было...{/i}"
    show sayori at h11
    s 4m "{i}Теперь лишь пустошь, жизни лишено!{/i}"
    s "..."
    s 1r "Типа вот так!!!"
    mc "Саёри..."
    "Как бы это сказать..."
    mc "Уверен, что дело во мне, но я совершенно не могу воспринимать тебя всерьёз, когда ты так разговариваешь..."
    show sayori 5c at s11
    s "Что-о-о?"
    s "Злюка!"
    s "Сам знаешь, я очень упорно над этим работаю!"
    mc "Да знаю я, знаю!"
    mc "Просто это создаёт необычный контраст с твоей милой стороной."
    show sayori 4s zorder 2 at t11
    s "Ха-ха-ха! Ну чего ты, я же стесняюсь!"
    s 4y "Но, наверное, это значит, что у меня получается..."
    mc "Да, пожалуй..."
    show sayori at h11
    s 4r "А-а-ах, я так взбудоражена!"
    s "Фестиваль будет таким классным..."
    "Саёри снова начала кружиться, теперь уже в коридоре."
    s 1x "О, [player], этот класс вроде пустой!"
    s "Давай начнём нашу миссию!"
    show sayori zorder 1 at thide
    hide sayori
    mc "Миссию, да?.."
    "Я уже очень давно вот так не проводил время с Саёри."
    "Но, в конце концов, она ни капельки не изменилась."
    "Она так и осталась просто комочком света, впитывающим всё положительное из окружающего мира."
    "Такая ностальгия..."
    "С каждым годом я проводил всё меньше и меньше времени вне своей комнаты."
    "Поэтому такие вот приключения с Саёри вызывали у меня особые чувства, о существовании которых я уже забыл."
    scene bg class_day
    with wipeleft_scene
    "Мы зашли в класс."
    "Саёри отправилась прямиком к кладовке. Я пошёл за ней."
    show sayori 1b zorder 2 at t11
    s "Так, что тут у нас..."
    s 4x "Мелки!!!"
    "Саёри сняла с полки коробку, полную мелков."
    s "О, ещё и лучшей марки!"
    s 1b "Грязноватые, правда..."
    "Саёри начала вытягивать из коробки разные мелки и читать названия цветов."
    mc "Так, с этим разобрались."
    mc "Не отвлекайся, нам ещё нужно найти..."
    s 1a "Подожди, я ищу свой любимый цвет..."
    mc "Хорошо..."
    mc "Тогда хотя бы отойди, чтобы я мог поискать ватман."
    s 1b "Ой, я один уронила случайно..."
    play sound "sfx/smack.ogg"
    show white zorder 4:
        alpha 0.6
        linear 0.25 alpha 0.0
    show sayori 2p at h11
    "{i}Бам!{/i}"
    hide white
    s "А-а-а!"
    "Саёри наклонилась и метко стукнулась лбом о полку."
    "Она упала на пол, и мелки посыпались на неё."
    show sayori 4p at s11
    s "Ой-ой-ой..."
    mc "Ты как, в порядке?"
    s "Мой лобик..."
    "Саёри держалась за свой лоб."
    mc "Мда, Саёри..."
    mc "Это прям в твоём репертуаре."
    mc "Дай посмотрю."
    "Так как Саёри всё ещё сидела на полу, я обхватил её за талию и вытащил из кладовки."
    mc "Тебе придётся убрать руки, Саёри..."
    s 4g "Но больно же..."
    mc "Всего на секундочку."
    $ persistent.clear[7] = True
    scene s_cg2_base1
    show s_cg2_exp2
    with dissolve_cg
    "Саёри медленно отпустила свой лоб."
    "Я бережно отодвинул её чёлку."
    show s_cg2_exp1 at cgfade
    show s_cg2_exp3 at cgfade
    s "Ауч!"
    mc "Извини..."
    "Посреди её лба красовалось огромное красное пятно."
    "А заодно и начинала набухать шишка."
    mc "У, большая будет."
    mc "Надо приложить лёд..."
    hide s_cg2_exp3
    hide s_cg2_exp1
    s "[player]..."
    mc "Где я вообще сейчас найду лёд?.."
    mc "О, можно обойтись холодным напитком..."
    s "Не надо!.."
    show s_cg2_exp2 at cgfade
    hide s_cg2_exp2
    s "Я не против... Быть похожей на единорога..."
    "Саёри умудрялась отпускать дурацкие шуточки, даже корчась от боли."
    mc "Ха-ха-ха, ты о чём вообще?"
    mc "Я быстро, окей?"
    s "А-ага..."
    stop music fadeout 1.0
    scene bg corridor with wipeleft_scene
    "Я легонько хлопнул Саёри по плечу и выбежал в коридор."
    "Нашёл ближайший торговый автомат."
    mc "Что бы взять?.."
    "Это было не так уж и важно, ведь этот напиток будет применяться не по назначению, а в качестве пакета со льдом."
    "Однако я знал, что Саёри нравится яблочный сок, поэтому его и купил."
    "Саёри и глазом моргнуть не успела, как я уже вернулся в класс, где её оставил."
    scene s_cg2_base1
    show s_cg2_exp2
    with wipeleft_scene
    play music t9
    "Она держала одну руку на лбу, а второй неуклюже пыталась собрать мелки обратно в коробку."
    s "Ну, по крайней мере, они были не на своих местах ещё до того, как я их рассыпала..."
    mc "Держи."
    show s_cg2_base2 behind s_cg2_exp2 at cgfade
    "Я отдал Саёри бутылку яблочного сока."
    show s_cg2_exp2 at cgfade
    hide s_cg2_exp2
    s "Какой холодный, классно..."
    "Саёри открыла крышку и начала пить."
    mc "Ты что творишь?!"
    mc "Это ж для твоего лба, дурочка!"
    show s_cg2_exp3 at cgfade
    s "Ой..."
    s "Извини я забы-ы-ыла..."
    s "Ха-ха-ха!"
    mc "Это ж как сильно надо было удариться?.."
    "Саёри приложила бутылку к шишке на своём лбу."
    show s_cg2_exp1 at cgfade
    s "Колет..."
    mc "Потерпи, скоро полегчает."
    mc "Я смотрю, ты уже почти собрала мелки. Это хорошо."
    hide s_cg2_exp1
    hide s_cg2_exp3
    s "Эй, [player]..."
    s "Всё это заставляет задуматься о взрослении, скажи?.."
    mc "А? Ты о чём?"
    s "Помнишь, как мы раньше гуляли вместе?.."
    s "Я постоянно пыталась за тобой угнаться."
    s "Ты иногда не замечал ничего вокруг..."
    s "Например, я обычно отставала от тебя и не могла забраться в места, куда забирался ты..."
    s "А иногда пыталась делать вещи, на которые была не способна, а в результате...."
    s "Падала, получала царапины, набивала шишки..."
    s "А потом начинала громко-громко плакать."
    show s_cg2_exp3 at cgfade
    s "Ха-ха-ха!"
    s "А ты тут же спешил мне на помощь."
    hide s_cg2_exp3
    s "Делал всё, что мог, лишь бы я перестала плакать."
    s "Ты будто во всём винил себя и боялся, что тебе достанется, если кто-то узнает..."
    s "Хотя твоей вины, в общем-то, и не было."
    mc "Я что, и правда так себя вёл?.."
    s "Ага... Ты не помнишь?"
    mc "Если подумать, то, может, и помню немного..."
    mc "Пожалуй, я был настолько сконцентрирован на своих играх, что не уделял тебе достаточно внимания."
    mc "Так что какая-то часть вины всё-таки лежит на мне."
    mc "Как, к слову, и в этот раз..."
    mc "Если бы я не поторапливал тебя выбираться из кладовки, ты бы, может, и не ударилась головой."
    s "[player]..."
    s "Не уверена, что ты это замечаешь, но ты постоянно думаешь о других."
    s "Как будто и не было всех этих лет..."
    s "Ты торопишься мне на помощь, даже несмотря на то, что я лишь проявила свою неуклюжесть."
    show s_cg2_exp3 at cgfade
    s "Ты такой душка..."
    mc "Н-не называй меня так!"
    mc "Да и я не постоянно так себя веду..."
    mc "В случае с тобой это... как бы само собой разумеется."
    mc "Моё отношение к тебе — подсознательное."
    mc "Наверное, так вышло из-за того, что мы так долго дружим."
    hide s_cg2_exp3
    s "Правда?.."
    s "Может, ты и прав..."
    s "[player]..."
    s "Я рада, что между нами ничего не меняется."
    s "Как думаешь, это продлится вечно?"
    mc "Вечно?.."
    "Если рассуждать здраво..."
    "То нельзя даже предсказать, в какие колледжи мы попадём, и что будет после этого."
    "Так что было бы нечестно с моей стороны давать какие-либо обещания."
    "Однако..."
    mc "Ну, я надеюсь на это."
    mc "Ведь уже так много времени прошло, правильно?"
    mc "Даже представить не могу, что ты когда-то изменишься, так что мой прогноз позитивен."
    s "Я так рада..."
    "В глазах Саёри мелькали шаловливые огоньки."
    "Несколько секунд мы молча смотрели друг на друга."
    "Внешне она такая глупенькая и неуклюжая, что когда я вижу её такой задумчивой..."
    "Мне не хочется её беспокоить."
    s "Думаю, нам стоит возвращаться..."
    s "Не хотелось бы заставлять Монику волноваться."
    mc "Ну, удачи тебе с этим."
    mc "Она ведь всё равно увидит твой лоб."
    s "Не увидит, если я спрячу его под чёлкой!"
    play music t8 fadeout 1.0
    scene bg class_day
    show sayori 1a zorder 2 at i11
    with dissolve_cg
    "Саёри вскочила на ноги."
    show sayori 4p at s11
    s "А-а-ай!"
    "Она снова схватилась за лоб."
    mc "Кто же дёргается сразу после того, как ударился?"
    s "У-у..."
    mc "Что уж теперь сделаешь..."
    mc "В общем, идём."
    scene bg corridor
    with wipeleft_scene
    "Я вышел из класса вслед за Саёри."
    "Она безуспешно пыталась прикрыть своей чёлкой шишку."
    "Мы и оглянуться не успели, как уже стояли у двери клуба."
    scene bg club_day
    show sayori 1a zorder 2 at t21
    show monika 1b zorder 2 at t22
    with wipeleft_scene
    show monika zorder 3 at f22
    m "О, вы вернулись!"
    m "Очень вовремя. Я как раз собиралась начать обмен стихами."
    m 1d "А? Саёри, твой лоб..."
    show monika zorder 2 at t22
    mc "С ней всё в порядке, не пережива..."
    show sayori 4r zorder 3 at f21
    s "Я игралась с мелками и ударилась головой о полку!"
    show sayori zorder 2 at t21
    mc "..."
    show monika 3m zorder 3 at f22
    m "..."
    m 3l "Эм... ладно!"
    m 1a "Вам удалось найти всё необходимое?"
    show monika zorder 2 at t22
    show sayori 1x zorder 3 at f21
    s "Ага! Вот о..."
    s 1n "...Ой."
    "Саёри стала отчаянно осматриваться."
    show sayori 4m zorder 3 at hf21
    s "Я... Я всё забыла!!!"
    show sayori zorder 2 at t21
    mc "Успокойся, Саёри."
    mc "Все вещи у меня."
    mc "Я заодно нашёл и ватман."
    show sayori 4b
    show monika 5a zorder 3 at f22
    m "Ха-ха-ха!"
    m "Судя по твои словам, в итоге всю работу сделал ты, [player]."
    show monika zorder 2 at t22
    mc "Ну, Саёри, она..."
    "Я не смог придумать оправдания для Саёри."
    show sayori 1q zorder 3 at f21
    s "Я вносила приключенческий элемент!"
    show sayori 1a zorder 2 at t21
    mc "Вот, точно."
    show monika 1j zorder 3 at f22
    m "Ха-ха, хорошо, хорошо."
    m 1a "В любом случае, хорошая работа!"
    m "Я займусь плакатами уже сегодня вечером."
    show monika zorder 2 at t22
    show sayori 4x zorder 3 at f21
    s "И я!"
    show monika zorder 2 at t11
    show sayori behind monika at thide
    hide sayori
    m 4b "Итак, мальчики и девочки!"
    m "Вы готовы обмениваться стихами?"
    mc "Пойду возьму свой, пожалуй..."
    "Проверив, чтобы коробка с мелками была плотно закрыта, я вернулся к своему месту."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
