

label ch1_main:
    scene bg club_day
    with dissolve_scene_half
    play music t2
    show monika 5 zorder 2 at t11

    m "Здравствуй ещё раз, [player]!"
    m "Приятно видеть, что ты не сбежал от нас. Хахаха!"
    mc "Хех, не беспокойся."
    mc "Пусть это и странно для меня, но я, по крайней мере, держу своё слово."
    show monika zorder 1 at thide
    hide monika
    "Что ж, я вернулся в Литературный Клуб."
    "Я был последним, кто пришёл, поэтому остальные, похоже, уже на своих местах."
    show yuri 1a zorder 2 at t32
    y "Спасибо за то, что держишь обещание, [player]."
    y "Надеюсь, это не слишком обременяюще для тебя."
    y 1u "Затягивать тебя с головой в литературу, когда ты к ней ещё толком не привык..."
    show natsuki 4e zorder 2 at t33
    n "О, да ладно тебе! Как будто он заслуживает поблажку."
    n "Сайори говорила мне, что в этом году ты вообще не хотел вступать в какой-либо клуб."
    n "И в предыдущем году тоже!"
    n 4c "Не знаю, пришёл ты сюда дурака повалять или что ещё..."
    n "Но если не станешь относиться к этому серьёзно, тогда ты не увидишь здесь счастливого конца."
    show monika 2b at l41
    m "Нацуки, ты слишком много говоришь для той, кто держит в клубной комнате свою коллекцию манги."
    n 4o "М-M-M...!!"
    show monika at lhide
    hide monika
    "Нацуки замешкалась между словами \"Моника\" и \"Манга\"."
    show natsuki at h33
    n 1v "Манга -- тоже литература!!"
    show natsuki zorder 1 at thide
    hide natsuki
    "Будучи побеждённой, Нацуки шлепнулась обратно на своё место."
    show yuri zorder 2 at t22
    show sayori 2x zorder 3 at f21
    s "Не волнуйтесь, ребята~"
    s "[player] всегда показывал себя с лучшей стороны."
    s "Он помогал мне с повседневными делами, даже если я и не просила."
    s "Например, готовил, убирался в моей комнате..."
    show sayori 2a zorder 2 at t21
    show yuri zorder 3 at f22
    y 2m "Какой заботливый..."
    show yuri zorder 2 at t22
    mc "Сайори, это всё потому, что твоя комната -- обитель беспорядка, и это отвлекает."
    mc "И ты чуть не спалила свой дом однажды."
    show sayori at s21
    s 5 "Может быть, и так... Хехе..."
    show yuri zorder 3 at f22
    y 1s "Вы двое и правда хорошие друзья, не так ли?"
    y "Я даже немного ревную..."
    show yuri zorder 2 at t22
    show sayori zorder 3 at f21
    s 1 "С чего бы? Ты и [player] тоже можете стать прекрасными друзьями!"
    show sayori zorder 2 at t21
    show yuri zorder 3 at f22
    y 4b "У-Угу..."
    show yuri zorder 2 at t22
    mc "С-Сайори--"
    show sayori zorder 3 at f21
    s "Ммм?"
    show sayori zorder 2 at t21
    mc "..."
    "Как всегда, Сайори, похоже, даже не понимает, что вовлекла меня в неловкую ситуацию."
    show sayori zorder 3 at f21
    s 4x "О, о! Юри даже принесла тебе сегодня кое-что, знаешь~"
    show sayori zorder 2 at t21
    show yuri zorder 3 at f22
    y 3n "П-подожди! Сайори..."
    show yuri zorder 2 at t22
    mc "Э? Мне?"
    show yuri zorder 3 at f22
    y 3o "Эм... Не совсем..."
    show yuri zorder 2 at t22
    show sayori zorder 3 at f21
    s 4r "Ну не стесняйся~"
    show sayori zorder 2 at t21
    show yuri zorder 3 at f22
    y "Это и правда ерунда..."
    show yuri zorder 2 at t22
    mc "И что же это?"
    show yuri zorder 3 at f22
    y 4c "Н-неважно!"
    y "Сайори раздувает из мухи слона..."
    y "Уууух, что же делать..."
    show yuri zorder 2 at t22
    show sayori zorder 3 at f21
    s 1g "Ээ? Прости, Юри, я не подумала..."
    show sayori zorder 1 at thide
    hide sayori
    show yuri zorder 2 at t11
    "Видимо, мне придётся спасать ситуацию..."
    mc "Эй, не волнуйся об этом."
    mc "Прежде всего, я ничего и не ждал."
    mc "Поэтому любой добрый жест от тебя -- это приятный сюрприз."
    mc "Я буду рад в любом случае."
    y 3v "Е-Если так..."
    mc "Угу. Я не буду слишком беспокоиться об этом, если ты не хочешь."
    y "Ладно..."
    y 1a "Что ж, вот."
    "Юри достаёт из сумки книгу."
    y "Я не хотела, чтобы ты почувствовал себя брошенным..."
    y "Поэтому я выбрала книгу, которая может тебе понравиться."
    y "Это короткое чтиво, поэтому оно должно удержать твое внимание, даже если ты не часто читаешь."
    y "И мы могли бы, ну, знаешь..."
    show yuri at sink
    y 4b "Обсудить её... если хочешь..."
    "Э-это..."
    "Как у этой девушки получается быть такой милой?"
    "Она даже взяла с собой книгу, которая, по её мнению, может понравиться мне, несмотря на то, что читаю я не так много..."
    mc "Юри, спасибо тебе! Я обязательно прочитаю её!"
    "Я с энтузиазмом схватил книгу."
    show yuri 2m zorder 2 at t11
    y "Фух..."
    y 2a "Что ж, ты можешь читать её в своем темпе."
    y "Буду ждать твоего мнения."
    show yuri zorder 1 at thide
    hide yuri


    "Теперь, когда все расположились на своих местах, я ожидал, что Моника начнет с деятельности клуба."
    "Но, похоже, этого не будет."
    "Сайори и Моника активно обсуждают что-то в углу."
    "А Юри уже погрузилась с головой в книгу."
    "Я заметил, как интенсивно она увлеклась этим, будто бы ждала этой возможности."
    "А Нацуки тем временем рылась в шкафу."

    $ nextscene = poemwinner[0] + "_exclusive_" + str(eval(poemwinner[0][0] + "_appeal"))
    call expression nextscene from _call_expression_2


    show monika 1 zorder 2 at t21
    hide sayori
    hide natsuki
    hide yuri
    m "Кстати говоря, вы не забыли прошлым вечером написать поэму?"
    mc "А-ага..."
    "Моему отдыху пришёл конец."
    "Не могу поверить, что я согласился сделать что-то настолько смущающее."
    "Я не смог достаточно вдохновиться, поскольку никогда не занимался подобным раньше."
    m "Что ж, раз уж все готовы, почему бы вам не поделиться ими?"
    show sayori 4q zorder 2 at t22
    s "Не могу дождаться~!"
    show sayori zorder 1 at thide
    show monika zorder 1 at thide
    hide sayori
    hide monika
    "Сайори и Моника с энтузиазмом достали свои поэмы."
    "Поэма Сайори была на помятом листе, вырванном из тетради на пружинке."
    "С другой же стороны, Моника написала свою в тетради для сочинений."
    "Я уже вижу её аккуратный почерк со своего места."
    "Нацуки и Юри нехотя начали копаться в своих рюкзаках."
    "Я сделал то же самое."

    return


label ch1_end:
    stop music fadeout 1.0
    scene bg club_day
    with wipeleft_scene
    play music t3
    mc "Фух..."
    "Думаю, это все."
    "Я оглядел комнату."
    "Кажется, это немного более напряженно, чем я ожидал."
    "Как если бы все начали обвинять меня в моих несомненно посредственных писательских навыках..."
    "Даже если они и будут относиться ко мне с пониманием, нет никаких шансов, что мои поэмы смогут соперничать с их."
    "Это ведь Литературный Клуб, как никак."
    "Я вздыхаю."
    "Полагаю, я сам позволил себя в это втянуть."
    "В другом конце комнаты Сайори и Моника счастливо болтали."
    "Мой взгляд упал на Юри и Нацуки."
    show yuri 2g zorder 2 at t21
    show natsuki 1g zorder 2 at t22
    "Они робко обменялись листами бумаги со своими поэмами."
    show yuri 2i at t21
    "В то время как они читали, я наблюдал за каждым изменением выражения их лиц."
    "Нацуки расстроенно опустила брови."
    "В то же время, Юри улыбалась с грустью."
    show natsuki zorder 3 at f22
    n 1q "{i}(Что это за стиль такой...?){/i}"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 2f "М?"
    y "Эм... ты что-то сказала?"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 2c "Оу, да ничего."
    "Нацуки пренебрежительно одной рукой положила поэму на стол."
    n "Полагаю, можно сказать, что это довольно причудливо."
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 2i "Ээ-- Спасибо..."
    y "А твоя... милая..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 2h "Милая?"
    n 1h "Ты полностью проглядела символичность или что?"
    n "Явно же, что речь о чувстве обреченности."
    n "Как это может быть милым?"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 3f "Я-я поняла это!"
    y "Я просто имела в виду..."
    y 3h "Этот стиль, я считаю..."
    y "Я просто пыталась сказать что-то приятное..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n "Э?"
    n 4w "Хочешь сказать, что тебе пришлось настолько потрудиться, чтобы сказать что-то приятное?"
    n "Спасибо, но в итоге вышло не очень-то приятно!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 1i "Эм..."
    y "Ну, у меня есть парочка советов..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 5x "Хмпф."
    n "Если бы я искала совета, то спросила бы кого-то, кому на самом деле понравилось."
    n "А такие {i}есть{/i}, кстати говоря."
    n 5e "Сайори понравилось."
    n "И [player] тоже её оценил!"
    n "Поэтому, я сама с радостью дам тебе несколько советов."
    n "Для начала--"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 2l "Прошу прощения..."
    y "Я ценю твое предложение, но я потратила много времени для создания и закрепления своего стиля."
    y 2h "И я не собираюсь изменять его в ближайшее время, если, конечно, не найду нечто особенно вдохновляющее."
    y "Чего пока не случилось."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1o "Нх...!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 1k "И мою поэму [player] тоже высоко оценил."
    y "Он даже сказал, что был ей впечатлен."
    stop music fadeout 1.0
    "Нацуки резко вскочила."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 4y "Оо?"
    n "Я и не заметила, что ты настолько хочешь впечатлить нашего нового участника, Юри."
    play music t7
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 1n "Э-Ээ?!"
    y "Это не то, что я...!"
    y 1o "Уу..."
    y "Ты... ты просто..."
    "Юри также вскочила."
    y 2r "Может, тебе просто завидно, что [player] ценит моё мнение больше, чем твоё!"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1e "Хаа! И с чего ты решила, что он не ценит {i}моё{/i} мнение больше?"
    n "Настолько самоуверенна?"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 3h "Я...!"
    y "Нет..."
    y "Если бы я была самоуверенна..."
    y 1r "...Я бы осознанно из кожи вон лезла, чтобы делать всё, что я делаю, чересчур милым!"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1o "Ууууу...!"
    show sayori 2l behind yuri, natsuki at l41
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    s "Э-эм!!"
    s "Всё в порядке...?"
    show sayori 2 at lhide
    hide sayori
    show natsuki zorder 3 at f33
    n 1f "Ладно, знаешь что?!"
    n "По крайней мере, я не та, чья грудь магически выросла на размер с тех пор, как [player] начал ходить сюда!!"
    show yuri 3p at h32
    show natsuki zorder 2 at t33
    y "Н-Нацуки!!"
    show monika 3l behind yuri, natsuki at l41
    m "Эм, Нацуки, это немного--"
    show monika at h41
    show yuri 3p zorder 3 at f32
    show natsuki 1e zorder 3 at f33
    ny "Тебя это не касается!"
    show monika at lhide
    hide monika
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    show sayori 4p behind yuri, natsuki at l41
    s "М-мне не нравятся ссоры, ребята...!"
    show sayori at lhide
    hide sayori
    show yuri zorder 2 at t21
    show natsuki 1g zorder 2 at t22
    "Вдруг обе девушки внезапно повернулись ко мне, как если бы они только что заметили, что я стою здесь."
    show yuri zorder 3 at f21
    y 2n "[player]...!"
    y "Она-- Она просто пытается выставить меня в дурном свете...!"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 4w "Это не правда!"
    n "Это она начала!"
    n 4e "Если бы она смогла преодолеть себя и научиться ценить этот {i}простой{/i} стиль..."
    n "То всего этого бы вообще не произошло!"
    n "Какой смысл делать свои поэмы запутанными без причины?"
    n "Смысл должен сам дойти до читателя, не нужно заставлять искать его."
    n 1f "Помоги мне объяснить это ей, [player]!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 3o "П-подожди!"
    y "У нас есть повод использовать такие глубокие и выразительные слова в нашей речи!"
    y 3w "Это единственный способ передать комплекс чувств и смыслов наиболее эффективно."
    y "Избегать их -- не только бесполезное ограничение себя самого... но и просто расточительно!"
    y 1t "Ты ведь понимаешь, так, [player]?"
    show yuri zorder 2 at t21
    mc "Эм...!"
    show yuri 1t zorder 3 at f21
    show natsuki 1e zorder 3 at f22
    ny "Ну и??"
    mc "..."
    show yuri zorder 2 at t21
    show natsuki 1g zorder 2 at t22
    "Как я вообще оказался втянут в этот конфликт?!"
    "Не то чтобы я что-то понимал в писательстве..."
    "Но та, с кем я соглашусь, будет лучшего обо мне мнения!"
    menu:
        "Поэтому, конечно же, это будет...!"
        "Нацуки.":
            call ch1_end_natsuki from _call_ch1_end_natsuki
        "Юри.":
            call ch1_end_yuri from _call_ch1_end_yuri
        "Помоги мне, Сайори!!":
            call ch1_end_sayori from _call_ch1_end_sayori

    scene bg club_day
    show monika 4b zorder 2 at t11
    with wipeleft_scene
    m "Ладно, ребята!"
    m "Похоже, время расходиться."
    m "Как ощущения от обмена поэмами?"
    show monika 4a
    show sayori 4x zorder 2 at t31
    s "Это было очень весело!"
    show sayori behind yuri at thide
    show yuri 1i zorder 2 at t31
    hide sayori
    y "Что ж, скажу, что оно того стоило."
    show yuri behind natsuki at thide
    show natsuki 4q zorder 2 at t31
    hide yuri
    n "Было неплохо. Ну, в основном."
    show natsuki zorder 1 at thide
    hide natsuki
    m 1a "[player], что насчёт тебя?"
    mc "...Да, я тоже так считаю."
    mc "Было приятно обсудить это со всеми вами."
    m 1j "Здорово!"
    m 1a "В таком случае, повторим завтра."
    m "И, может быть, ты научишься чему-нибудь от твоих друзей."
    m 3b "И тогда твои поэмы станут ещё лучше!"
    mc "..."
    show monika zorder 1 at thide
    hide monika
    "Я задумался."
    "Я узнал немного больше о том, какого рода поэмы нравятся каждому."
    "С толикой удачи я, по крайней мере, смогу впечатлить тех, кого захочу."
    "Подбодрил я себя новоприобретенной решимостью."
    show sayori 1x zorder 2 at t11
    s "[player]!"
    s "Готов идти домой?"
    mc "Конечно, пойдём."
    s 4q "Эхехе~"
    "Сайори лучезарно мне улыбнулась."
    "Прошло действительно много времени с тех пор, когда я и Сайори проводили столько времени вместе."
    "Не сказать, чтобы мне это не нравилось."
    scene bg residential_day
    show sayori 1a zorder 2 at t11
    with wipeleft_scene
    mc "Сайори..."
    mc "Насчёт произошедшего ранее..."
    s 1b "Мм? Ты о чем?"
    mc "Ну знаешь, между Юри и Нацуки."
    mc "Подобное часто происходит?"
    s 4j "Нет, что ты, нет!"
    s "Это и правда первый раз, когда они так сцепились..."
    s "Я клянусь, они обе -- прекрасные люди."
    show sayori at s11
    s 1g "Ты ведь не... Ты ведь не ненавидишь их??"
    mc "Нет, конечно я их не ненавижу!"
    mc "Я просто хотел услышать твое мнение, вот и всё."
    mc "Я понимаю, почему ты так сружилась с ними."
    show sayori zorder 2 at t11
    s 1d "Фух..."
    s "Знаешь, [player]..."
    s "Это прекрасно, что я могу проводить время с тобой в клубе."
    s "Но я считаю, что видеть то, как ты проводишь время со всеми, делает меня гораздо счастливее."
    s 1x "И думаю, что остальным ты тоже нравишься!"
    mc "Это--!"
    s 4q "Эхехе~"
    s "Каждый день будет таким веселым~"
    mc "Эх..."
    "Похоже, Сайори всё ещё не поняла, в какой ситуации я оказался."
    "Конечно, дружить со всеми -- это прекрасно, но..."
    "...Действительно ли нужно на этом останавливаться?"
    mc "Что ж, как знать, что уготовило нам будущее, Сайори."
    "Я похлопал её по плечу."
    "Я больше сказал это самому себе, нежели ей, но использовать Сайори для душевного монолога всегда было легко."
    show sayori at h11
    s 1x "Хорошо~!"
    "Ага..."
    "Сделаем это!"
    return

label ch1_end_natsuki:
    $ ch1_choice = "natsuki"
    stop music fadeout 1.0
    mc "Эм..."
    mc "Юри!"
    mc "Ты действительно талантлива."
    show yuri 4a at s21
    y "Э? Т-Тогда..."
    play music t8
    mc "Но Нацуки права!"
    mc "Я считаю так..."
    show yuri zorder 2 at t21
    "Я напряг голову, пытаясь собраться с мыслями."
    mc "Я считаю, что передать чувства, используя лишь несколько слов..."
    mc "Действительно впечатляюще!"
    mc "Это даёт волю воображению читателя."
    mc "И поэма Нацуки действительно хорошо с этим справилась!"
    show natsuki zorder 3 at f22
    n 5y "...Да!!"
    n "И правда ведь?!"
    n "Хаха!"
    n "Это показывает, как много {i}ты{/i} знаешь!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 4b "Э-это не..."
    show yuri zorder 2 at t21
    mc "Нацуки..."
    mc "Я думаю, хватит уже."
    show natsuki zorder 3 at f22
    n 1m "Хаа?"
    n "Я?"
    n "Но это она мне тут нагрубила...!"
    "Голос Нацуки стал истеричным."
    show natsuki zorder 2 at t22
    mc "Послушай..."
    mc "То, о чем мы говорили вчера, было верным."
    mc "Писательство и правда очень личная вещь."
    mc "И делиться этим с кем-то может быть трудно."
    mc "Похоже, мы уяснили это сегодня."
    mc "Даже небольшая критика может привести к чему-то серьёзному."
    "Я глянул за своё плечо."
    "Сайори одобрительно кивала."
    mc "Да, поэтому..."
    mc "Не считай, что тебя пытаются обидеть."
    mc "Ты прекрасный писатель, Нацуки."
    show natsuki zorder 3 at f22
    n 1h "А--"
    "Нацуки звучит удивлённой."
    n 1q "...Спасибо за признание."
    "Наконец, пробормотала она, едва слышно."
    show natsuki zorder 2 at t22
    mc "Юри..."
    show yuri zorder 3 at f21
    y 4a "...?"
    "Юри подавленно смотрела на меня."
    "Глядя на неё, я ничего не мог сделать, мне стало очень жалко её."
    show yuri zorder 2 at t21
    mc "Я уверен, что Нацуки не хотела такого сказать."
    mc "Поэтому, тебе тоже не стоит обижаться."
    show yuri zorder 3 at f21
    y 2v "Что ж..."
    y "Если ты так говоришь..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1g "Эй...!"
    n "Тебе не нужно извиняться {i}за{/i} меня, [player]."
    n 1w "Фууух."
    "Нацуки перевела дух."
    n 1q "Я..."
    n "Насчёт..."
    n "Уу..."
    "Нацуки оглядела комнату."
    show natsuki zorder 3 at hf22
    n 1x "{i}Может, прекратите пялиться на меня, вы все??{/i}"
    "Не удивительно, Нацуки сложнее справляться с этим, нежели она считала."
    "Сайори и Моника отвели взгляд."
    show natsuki zorder 3 at f22
    n 1i "Хмпф."
    n "Короче...!"
    n 1q "Насчёт твоей груди. Я не это имела в виду, ладно?"
    n "На этом всё."
    "Нацуки отвернулась, избегая зрительного контакта с кем-либо."
    show natsuki zorder 2 at t22
    show sayori 4x behind yuri at l41
    s "Да! Ты безусловно красивая, Юри!!"
    mc "Сайори?!"
    show yuri 4c zorder 3 at f21
    y "..."
    y "Я-я пойду сделаю чаю..."
    show yuri at lhide
    hide yuri
    show sayori zorder 3 at f41
    s 4h "Ээээ?"
    s "Я просто пыталась помочь!"
    show sayori zorder 2 at t41
    mc "Я уверен, что она ценит это, Сайори."
    "Я похлопал её по плечу."
    show sayori zorder 1 at thide
    show natsuki zorder 1 at thide
    show monika 4m zorder 2 at t11
    hide sayori
    hide natsuki
    m "Итак, теперь когда с этим разобрались..."
    m 4b "Все прочитали поэмы друг друга, так?"
    m "Надеюсь, для каждого это бы ценный опыт!"
    m 5 "Особенно для тебя, [player]!"
    m "И, честно говоря..."
    m "Это изменение к лучшему, а то мы привыкли тут без дела сидеть."
    m "Ахахаха!"
    mc "Значит, моё вступление в клуб ответственно за разрушенную атмосферу..."
    m 1d "Нет, вовсе нет, ты не прав!"
    m "У нас ещё осталось время до ухода домой."
    m 1a "Поэтому, думаю, нам всем можно немного расслабиться."
    m "Разумеется, кроме болтовни, мы занимаемся делами, связанными с литературой в клубе..."
    m "Поэтому, ты можешь можешь воспользоваться ситуацией и выбрать какую-нибудь книгу, или заняться писательством."
    m 1b "В конце концов, для этого клуб и предназначен."
    show sayori 2j zorder 3 at f31
    s "Моника, я не согласна!"
    show sayori zorder 2 at t31
    show monika zorder 3 at f32
    m 1d "Ээ? С чем?"
    show monika zorder 2 at t32
    show sayori zorder 3 at f31
    s 2i "Это не самая важная вещь в Литературном Клубе!"
    s "Самая важная вещь..."
    show sayori 4r zorder 3 at hf31
    s "Это веселиться!"
    show sayori zorder 2 at t31
    show monika zorder 3 at f32
    m 2l "Ахаха, конечно..."
    m 2a "Что ж, полагаю, поэтому ты и вице-президент, Сайори."
    show monika zorder 2 at t32
    show sayori zorder 3 at f31
    s 4q "Эхехе..."
    hide sayori
    hide monika
    with wipeleft
    "В конце концов, всё-таки, Моника права."
    "Будучи в Литературном Клубе, я теперь не смогу просто тратить своё время впустую."
    "Но в итоге..."
    "...Думаю, это того стоило."
    return

label ch1_end_yuri:
    $ ch1_choice = "yuri"
    stop music fadeout 1.0
    mc "Нацуки."
    mc "Ты права, мне действительно понравилась твоя поэма."
    show natsuki zorder 3 at f22
    n 1e "Видишь??"
    show natsuki 1g zorder 2 at t22
    play music t8
    mc "Подожди!"
    mc "Но это не оправдание, чтобы вести себя так грубо!"
    mc "Ты не должна развязывать конфликт только потому, что чьё-то мнение расходится с твоим."
    show natsuki zorder 3 at f22
    n 1m "Не в этом суть!"
    n "Юри даже не восприняла мою поэму всерьёз!"
    show natsuki zorder 2 at t22
    mc "Мм..."
    mc "Я понимаю."
    mc "Юри."
    show yuri zorder 3 at f21
    y 2t "Э?"
    show yuri zorder 2 at t21
    mc "Ты действительно талантливый писатель."
    mc "И это не секрет, что я был впечатлен."
    show yuri zorder 3 at f21
    y 2u "Ч-Что ж, тогда..."
    show yuri zorder 2 at t21
    mc "Но есть ещё кое-что."
    mc "Не важно, насколько прост или изыскан чей-то стиль..."
    mc "Они всё ещё вкладывают в это свои чувства, и это становится чем-то действительно личным."
    mc "Вот почему Нацуки почувствовала себя обиженной, когда ты сказала, что её поэма милая."
    show yuri zorder 3 at f21
    y 2v "Я... поняла..."
    y "Я и не заметила, что я..."
    show yuri zorder 2 at t21
    y 2w "П-прости меня..."
    show yuri at s21
    y "Ууу..."
    show natsuki zorder 2 at t11
    show yuri zorder 1 at thide
    hide yuri
    mc "Но, Нацуки, ты зашла слишком далеко!"
    mc "Юри не имела в виду ничего плохого, и если бы ты просто рассказала ей, что ты чувствуешь..."
    mc "То всего этого не произошло бы вовсе."
    n 1e "Ты шутишь?"
    n "Я именно так и сделала!"
    n "Это {i}она{/i} всё--"
    show natsuki zorder 2 at t22
    show monika 2i zorder 3 at f21
    m "Нацуки, хватит уже."
    m "Вы оба наговорили вещей, которых не стоило говорить."
    m "Юри извинилась. Не думаешь ли, что тебе бы тоже стоило?"
    show monika zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1x "Мммн...!"
    show natsuki zorder 2 at t22
    "Нацуки сжала кулаки."
    "В итоге, никто не принял её сторону."
    "Она в тупике, теперь она дерзит лишь оттого, что не справляется с оказываемым давлением."
    "Так что мне даже стало её жаль."
    show monika zorder 2 at t32
    show natsuki zorder 2 at t33
    show sayori 2h at l41
    s "Э-эм!"
    s "Иногда, когда мне плохо..."
    s "Прогулка помогает остудить голову!"
    show sayori zorder 2 at t41
    mc "Сайори, не думаю, что ей нужно--"
    show natsuki zorder 3 at f33
    n 2q "Знаешь что?"
    n "Так и сделаю."
    n 2w "По крайней мере, это освободит меня от ваших рож."
    show natsuki zorder 1 at thide
    hide natsuki
    "Без предупреждения, Нацуки схватила свою поэму со стола и унеслась."
    "На выходе, она смяла поэму в руке и выбросила её в мусорку."
    show sayori zorder 3 at f41
    s 1k "Нацуки..."
    show sayori zorder 2 at t41
    show monika zorder 3 at f32
    m 1r "Ей правда не следовало это делать..."
    show sayori zorder 1 at thide
    show monika zorder 1 at thide
    hide sayori
    hide monika
    "Я оглядел комнату."
    "Юри сидела уткнувшись подбородком в руки и глядя на стол."
    "Я аккуратно приблизился к ней и сел на стул рядом."
    show yuri 4b zorder 2 at t11
    y "Эх..."
    mc "Всё впорядке?"
    y "Я так смущена..."
    y "Не могу поверить, что вела себя так."
    y "Теперь ты, скорее всего, ненавидишь меня..."
    mc "Нет--Юри!"
    mc "Какой человек не расстроится после такого?"
    mc "Ты справилась с этим лучше, чем кто-либо."
    mc "Конечно я не думаю о тебе плохо."
    y 2v "Ну..."
    y "...Хорошо, я верю тебе."
    y 2s "Спасибо, [player]. Ты очень добрый."
    y "Я рада, что ты стал частью нашего клуба."
    mc "Ээ-- Да ничего."
    y 2v "И ещё кое-что..."
    y "Эм, насчёт того, что Нацуки говорила..."
    y 4c "Насчёт... ну знаешь..."
    y "Я бы никогда не сделала чего-то... настолько постыдного..."
    y "Поэтому..."
    mc "...Э?"
    mc "О чём это говорила Нацуки?"
    y 3n "--!"
    y "Э-эм!"
    y 3q "Нуу, не важно..."
    y "Я-я пойду сделаю чаю..."
    mc "А, хорошая мысль."
    mc "Только сделай больше, чем на одного человека, хорошо?"
    y "У-Угу."
    return

label ch1_end_sayori:
    $ ch1_choice = "sayori"
    mc "Н-Нацуки..."
    show natsuki 5f
    "Нацуки свирепо посмотрела на меня, уничтожая желание что-либо сказать."
    "Поэтому я повернулся к Юри."
    mc "Юри..."
    y 4a "..."
    "Но выражение Юри было настолько беззащитным, что я не смог заставить себя сказать что-либо ей."
    stop music fadeout 1.0
    mc "..."
    mc "...Сайори!"
    show sayori 4m behind yuri at l31
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    s "Э?!"
    mc "...Да!"
    mc "Вы ссоритесь, а из-за этого Сайори чувствует себя неуютно."
    mc "Как вы двое можете продолжать ссориться, зная, что таким образом заставляете своего друга чувствовать себя вот так?"
    show sayori zorder 3 at f31
    s 4d "[player]..."
    show sayori zorder 2 at t31
    show natsuki 4w zorder 3 at f33
    n "Ну... Это её проблема! Это её не касается."
    show natsuki zorder 2 at t33
    show yuri 2g zorder 3 at f32
    y "Я-я согласна..."
    y "Это не честно для других, вмешивать свои чувства в наш конфликт."
    show yuri zorder 2 at t32
    show natsuki zorder 3 at f33
    n 4c "Да, разве что Сайори не хочет сказать Юри, какой заносчивой идиоткой та является."
    show natsuki zorder 2 at t33
    show yuri 3r zorder 3 at f32
    play music t7
    y "Она бы никогда...!"
    y "Это твоя незрелость и расстраивает её в первую очередь!"
    show yuri zorder 2 at t32
    show natsuki 1e zorder 3 at f33
    n "{i}Прошу прощения{/i}?"
    n "Ты себя вообще слышишь?"
    n 1x "Вот именно поэтому..."
    n 1w "Именно поэтому никто и не любит--"
    show natsuki zorder 2 at t33
    show sayori 4p at h31
    stop music
    s "{i}Прекратите!! {/i}"
    show yuri 3f zorder 3 at f32
    show natsuki 1o zorder 3 at f33
    ny "--"
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    show sayori zorder 3 at f31
    play music t8
    s 1h "Нацуки! Юри!"
    s "Ребята, вы -- мои друзья!"
    s 1v "Я-я просто хочу, чтобы все вокруг были счастливы!"
    s "Мои друзья прекрасные люди..."
    s "И люблю я их именно за то, что они такие разные!"
    s 1g "Поэмы Нацуки..."
    s "Они так прекрасны, потому что дарят тебе море эмоций, используя всего несколько слов!"
    s "А поэмы Юри превосходны, поскольку рисуют такие красивые картины в твоей голове!"
    s 4k "Все такие талантливые..."
    s "...Так почему мы ссоримся...?"
    show sayori zorder 2 at t31
    show natsuki zorder 3 at f33
    n 1r "П-потому что..."
    show natsuki zorder 2 at t33
    show yuri 3v zorder 3 at f32
    y "Нуу..."
    show yuri zorder 2 at t32
    show sayori zorder 3 at f31
    s 1j "И ещё!"
    s "Нацуки милая, и в этом нет ничего плохого!"
    s 1i "И грудь Юри такая же, какой была всегда!"
    show sayori at hf31
    s 1j "Большая и красивая!!"
    show sayori 1i zorder 2 at t31
    show natsuki zorder 3 at f33
    n 1o "..."
    show natsuki zorder 2 at t33
    show yuri zorder 3 at f32
    y 3n "..."
    show yuri zorder 2 at t32
    mc "Сайори..."
    "Сайори приняла победоносную стойку."
    "Моника со смущенным выражением лица стояла позади неё."
    show yuri at s32
    y 3q "Я, пожалуй... сделаю чай..."
    show yuri behind sayori at lhide
    hide yuri
    "Юри спешно удаляется."
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацуки, с пустым выражением лица, уселась за парту и уставилась в пустоту."
    show sayori zorder 1 at thide
    show monika 1i zorder 2 at t11
    hide sayori
    mc "Так вот почему Сайори вице-президент..."
    "Прошептал я Монике."
    "Она кивнула в ответ."
    m 1d "Честно говоря..."
    m "Я могу показаться хорошим лидером и умею организовывать кое-что..."
    m 3e "Но я не очень хорошо справляюсь с людьми..."
    m "Я даже не могу заставить себя вмешаться."
    m 1m "Как президента, меня это смущает."
    m 1l "Хаха..."
    mc "Ну..."
    mc "Не могу винить тебя за это."
    mc "Я тоже не смог ничего сказать."
    m "Что ж..."
    m 2a "Полагаю, что Сайори просто превосходна по-своему, не так ли?"
    mc "Можно и так сказать."
    mc "Она может казаться ветреной, но иногда удивительно, что она точно знает, что она делает."
    m 5 "Понимаю~"
    m "Позаботься о ней, хорошо?"
    m "Мне будет очень неприятно видеть её страдания."
    mc "Это касается нас обоих..."
    mc "Можешь положиться на меня."
    "Моника мягко улыбнулась мне, отчего в животе запорхали бабочки."
    "Такая искренняя личность и правда отличный президент, несмотря на то, что она сказала."
    "Если бы у меня только была возможность поговорить с ней ещё немного..."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
