label ch3_main:
    scene bg club_day
    with dissolve_scene_half
    play music t3
    show monika 1g at l31
    m "Вот блин..."
    m "Опять я последняя!"
    mc "Не волнуйся, я тоже только пришёл."
    show yuri 1f zorder 3 at f32
    y "Снова музицировала?"
    show yuri zorder 2 at t32
    show monika zorder 3 at f31
    m 1l "Ага..."
    m "Ха-ха-ха..."
    show monika zorder 2 at t31
    show yuri zorder 3 at f32
    y 1m "Ты, должно быть, очень трудолюбивая."
    y "Основала этот клуб, а теперь ещё и фортепиано..."
    show yuri 1a zorder 2 at t32
    show monika zorder 3 at f31
    m 1a "Ну, скорее не трудолюбивая..."
    m "А увлечённая."
    m "Помните, что клуба не было бы, если не было бы всех вас."
    m 1b "А ещё я супер-счастлива, что вы все хотите помочь с фестивалем!"
    show natsuki 1z zorder 3 at f33
    show monika zorder 2 at t31
    n "А-ах, не могу дождаться фестиваля!"
    n "Он будет классным!"
    show natsuki zorder 2 at t33
    show monika zorder 3 at f31
    m 1d "А?"
    m "Разве не ты ещё вчера жаловалась на этот счёт, Нацуки?"
    show monika zorder 2 at t31
    show natsuki 2a zorder 3 at f33
    n "Ну, это да."
    n "Но я говорю не про {i}наш{/i} вклад в фестиваль."
    n 4l "А про целый школьный день, в который мы можем играть и кушать всякую вкуснятину!"
    show natsuki zorder 2 at t33
    mc "Ты говоришь прямо как Саёри..."
    show natsuki zorder 3 at f33
    n 4a "Моника! Там будут продавать жаренных кальмаров?"
    show natsuki zorder 2 at t33
    show monika 2a zorder 3 at f31
    m "Кальмаров?.."
    m "Как-то странно ждать фестиваля ради них..."
    show monika zorder 2 at t31
    show natsuki 2k zorder 3 at f33
    n "Ой, да ладно."
    n "Хочешь сказать, тебе не нравятся кальмары?"
    n "Тебе-то?"
    show natsuki zorder 2 at t33
    show monika 1d zorder 3 at f31
    m "А? Я не говорила, что они мне не нравятся."
    m "И да, что значит 'тебе-то'?"
    show monika zorder 2 at t31
    show natsuki 1d zorder 3 at f33
    n "То и значит!"
    n "Имя говорит само за себя!"
    n 4z "Мон-ика!"
    show natsuki zorder 2 at t33
    show monika 5b zorder 3 at f31
    m "Чего?!"
    m "Моё имя совсем не так произносится!"
    m "А в переводе эта шутка вовсе смысла не имеет!"
    show monika zorder 2 at t31
    show natsuki zorder 3 at f33
    n 4m "?.."
    show natsuki zorder 2 at t33
    show monika 4l zorder 3 at f31
    m "Э... неважно!"
    m "Давайте сосредоточимся на нашем фестивальном проекте, окей?"
    show monika zorder 2 at t31
    show natsuki 2a zorder 3 at f33
    n "Хи-хи-хи."
    n "Ладно, ладно."
    n "Ты всё равно реагируешь не так смешно, как Юри или Саёри."
    show natsuki zorder 2 at t33
    show yuri 2h zorder 3 at f32
    y "Что, прости?.."
    show yuri zorder 2 at t32
    mc "Кстати, а где Саёри?.."
    mc "О, вот ты где."
    hide monika
    hide yuri
    hide natsuki
    with wipeleft
    "Саёри сидела за партой в углу комнаты и смотрела в никуда, опустив голову."
    "Я подошёл к ней."
    mc "Эй, Саёри."
    show sayori 1k zorder 2 at t11
    "Я помахал рукой перед её лицом."
    s 1n "А-а--?"
    mc "Ты снова витала в облаках."
    s "А-ах..."
    s 4l "Хи-хи-хи, прости..."
    s "Не обращай на меня внимания."
    s 4y "Поговори с кем-нибудь ещё."
    mc "Хм..."
    mc "Всё в порядке?"
    s 1h "К-конечно!"
    s "Почему ты спрашиваешь?"
    mc "Мне просто кажется, что с тобой что-то не так..."
    mc "Прости, наверное, показалось."
    s "Боже, ты слишком много обо мне волнуешься."
    s 4r "Смотри, я в порядке!"
    show sayori at h11
    "Саёри широко улыбнулась."
    s 1a "Не позволяй мне отвлекать тебя от общения с другими."
    mc "Ну... ладно."
    mc "Как скажешь."
    show sayori zorder 1 at thide
    hide sayori
    "Я бросил встревоженный взгляд на Саёри, а после отвернулся к остальным."
    "Но разговор уже иссяк, и все приступили к своим обычным делам."
    "Возможно, стоит спросить у Моники, не замечала ли она перемен в поведении Саёри..."
    "Раз уж они готовились к фестивалю сообща, значит, проводили много времени вместе."
    "Я робко подошёл к Монике, копавшейся в каких-то бумагах на своей парте."
    show monika 2b zorder 2 at t11
    m "[player]! Как дела?"
    mc "Слушай... Наверное, мой вопрос покажется немного нелепым, но..."
    mc "Ты не замечала за Саёри никаких странностей в последнее время?"
    m 1d "Странностей?.."
    m "В каком смысле?"
    mc "Может, я слишком себя накручиваю, но мне кажется, что она сегодня какая-то подавленная..."
    m "О, ты думаешь?"
    m "Я вроде бы ничего такого не заметила..."
    "Моника покосилась в другой конец комнаты, на Саёри, которая лениво водила ластиком вверх-вниз по парте."
    m "Может, она о чём-то и размышляет..."
    m 2a "Но я удивлена, что ты спрашиваешь об этом у меня, [player]."
    m "Ты точно знаешь её лучше, чем я."
    mc "Да, но она такой никогда не была..."
    mc "Она всегда говорила со мной о том, что её беспокоит."
    mc "Но в этот раз, когда я поинтересовался, она ответила как-то односложно, и всё."
    mc "...Прости, я знаю, что это не твои заботы!"
    mc "Я просто хотел спросить, может, ты что-то знаешь, так что пойду-ка я..."
    m 1g "Нет, нет..."
    m "Для меня это тоже важно."
    m 1e "В смысле, я тоже её друг..."
    m "И, знаешь ли, также забочусь о благополучии членов моего клуба."
    m 1i "Может, стоит попытаться самой с ней поговорить..."
    mc "Эм... Ты уверена в этом?.."
    mc "Она вроде бы хотела, чтобы её оставили в покое..."
    m "Ты уверен?"
    m "Может, ей просто не хотелось об этом говорить с объектом её размышлений..."
    mc "Объектом размышлений?.."
    mc "Ты о чём?"
    m 2e "О том, что, возможно, она думает о тебе, [player]."
    mc "Обо мне?.."
    mc "С чего ты, блин, это взяла?"
    m 1j "Ну..."
    m "Я, наверное, не должна распространяться, но..."
    m 1a "Саёри чаще всего говорит о тебе, знаешь?"
    mc "Э-э?.."
    m "Она стала куда веселее с тех пор, как ты вступил в клуб."
    m "Будто внутри неё загорелся новый свет."
    mc "Что?"
    mc "Быть не может..."
    mc "Саёри... она всегда такая."
    mc "Она всегда словно лучится."
    mc "По-моему, в ней вообще ничего не изменилось."
    m 5 "Хи-хи-хи."
    m "Ты такой смешной, [player]."
    m "А ты никогда не задумывался о том, что она всегда такая веселая..."
    m "...потому что она всегда такая рядом с тобой?"
    mc "..."
    m 1n "Ой... сказала лишнее."
    m "Прости... Откуда мне, собственно, знать?"
    m 1a "Не хочу делать поспешных выводов, так что забудь об этом разговоре."
    m "Я попробую поговорить с ней, так что не переживай."
    mc "Эм..."
    mc "Ладно..."
    "Моника понимающе улыбнулась."
    "Она, конечно, просила забыть об этом разговоре..."
    "Но я осознавал, что не смогу взять и выбросить её слова из головы."
    show monika zorder 1 at thide
    hide monika
    "Моника встала из-за парты и подошла к сидящей Саёри."
    "Я видел, как она присела около неё и осторожно заговорила."
    "Но её голос был так тих, что мне не было отсюда слышно."
    "Я вздохнул и присел."
    "Знаю, Саёри сказала не волноваться за неё и веселиться с остальными..."
    "Но это невозможно, когда она так себя ведёт."
    "Насколько же серьёзно я переживаю за неё, что это всё так сильно на меня давит?"
    "Теперь мне кажется, что это я тут веду себя нетипично..."
    "Но мне не остаётся ничего, кроме как ждать Монику."





    if n_appeal == 0 and y_appeal == 0:
        jump ch3_start_none
    elif n_appeal > 1:
        jump ch3_start_natsuki
    elif y_appeal > 1:
        jump ch3_start_yuri
    elif poemwinner[1] == "natsuki":
        jump ch3_start_natsuki
    elif poemwinner[1] == "yuri":
        jump ch3_start_yuri
    elif poemwinner[0] == "natsuki":
        jump ch3_start_natsuki
    elif poemwinner[0] == "yuri":
        jump ch3_start_yuri
    else:
        jump ch3_start_none

label ch3_start_natsuki:
    play music t6 fadeout 1
    show natsuki 3c zorder 2 at t11
    n "Эй, ты."
    mc "Э-э?"
    "Я поднял взгляд и увидел рядом с собой Нацуки."
    n "Ты так и будешь сидеть и смотреть в никуда?"
    n "Времени мало, так что..."
    mc "А, прости."
    mc "Я не хотел заставлять тебя волноваться."
    n 1q "Н-ничего я не волновалась!"
    n "Я просто..."
    "Нацуки отвернулась, глядя в пол."
    "Она держала в руках томик манги."
    mc "Ну ладно..."
    mc "Тут кое-что произошло, но теперь мы можем начать."
    mc "Больше я не заставлю тебя ждать."
    n 5n "Блин..."
    n "Теперь из-за твоих слов я чувствую себя гадиной."
    n "Если тебя что-то беспокоит, то просто скажи мне оставить тебя в покое, и я уйду."
    n 5u "В смысле..."
    n "Если ты, конечно, не хочешь об этом говорить, или что-то в этом роде..."
    "Она едва ли не пробормотала последнюю часть."
    mc "Не-а... Скорее всего, я просто всё преувеличиваю."
    mc "Я всего лишь думал о Саёри, вот и всё."
    n 1p "С-саёри?.."
    n "Думал о ней?.."
    mc "Да, она сегодня какая-то грустная."
    mc "Но когда я спросил, она это не признала."
    mc "Вот я и не могу перестать думать, не случилось ли у неё чего."
    n 1q "Ох..."
    "Нацуки выдохнула."
    n 4w "Ну, для начала..."
    n "Тебе нужно поработать над построением фраз!"
    n 4c "Но, впрочем..."
    n "Ты же её лучший друг, так?"
    mc "Ну, думаю, да..."
    n "Ага."
    n 3k "В таком случае, я думаю, тебе стоит побольше ей доверять."
    n "Если бы она в тебе нуждалась, то не стала б тянуть и сразу бы пришла, я права?"
    mc "Ну... Наверное, права."
    n 3c "В смысле, у некоторых случаются такие дни."
    n "Их не всегда удаётся избежать."
    n "И, возможно, она не хочет тебя беспокоить, потому что это мелочи."
    mc "Да, она что-то такое мне и сказала..."
    mc "Наверное, некрасиво с моей стороны сопротивляться этому её желанию."
    n 3a "Именно."
    n "Если бы ей нужно было твоё беспокойство, это было бы видно."
    mc "Ага..."
    mc "Надо было сразу об этом подумать."
    show natsuki 3q
    "Нацуки повертела книгу, которую держала в руках."
    n 1q "Она..."
    n "Она для тебя много значит, да?.."
    mc "Эм..."
    mc "Не пойми меня неправильно!.."
    mc "Мы просто давно дружим."
    mc "Переживать за своих друзей — естественно."
    mc "В смысле, ты же волновалась обо мне, и..."
    n 4w "Я не волновалась!!"
    n "Блин... Если с тобой всё в порядке, то давай уже начнём!"
    mc "Хорошо, хорошо..."


    if not n_exclusivewatched and poemwinner[2] == "natsuki":
        call natsuki_exclusive_2_ch3 from _call_natsuki_exclusive_2_ch3
    else:
        jump ch3_start_none
    return

label ch3_start_yuri:
    "Почему мне кажется, что за мной наблюдают?.."
    "Я оглядел комнату."
    show yuri 2t zorder 2 at t11
    "И внезапно заметил, что Юри поглядывает на меня из-за книги."
    show yuri 4b
    "Но она быстро отвела взгляд, пряча смущённое лицо."
    "Я понял, что так она никогда не решится."
    "Я ни разу не видел, чтобы Юри подходила к кому-то или начинала разговор по собственной инициативе."
    "Так что оставалось только подойти к ней самому."
    "И теперь мне сделать это куда проще."
    "Я встал из-за своей парты и сел по соседству с ней."
    play music t6 fadeout 1
    y 2v "..."
    y "Я... не хотела тебя беспокоить..."
    mc "Расслабься, ты даже ничего не сделала."
    y "Но..."
    y "Я видела, что ты хотел побыть наедине со своими мыслями..."
    mc "Наедине со своими мыслями?..."
    mc "Как ты смогла это понять?"
    y 1t "Ну..."
    y "Я так тоже часто делаю..."
    y "Так что по твоей позе и выражению лица было нетрудно догадаться."
    y 3o "Н-нет-нет, я не пялилась!.."
    y "Не подумай, я не делала ничего такого!.."
    mc "В любом случае ты не ошиблась."
    mc "Прости, если я тебя этим побеспокоил."
    y 1s "Не извиняйся..."
    y "Побеспокоить своими проблемами можно только тех, кому эти проблемы небезразличны."
    y "Конечно, есть люди, которые предпочитают хранить всё в себе..."
    y "Но если тебе захочется поделиться своими мыслями, я с радостью тебя выслушаю."
    mc "Да тут ничего особенного..."
    mc "Я просто немного расстроен из-за Саёри."
    y 2t "Саёри?.."
    mc "Да... Она сегодня какая-то грустная, но когда я спросил её, почему, она этого не признала."
    mc "Вот я и не могу перестать думать, не случилось ли у неё чего."
    y 3u "О?"
    y "Так романтично..."
    mc "Э?.."
    y 4c "П-прости!"
    y "Я сказала глупость!.."
    mc "Не думаю. Просто ты, кажется, неправильно поняла."
    mc "Мы с Саёри давние друзья, не более."
    y 2l "А... Понятно..."
    y 2f "Тогда, полагаю, скрывать от тебя свои чувства для неё непривычно..."
    mc "А может, я просто себя накручиваю..."
    y 1u "[player]..."
    y "Мир полон смысла, который скрыт от прямого взгляда."
    y 1s "И у каждого человека есть свои скелеты в шкафу, как бы хорошо ты его ни знал."
    mc "М-да..."
    mc "Значит, ты считаешь, что с ней всё-таки что-то не так?"
    y 1l "М-м..."
    y "Я считаю, что Саёри очень сложная личность."
    y 1h "Её внешнее поведение не всегда совпадает с тем, что у неё происходит внутри..."
    y "И она, скорее всего, не всегда понимает, чего хочет."
    y "Я тоже заметила, что она сегодня странно себя ведёт..."
    y "И переживаю за неё."
    y 1f "Но в твоём случае создаётся впечатление, что она занимает все твои мысли. Это так?"
    mc "Ну..."
    mc "Думаю, что так."
    y 3u "Саёри..."
    y "Она... Много для тебя значит, да?"
    mc "А... Д... Думаю, да..."
    mc "Но не в том смысле!"
    mc "Мы просто хорошие друзья, вот и всё..."
    y 2t "..."
    "Юри вдруг пристально посмотрела в мне глаза."
    "Взглядом, полным спокойного любопытства, она будто что-то искала в них."
    "Я смутился и отвернулся."
    y 2m "Иногда..."
    y "Люди не подозревают даже о собственных скелетах."
    y 2a "И ты, будучи честным и заботливым..."
    y "Можешь открыть в себе чувства, которых не осознавал."
    y 4b "Э-это..."
    y "Я думаю, что..."
    y "Она очень везучий человек..."
    y "Раз у нее... есть ты, проявляющий такие чувства."
    mc "Юри..."
    mc "Ты меня переоцениваешь."
    mc "Я обычный парень."
    mc "И, думаю, мои чувства настолько же просты и понятны."
    mc "Я и близко не столь загадочен, как ты."
    y 2t "А-ах..."
    y "Это же... не комплимент, да?"
    mc "Это просто факт."
    mc "Ладно, раз уж мы здесь сидим, так почему бы не почитать?"
    y 2s "Ну..."
    y "Если ты не против."
    mc "Ага."
    mc "Мне всё равно нужно отвлечься от всего этого."


    if not y_exclusivewatched and poemwinner[2] == "yuri":
        call yuri_exclusive_2_ch3 from _call_yuri_exclusive_2_ch3
    else:
        jump ch3_start_none
    return

label ch3_start_none:
    if not renpy.music.get_playing(channel='music') == audio.t3:
        stop music fadeout 1.0
    scene bg club_day
    with wipeleft_scene
    "..."
    if not renpy.music.get_playing(channel='music') == audio.t3:
        play music t3
    show monika 4b zorder 2 at t11
    m "Так, ребята!"
    "Прошло какое-то время, и Моника созвала всех нас."
    m "Давайте, что ли, обмениваться стихами?"
    show monika zorder 1 at thide
    hide monika
    "Не успел я и глазом моргнуть, как всё встало на свои места."
    "Все пошли за своими стихами, и я поступил так же."
    "Я заглянул в глаза Монике, и она мне улыбнулась."
    "Интересно, о чём она говорила с Саёри..."
    return


label ch3_end:
    stop music fadeout 1.0
    scene bg club_day
    show monika 4b zorder 2 at t32
    with wipeleft_scene
    play music t3
    m "...Так, вы трое!"
    m "Мы закончили обмениваться стихами, да?"
    m "Так почему бы не начать разбираться с..."
    show natsuki 3c zorder 3 at f31
    n "Погоди-ка!"
    n "Мне показалось, или ты сейчас сказала что-то странное?"
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 4d "Э-э?.."
    show monika zorder 2 at t32
    show yuri 1e zorder 3 at f33
    y "Что-то прозвучало как-то непривычно..."
    y "Точно."
    y 1f "Ты отклонилась от своей коронной фразы, когда обращалась к клубу."
    show yuri zorder 2 at t33
    show monika 1n zorder 3 at f32
    m "К-коронной фразы?"
    m "Нет у меня никакой коронной фразы..."
    show monika zorder 2 at t32
    show natsuki 4q zorder 3 at f31
    n "Блин..."
    n "Что ж сегодня атмосфера такая странная?"
    n "Вон, даже Юри не устояла."
    show natsuki zorder 2 at t31
    show yuri 4b zorder 3 at f33
    y "У-у..."
    y "Застывший воздух есть характерный предвестник ужасных событий..."
    show yuri zorder 2 at t33
    mc "В {i}твоих книгах{/i}, может быть, и так!"
    mc "Слушай, единственное отличие в том, что сейчас здесь нет Саёри."
    show yuri 2g zorder 3 at f33
    y "Ох..."
    y "...Полагаю, ты прав."
    show yuri zorder 2 at t33
    show monika 2r zorder 3 at f32
    m "Эх..."
    m 2d "Саёри всегда немного разряжала обстановку, не так ли?"
    m "Все как-то чувствуют себя не в своей тарелке, когда её нет рядом..."
    show monika zorder 2 at t32
    show natsuki 3k zorder 3 at f31
    n "А куда она убежала ваще?"
    n "Я думала, она поссать отошла."
    show natsuki zorder 2 at t31
    show yuri 1l zorder 3 at f33
    y "Нацуки, пожалуйста, веди себя приличнее..."
    show yuri zorder 2 at t33
    show natsuki 4w zorder 3 at f31
    n "Ой, да ладно."
    show natsuki zorder 2 at t31
    mc "Ей сегодня было нехорошо, поэтому она и ушла домой пораньше..."
    show yuri 2t zorder 3 at f33
    y "Вот как?.."
    y "Надеюсь, она в порядке..."
    show yuri zorder 2 at t33
    show natsuki 5c zorder 3 at f31
    n "Серьёзно?"
    n "Ты решил не провожать её домой именно в тот единственный день, когда ей плохо?"
    n "Любовнички из вас конечно да-а..."
    show natsuki zorder 2 at t31
    mc "А... Нет!"
    mc "Во-первых, хватит перевирать мою дружбу с Саёри!"
    mc "А во-вторых..."
    mc "Она меня сегодня вроде как избегала, вот я и не хотел на неё давить..."
    show yuri 1g zorder 3 at f33
    y "О-о-о?"
    show yuri zorder 2 at t33
    mc "{i}Вот от кого-кого, а от Юри я такого любопытства не ожидал.{/i}"
    show monika 1r zorder 3 at f32
    m "Успокойтесь, ребята!.."
    m 1d "Я с ней только что говорила. Всё в порядке."
    show monika zorder 2 at t32
    mc "Что она сказала?.."
    show monika zorder 3 at f32
    show yuri 1e
    m 1a "Ладно, нам нужно распределить оставшиеся обязанности по фестивалю, так что..."
    m "Давайте решим, кто что будет делать в эти выходные."
    show monika zorder 2 at t32
    show natsuki 4l zorder 3 at f31
    n "{i}Я{/i} уже в курсе, что делаю!"
    show natsuki zorder 2 at t31
    show monika 2b zorder 3 at f32
    m "Верно."
    m "Нацуки печёт кексы."
    m "Но нам их нужно будет много, да ещё с разными вкусами..."
    m "Сама справишься, Нацуки?"
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 4z "Вызов принят!"
    show natsuki 4a zorder 2 at t31
    show monika zorder 3 at f32
    m 1a "Ну а что до меня..."
    m "Я буду распечатывать и сшивать буклеты со стихами."
    m "Саёри поможет мне с дизайном."
    m "Что же до Юри..."
    m 1d "..."
    m 3n "Юри, ты можешь..."
    m "Э... Ум-м..."
    show monika zorder 2 at t32
    show natsuki 3c zorder 3 at f31
    n "?.."
    show natsuki zorder 2 at t31
    show monika 5 zorder 3 at f32
    m "Ребята..."
    m "Поможете мне придумать работёнку для Юри?.."
    show monika zorder 2 at t32
    show yuri 4c zorder 3 at f33
    y "Я..."
    y "Я бесполезная..."
    show yuri zorder 2 at t33
    show monika 1g zorder 3 at f32
    m "Н-Нет!"
    m "Это вовсе не так!"
    m "Ты здесь вообще-то самая талантливая!"
    show monika zorder 2 at t32
    show natsuki 5g zorder 3 at f31
    n "..."
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 1g "А-а-а теперь и Нацуки дуется?!"
    show monika zorder 2 at t32
    mc "Боже, даже я это вижу..."
    mc "Пожалуй, я недооценивал влияние Саёри, но теперь точно могу cказать, что без неё всё как-то усложняется."
    show monika zorder 3 at f32
    m "Ах..."
    m "Может быть, и так..."
    m 1i "Но если я не смогу быть лидером самостоятельно, то мне не светит личностный рост."
    m 2i "Так что, Юри!.."
    m 2a "У тебя же красивый почерк?"
    m "Сделай нам плакатов и декораций для создания атмосферы."
    show monika zorder 2 at t32
    show yuri 4a zorder 3 at f33
    y "Атмосферы?.."
    y "Эм, ну на самом деле..."
    y "Мне..."
    y 2r "Мне нравится атмосфера!"
    show yuri 2l
    "Выражение лица Юри внезапно сменилось, и она внимательно уставилась на парту, кивая сама себе."
    show yuri zorder 2 at t33
    mc "Шестерёнки в голове, смотрю, уже закрутились..."
    show monika 2b zorder 3 at f32
    m "Замечательно!"
    m "Ты здорово поможешь, Юри."
    m 2a "И тогда..."
    m "Остаёшься только ты, [player]."
    show monika zorder 2 at t32
    mc "Единственный, кто по-настоящему бесполезен."
    show monika 1k zorder 3 at f32
    m "Ха-ха-ха! Не говори так."
    m 1b "На самом деле..."
    m "И у Нацуки, и у Юри довольно-таки сложные задачи."
    m "Ты здорово облегчишь им работу, если поможешь."
    m 1m "Ну а ещё ты всегда можешь помочь мне..."
    m 1a "Я бы этому очень обрадовалась."
    show monika zorder 2 at t32
    mc "Эм-м..."
    mc "Это..."
    "Моника предлагает мне провести выходные с одной из девушек?"
    "И как они вообще на такое предложение отреагируют?.."
    show yuri 1u zorder 3 at f33
    y "Э-э-э..."
    y "Я... полагаю, что немножечко помощи мне не помешает..."
    show yuri zorder 2 at t33
    show natsuki 3c zorder 3 at f31
    n "Ну, даже если ты не умеешь печь, у меня для тебя всегда найдется грязная работёнка."
    n 3q "Моника не собирается давать мне выбора, да и тебе не стоит просиживать штаны..."
    "Нацуки бормотала какие-то отговорки."
    show natsuki zorder 2 at t31
    show yuri 2k zorder 3 at f33
    y "Эм-м..."
    y "Хочу напомнить, Нацуки..."
    y 2f "Что ты утверждала, будто выпечкой предпочитаешь заниматься самостоятельно."
    y "[player] вряд ли захочет помогать там, где его считают всего лишь досадной помехой..."
    y 2i "Так что..."
    y "Он, наверное, больше подойдёт для помощи с декорациями."
    show yuri zorder 2 at t33
    show natsuki 4e zorder 3 at f31
    n "Притормози! Я так никогда не говорила!"
    n 4h "И да, неужели склепать парочку декораций это офигеть какой труд?"
    n "По-моему ты просто ищешь повод, чтобы [player]..."
    show natsuki zorder 2 at t31
    show yuri 3n zorder 3 at f33
    y "О ч-чём ты?!"
    y "Это будет чрезвычайно кропотливая работа..."
    show yuri zorder 2 at t33
    show natsuki 5w zorder 3 at f31
    n "А выпечка — нет?"
    n "Ты что, думаешь..."
    show natsuki zorder 2 at t31
    show monika 2g zorder 3 at f32
    m "Ребята, ребята!"
    m "Давайте успокоимся..."
    m 2d "В конце концов, это [player] должен решать, чем ему заниматься."
    m "Кроме того..."
    m 5 "Например, со мной ему толком и не доводилось проводить время, знаете?"
    m "И я уверена, что он хотел бы..."
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 4f "Ты {i}в открытую{/i} сказала..."
    show natsuki zorder 2 at t31
    show yuri 2h zorder 3 at f33
    y "Я.. Я тоже крайне удивлена!"
    show yuri zorder 2 at t33
    show monika 1l zorder 3 at f32
    m "Простите, простите!"
    m "Я сказала просто так, хотя..."
    show monika zorder 2 at t32
    show natsuki 4x zorder 3 at f31
    n "Блин..."
    n "Давайте уже определимся."
    show natsuki zorder 2 at t31
    show monika 1e zorder 3 at f32
    m "Да..."
    m "[player], ты же не против?"
    m 1a "В конце концов, это тебе решать."
    show monika zorder 2 at t32
    mc "Эм-м..."
    mc "Конечно."
    show natsuki 5g zorder 3 at f31
    n "Пф."
    show natsuki zorder 2 at t31
    show yuri 1f zorder 3 at f33
    y "Отлично..."
    show yuri zorder 2 at t33
    show monika 1a zorder 3 at f32
    m "В таком случае..."
    show monika zorder 2 at t32
    "Все взгляды сошлись на мне."
    menu:
        "Но, естественно, я буду помогать..."
        "Нацуки.":
            call ch3_end_natsuki from _call_ch3_end_natsuki
        "Юри.":
            call ch3_end_yuri from _call_ch3_end_yuri
        "Монике.":
            call ch3_end_monika from _call_ch3_end_monika
        "Саёри...":
            call ch3_end_sayori from _call_ch3_end_sayori
    scene bg residential_day
    with wipeleft_scene
    $ ch4_name = ch4_scene.capitalize()
    if ch4_name == "Natsuki":
        $ ch4_name = "Нацуки"
    elif ch4_name == "Yuri":
        $ ch4_name = "Юри"
    "Поверить не могу!"
    "[ch4_name] придёт ко мне домой в воскресенье?.."
    if help_sayori:
        "Пусть я и предпочёл бы провести его с Саёри..."
        "Но всё равно волнуюсь выше крыши."
        "Пожалуй, я уже привык проводить с ней время за подобными делами..."
        "Но кто знает, что может случиться вне школы?"
        "Она даже говорила, что будет ждать этого дня..."
        "Я потряс головой."
        "Почему я так нервничаю при мысли о том, что Саёри узнает об этом?"
        "Мы же не в {i}таких{/i} отношениях..."
        "Кроме того, как сказала Моника, это всё ради клуба."
        "Мне не о чем волноваться."
        "Нужно просто сделать это и приятно провести время."
    else:
        "Я волнуюсь выше крыши."
        "Хотя я уже и привык проводить с ней время за подобными делами..."
        "Но кто знает, что может случиться вне школы?"
        "Более того... она сказала, что будет ждать этого дня."
        "Неужели это шанс на развитие наших отношений?"
        "...Или об этом слишком рано судить?"
        "Только время покажет..."
        "Но пока это не станет очевидным, я не перестану об этом думать."
        "Просто не могу дождаться!"
    return

label ch3_end_sayori:
    $ help_sayori = True
    mc "Ну..."
    mc "Если выбирать изо всех, то я предпочту помочь Саёри."
    mc "В смысле, мы же соседи, и..."
    show yuri 2f zorder 3 at f33
    y "Но Моника сказала..."
    show yuri zorder 2 at t33
    show natsuki 4w zorder 3 at f31
    n "Моника сказала, что Саёри помогает ей!"
    n "Блин..."
    n 4h "Ты серьёзно нас так ненавидишь?"
    show natsuki zorder 2 at t31
    mc "Н-Нет!"
    show monika 1e zorder 3 at f32
    m "Прости, там не такое уж сложное дело..."
    show monika zorder 2 at t32
    menu:
        m "Просто думай о клубе, окей?"
        "Нацуки.":
            call ch3_end_natsuki from _call_ch3_end_natsuki_1
        "Юри.":
            call ch3_end_yuri from _call_ch3_end_yuri_1
        "Монике." if help_monika == None:
            call ch3_end_monika from _call_ch3_end_monika_1
    return


label ch3_end_monika:
    $ help_monika = True
    mc "Ну, наверное, я помогу Монике..."
    show monika 5 zorder 3 at f32
    m "Ура, ты выбрал меня!"
    show monika zorder 2 at t32
    show natsuki 3e zorder 3 at f31
    stop music fadeout 1.0
    n "Погоди-ка!"
    show natsuki zorder 2 at t31
    show yuri 2r zorder 3 at f33
    y "А-Ага!"
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    play music t7
    n "Моника, вот тебе-то помощь нужна меньше всех из присутствующих!"
    show natsuki zorder 2 at t31
    show monika 1d zorder 3 at f32
    m "Э-э? Но..."
    show monika zorder 2 at t32
    show yuri 1h zorder 3 at f33
    y "Я соглашусь с Нацуки."
    y 1l "Мало того, что с твоей работой справится и один человек..."
    y "Так у тебя ещё и Саёри."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m 1p "Но ведь [player] сам выбрал..."
    m "А..."
    show monika zorder 2 at t32
    show natsuki 3c zorder 3 at f31
    n "Это неважно."
    n "Ты сама вынудила его выбрать себя."
    n 3e "Ты президент клуба, Моника."
    n "И должна ответственно относиться к руководству!"
    show natsuki zorder 2 at t31
    show yuri 2f zorder 3 at f33
    y "Моника, тебе не следует позволять каким-то скрытым мотивам влиять на это решение."
    show yuri zorder 2 at t33
    show monika 2i zorder 3 at f32
    m "Скрытым мотивам?"
    m "О-о чём ты говоришь, Юри?"
    m "Такое ощущение, что на самом деле это у вас какие-то скрытые мотивы!"
    show monika zorder 2 at t32
    show natsuki 1x zorder 3 at f31
    n "Прости, {i}что{/i}?"
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m "Иначе... распределение работы не переросло бы в этот фарс!"
    show monika zorder 2 at t32
    show yuri 3r zorder 3 at f33
    y "Это... абсолютно не так, Моника!"
    show yuri zorder 2 at t33
    show natsuki 3e zorder 3 at f31
    n "Ага!"
    n "У нас много работы, знаешь ли!"
    n "И если мы будем работать поодиночке, то нормального ничего не выйдет."
    show natsuki zorder 2 at t31
    show monika 1p zorder 3 at f32
    m "А... наверное... вы правы..."
    show monika zorder 2 at t32
    show yuri 2l zorder 3 at f33
    y "Подумай о клубе, Моника..."
    y "Если мы хотим, чтобы наше выступление было успешным, нам следует разумно распределить ресурсы."
    show yuri zorder 2 at t33
    show monika 3n zorder 3 at f32
    m "Эм..."
    m "Ах..."
    show monika zorder 2 at t32
    show natsuki 4x zorder 3 at f31
    n "Так сделаешь ли ты правильный выбор, {i}Президент{/i}?"
    show natsuki zorder 2 at t31
    show monika 1p zorder 3 at f32
    m "Ладно, ладно!"
    m "Я поняла!"
    stop music fadeout 1.0
    show natsuki 4g
    show yuri 2g
    m 1r "Эх..."
    m 1g "Фактически... самым логичным будет, чтобы [player] выбирал из вас двоих."
    m "Так что..."
    m 1c "Полагаю... так мы и поступим."
    show monika zorder 2 at t32
    play music t3
    menu:
        m "Так кого ты предпочтёшь, [player]?"
        "Нацуки.":
            call ch3_end_natsuki from _call_ch3_end_natsuki_2
        "Юри.":
            call ch3_end_yuri from _call_ch3_end_yuri_2
        "Саёри..." if help_sayori == None:
            call ch3_end_sayori from _call_ch3_end_sayori_1
    return

label ch3_end_natsuki:
    $ ch4_scene = "natsuki"
    mc "Ну, выпечка вроде как интересное занятие..."
    mc "И вы, кажется, говорили, что это довольно трудоёмко, так что, наверное, понадобятся два человека."
    show natsuki 4l zorder 3 at f31
    n "Не переживай!"
    n "Выпечка это суперинтересно!"
    n "И с этим ты точно согласишься!"
    show natsuki zorder 2 at t31
    show monika 1d zorder 3 at f32
    m "Э?"
    m "Ты только что говорила, мол..."
    show monika zorder 2 at t32
    show natsuki 1q zorder 3 at f31
    n "Э-это потому что!.."
    n "..."
    n "...Забудем, ладно?"
    show natsuki zorder 2 at t31
    show monika 2a zorder 3 at f32
    m "Ну ладно..."
    m "Ты и сама справишься, да, Юри?"
    show monika zorder 2 at t32
    show yuri 1j zorder 3 at f33
    y "Конечно."
    y "В конце концов, я к этому привыкла..."
    show yuri 1g zorder 2 at t33
    show monika 1e zorder 3 at f32
    m "..."
    show monika zorder 2 at t32
    mc "..."
    show monika zorder 3 at f32
    m 1n "Это... хорошо..."
    "Несмотря на то, что Юри явно переигрывала, сложно было не посочувствовать..."
    show monika 1m zorder 2 at t32
    show natsuki 3a zorder 3 at f31
    n "Ну, теперь всё, так?"
    n "Ещё нужно что-нибудь обговорить?"
    show natsuki zorder 2 at t31
    show monika 1a zorder 3 at f32
    m "Нет, пожалуй, всё..."
    m "Вы рады, ребята?"
    show monika zorder 2 at t32
    show natsuki 1z zorder 3 at f31
    n "Да!"
    n "Всё, кроме представления, будет супер-пупер!"
    show natsuki 1a zorder 2 at t31
    mc "Не думаю, что это в тему..."
    show monika zorder 3 at f32
    m "А как насчёт тебя, [player]?"
    show monika zorder 2 at t32
    mc "Меня?"
    mc "А, ну, можно сказать, что мне интересно, как у нас всё получится..."
    show monika 2b zorder 3 at f32
    m "Мне этого достаточно!"
    m "А тебя, Юри?"
    m 2d "...Юри?"
    show monika zorder 2 at t32
    show natsuki 3c zorder 3 at f31
    n "Она всё ещё дуется."
    show natsuki zorder 2 at t31
    show yuri 4b zorder 3 at f33
    y "..."
    show yuri zorder 2 at t33
    show natsuki 5n zorder 3 at f31
    n "..."
    "Нацуки тоже надулась."
    n "Да ладно..."
    n 5m "В смысле, это же мелочи..."
    show natsuki zorder 2 at t31
    mc "Ну, скорее всего, дело не в этом..."
    show natsuki zorder 3 at f31
    n "?.."
    show natsuki zorder 2 at t31
    mc "Мне кажется, Юри просто чувствует себя немного недооценённой."
    mc "Сначала для неё долго придумывали занятие, а потом оставили без помощи."
    show natsuki zorder 3 at f31
    n 5q "Это не значит..."
    n "..."
    n 5r "У-у..."
    show natsuki 5u
    "Взгляд Нацуки нервно метался между всеми нами."
    n 1u "Слушай..."
    "Нацуки подошла к Юри и положила руки ей на плечи."
    n 1h "Юри."
    n "Ты и правда здесь самая талантливая."
    n "И..."
    n "И ты поможешь сделать наше мероприятие куда более интересным и гостеприимным."
    n 1q "Ну, кексики тоже немало помогут..."
    n 3h "Но ты сделаешь атмосферу особенной."
    n "И это будет важнейшей деталью, которая настроит людей на представление."
    n "Так что..."
    n 4w "Прекрати тупить и начни наконец себя уважать!"
    "Нацуки отпустила её и отвернулась в другую сторону."
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f33
    y 4a "..."
    y "Ты ведь... так на самом деле не думаешь, не так ли?"
    show yuri zorder 2 at t33
    show natsuki 5u zorder 3 at f31
    n "Эм..."
    n "Н-не совсем так, но..."
    show natsuki zorder 2 at t31
    "Не одна Юри удивилась."
    "Мы с Моникой тоже были поражены словами Нацуки."
    "Чтобы Нацуки так яро выражала поддержку..."
    "Но потом я начал понимать."
    "Нацуки пыталась подражать Саёри."
    "Пусть у неё не совсем получилось, но я видел, что она пыталась сказать то, что сказала бы в этой ситуации Саёри."
    "Потому что Саёри всегда помогала всем улыбаться и не унывать."
    show yuri 2l zorder 3 at f33
    y "Простите... что веду себя, как идиотка."
    y 2i "Я буду стараться изо всех сил."
    y "И мы вместе устроим действительно классное выступление."
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 5j "Ага."
    show natsuki zorder 2 at t31
    show monika 2k zorder 3 at f32
    m "Да!"
    m 2b "Я надеюсь, что все постараются как следует."
    m "Тогда..."
    m "На сегодня всё."
    m "Полагаю, самое время расходиться по домам."
    show monika zorder 2 at t32
    show natsuki 3k zorder 3 at f31
    n "Окей, но я немного задержусь."
    n "Я сегодня почти не читала, так что..."
    show natsuki zorder 2 at t31
    show monika 2a zorder 3 at f32
    m "Да, конечно, занимайся."
    hide natsuki
    hide monika
    hide yuri
    with wipeleft
    "Все начали собирать свои вещи."
    "Я последовал за переговаривающимися Моникой и Юри к двери."
    play music t6 fadeout 1
    show natsuki 4g zorder 2 at t11
    n "Эм, ты куда собрался?"
    mc "Э?.."
    n 4c "Нам ещё нужно определиться с планами на выходные."
    n "Ты бы сейчас просто пошёл домой и понял, что даже связаться со мной никак не можешь."
    mc "О, и правда..."
    mc "Понятия не имею, почему это вылетело у меня из головы."
    n 2c "Блин, хорошо, что я тебя остановила."
    n "Я дам тебе свой номер телефона, окей?"
    n 2q "И не вздумай прикалываться по этому поводу!"
    mc "А почему я должен?.."
    n 1s "Пф..."
    "Нацуки дала мне свой номер."
    n 1c "Окей..."
    n "Я загляну в воскресенье."
    n "И принесу все ингредиенты."
    mc "Стой!"
    mc "Ты придёшь {i}ко мне{/i}?"
    n 2c "Ну да."
    n "А что не так?"
    mc "Ну в смысле..."
    mc "Я просто думал, что раз это я тебе помогаю, то мне и идти к тебе..."
    n "Ну конечно."
    n 5x "Типа я могу притащить домой парня..."
    n "Отец меня убьёт."
    mc "Серьёзно?"
    mc "Слишком строго, как по мне."
    n 5r "Ага, а мне каково, по-твоему?"
    n "Я ничего не могу делать, когда отец дома..."
    n 2q "Ладно... Просто захотелось немного поныть."
    n 2c "Теперь у нас есть номера друг друга."
    n "Больше мне от тебя ничего не нужно."
    n "Напишу, скорее всего, как буду подходить."
    mc "Окей, договорились."
    n "Угу."
    n 4a "Я собираюсь показать тебе, почему так люблю выпечку."
    n "Так что жди и надейся."
    mc "О?"
    mc "А разве не ты только что говорила, что нагрузишь меня грязной работой?"
    n 1r "Ну!.."
    n "Я... сказала просто так."
    n 1q "Я же не могла при всех... показать..."
    n "Что и правда ждала этого."
    mc "Стоп, ты серьёзно?"
    n 5w "Ну, вообще-то, да!"
    n "Просто потому что... Я никогда раньше ни с кем не пекла."
    n 5h "Вот так вот, поэтому..."
    mc "Ладно, я понял."
    mc "Прости, что так удивился."
    mc "В общем, я пошёл."
    mc "Увидимся в воскресение."
    n 5m "А..."
    n "..."
    n 5u "...Забей."
    return

label ch3_end_yuri:
    $ ch4_scene = "yuri"
    mc "Ну, наверное, Юри я нужнее..."
    show yuri zorder 3 at f33
    y 2n "М-мне?.."
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 4e "Ты серьёзно?"
    n "Почему ты..."
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 1i "Нацуки."
    m "Я уже чувствую, что ты собираешься сказать какую-то гадость."
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 5r "Н-нет..."
    n "Я просто хотела..."
    n "Эх..."
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 2a "Так что, будешь помогать Юри, [player]?"
    show monika zorder 2 at t32
    mc "Да."
    mc "Именно это я и собирался сделать."
    show yuri zorder 3 at f33
    y 1u "Я рада."
    y "У меня есть плохая привычка постоянно мудрить с такими вещами..."
    y "Так что твоя помощь будет очень кстати."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m "Приятно слышать."
    m "Нацуки, сможешь сама разобраться с выпечкой?"
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 3w "Ну как бы да."
    n "Я уже сказала, что без проблем."
    show natsuki zorder 2 at t31
    show monika zorder 3 at f32
    m 1i "Ладно, ладно..."
    "Было видно, что Нацуки немного расстроилась."
    show monika zorder 2 at t32
    mc "Итак... мы всё обсудили, что хотели?"
    show monika zorder 3 at f32
    m 1a "Да, судя по всему, всё."
    m 2a "Вы рады, ребята?"
    show monika zorder 2 at t32
    show yuri zorder 3 at f33
    y 1i "Ну, 'рада' — немного не то слово..."
    y "Но, полагаю, я самую малость жду нашего звёздного часа."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m "У тебя такие же мысли, [player]?"
    show monika zorder 2 at t32
    mc "У меня?"
    mc "А, ну, можно сказать, что мне интересно, как у нас всё получится..."
    show monika zorder 3 at f32
    m 2b "Мне этого достаточно!"
    m 2a "А ты как, Нацуки?"
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n 5s "..."
    show monika zorder 2 at t32
    show yuri zorder 3 at f33
    y 2h "Нацуки!"
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 1o "Что?!"
    n 1m "Почему все на меня орут?"
    n "Я же ничего не сделала!.."
    show natsuki 1n zorder 2 at t31
    show yuri zorder 3 at f33
    y 3n "Н-нет!.."
    y "Я вовсе не это имела в виду!"
    y 3o "А-ах..."
    "Взгляд Юри нервно заметался между всеми нами."
    y 2w "М-мне жаль, что так вышло!"
    y 2v "Я не знаю, почему [player] выбрал меня..."
    y "И ещё..."
    y 2t "Твои кексы самые лучшие из тех, что я когда-либо ела!"
    y "Они прекрасно идут к моему чаю!"
    y "И ничто из того, что я подготовлю к выступлению, не сравнится с ними, так что..."
    y 4b "Так что..."
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 3q "Поняла, поняла."
    n 3h "Я просто немного удивлена..."
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f33
    y "П-почему?"
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 3q "Эм..."
    n "Ну, я веду себя по-детски..."
    n "Я это уже поняла."
    n 5h "Но ты почему-то пытаешься меня подбодрить..."
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f33
    y "Я... знаю, что не умею это делать..."
    y 2v "Прости, если я тебя чем-то обидела!"
    "Не одна Нацуки удивлена."
    "Мы с Моникой тоже были поражены словами Юри."
    "У неё и так были проблемы с общением, а уж подбадривать кого-то - так и вовсе вне зоны комфорта."
    "Но я начал понимать."
    "Юри пыталась подражать Саёри."
    "Пусть у неё не совсем получилось, но я видел, что она пыталась сказать то, что сказала бы в этой ситуации Саёри."
    "Потому что Саёри всегда помогала всем улыбаться и не унывать."
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 1h "Нет..."
    n "Я это типа оценила."
    n 1u "Простите... что я подняла бучу на ровном месте."
    n 1m "Но я скажу."
    show natsuki zorder 2 at t31
    show yuri zorder 3 at f33
    y 2e "?.."
    show yuri zorder 2 at t33
    show natsuki zorder 3 at f31
    n 4e "Лучше бы тебе не сомневаться, что мои кексики будут главной фишкой нашего выступления!"
    show natsuki 4a zorder 2 at t31
    show yuri zorder 3 at f33
    y 2f "Эм-м..."
    y 1s "...Я верю тебе."
    show yuri zorder 2 at t33
    show monika zorder 3 at f32
    m 2b "Да!"
    m "Я надеюсь, что все постараются как следует."
    m "Тогда..."
    m "На сегодня всё."
    m "Полагаю, самое время расходиться по домам."
    show monika zorder 2 at t32
    show natsuki zorder 3 at f31
    n "Окей, тогда погнали отсюда."
    hide monika
    hide natsuki
    hide yuri
    with wipeleft
    "Все начали собирать свои вещи."
    "Я последовал за переговаривающимися Моникой и Нацуки к двери."
    play music t6 fadeout 1
    show yuri 2t zorder 2 at t11
    y "Э-эм!.."
    mc "А?"
    "Я обернулся."
    y "Прости..."
    y 2s "Я поняла, что у меня нет способов связаться с тобой на выходных..."
    mc "Ох, ты права."
    mc "И как это у меня из головы вылетело."
    mc "Наверное, надо дать тебе свой номер телефона?"
    y 1a "Полагаю... да, это будет самый лучший способ связи."
    mc "Окей, тогда..."
    "Мы с Юри обменялись номерами телефонов."
    y "Окей."
    y "Что же, в воскресенье я к тебе..."
    mc "Что?"
    mc "Ко мне?"
    y 2t "А... что-то не так?.."
    mc "Нет, вовсе нет..."
    mc "Я подумал, что раз это я тебе помогаю, то мне к тебе и идти."
    y "М-м, думаю, в твоих словах есть логика..."
    y "Но если ты не против..."
    y 1u "Я бы предпочла прийти к тебе."
    mc "Хорошо."
    mc "Раз так, то я не против."
    "Я решил не выпытывать у Юри причину."
    "Всё равно, скорее всего, это не важно, так что стоит лучше озаботиться уборкой своей комнаты."
    mc "Надеюсь, я хоть немного смогу пригодиться..."
    mc "Я и близко не настолько креативен, как ты."
    y 1a "Не недооценивай себя, [player]."
    y "Я думаю, из нас получится очень продуктивная команда."
    y 1u "Даже если ты меня выбрал из-за сострадания или чего-то подобного..."
    mc "Стоп!.."
    mc "Ты же на самом деле так не думаешь, правда?"
    y 4b "..."
    y "Я... не знаю."
    y "Очень сложно придумать другую причину, по которой ты мог бы выбрать меня..."
    mc "Ты забывала про единственно верную и логичную!"
    mc "Я выбрал помочь тебе, потому что хочу этого."
    y 2v "Н-но..."
    "Юри крепко задумалась, сильно нахмурившись."
    mc "Юри... ты слишком много об этом думаешь."
    mc "Ты хотела, чтобы я останавливал тебя, когда ты начнёшь лезть в дебри, не так ли?"
    y "Э?.."
    y 4 "Я... и не поняла..."
    mc "Я говорю тебе, что хочу это сделать."
    mc "Вот и всё."
    mc "Ты мне веришь?"
    y 1t "Я..."
    "Юри снова очень усердно задумалась."
    "Поймала мой взгляд и очень долго приглядывалась."
    y 3l "...Я верю тебе!"
    "Юри сказала это и тут же расслабилась с таким видом, будто бы мысли сильно измотали её."
    y 3s "И я с нетерпением жду воскресенья."
    mc "Да..."
    mc "Я тоже."
    show yuri zorder 1 at thide
    hide yuri
    "Ответил я, направившись к двери, и Юри пошла за мной."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
