label yuri_exclusive_1:
    scene bg club_day
    with wipeleft_scene
    "Мне было крайне любопытно побольше пообщаться с Юри..."
    "Но в то же время было бы невежливо отвлекать её от чтения."
    "Краем глаза я заметил обложку её книги."
    "Судя по всему, это та же самая, что она одолжила мне..."
    "Более того, она, судя по всему, не ушла дальше первых страниц."
    play music t6 fadeout 1.0
    show yuri 4a zorder 2 at t11
    y "А..."
    "Чёрт..."
    "Кажется, она заметила, что я смотрю на неё..."
    "Юри снова оглянулась на меня, и наши взгляды на долю секунды пересеклись."
    y 4b "..."
    "Но это лишь заставило её ещё сильнее зарыться в свою книгу."
    mc "Извини..."
    mc "Я что-то немного задумался..."
    "Пробормотал я, ощутив, что заставил её чувствовать себя неуютно."
    y 1i "Эм..."
    y "Ничего страшного..."
    y 1a "Если бы я не отвлекалась, то и не заметила бы вообще."
    y "Но я просто перечитывала кое-что и..."
    mc "Это же книга, которую ты дала мне, да?"
    y "Угу."
    y "Я хотела частично перечитать её."
    y 2q "Без какой-то особой на то причины!.."
    mc "Интересно, а как так получилось, что у тебя оказалось две одинаковых книги?"
    y "А..."
    y "Ну, я вчера зашла в книжный..."
    y 3o "То есть, всё было не так..."
    y "То есть..."
    y 1w "Так... получилось, что я купила сразу две."
    mc "А, вот оно что."
    "Юри явно не договаривала о чём-то вполне очевидном, но я решил не донимать её."
    mc "Я обязательно скоро начну её читать!"
    y 2u "Рада слышать..."
    y "Когда события наберут обороты, тебе не захочется от неё отрываться."
    y 2c "Это очень цепляющая история, героям которой хочется сопереживать."
    mc "Вот как?.."
    mc "А о чём она вообще?"
    y 1f "Ну..."
    y "Хм-м..."
    "Юри закрыла книгу и пробежалась глазами по её задней обложке."
    "Книга называлась \"Портрет Маркова\"."
    "На её передней обложке красовался зловещий символ в виде глаза."
    y 1a "Итак..."
    y "Я просто хотела убедиться, что случайно не раскрою никаких важных моментов."
    y "В общем, это история об ученице старших классов, которая съезжается со своей давно потерянной младшей сестрой..."
    y "Но как только она это делает, в её жизни начинают происходить странные вещи."
    y 1m "Её начинают преследовать беглые заключённые, ставшие жертвами экспериментов над людьми..."
    y "В момент, когда её жизнь находится под угрозой, ей отчаянно нужно решить, кому можно доверять, а кому — нет."
    y 1i "Вне зависимости от её выбора, она уничтожает большую часть своих отношений и её жизнь начинает рушиться..."
    mc "Это как-то!.."
    "Мрачновато, не правда ли?"
    "Юри преподносила эту историю как что-то приятное, посему такой безрадостный поворот событий стал для меня большим сюрпризом."
    y 1c "Ха-ха."
    "Юри ни с того ни с сего по-доброму улыбнулась."
    y "Не в восторге от подобного, [player]?"
    mc "Нет, дело не в этом..."
    mc "То есть я определённо могу насладиться чем-то подобным, так что не переживай."
    y 2u "Надеюсь..."
    "Да уж... Я совсем забыл, что Юри нравится такое."
    "Она с виду такая застенчивая и замкнутая, однако в её голове всё совсем иначе."
    y "Просто такие истории..."
    y 1a "Они предлагают читателю посмотреть на мир под новым, странным углом."
    y "Когда ужасные вещи происходят не потому, что кто-то просто хочет быть злым..."
    y 1m "А потому, что у всех есть свои цели или философские взгляды, которых они придерживаются."
    y "А потом, когда ты думаешь, что привязался к главному герою..."
    y "Его внезапно выставляют наивным дурачком, который позволил своим однобоким принципам помешать плану злодея."
    y 3v "Я... Я заговорилась, да?.."
    y "Ну вот опять..."
    y 4b "Извини..."
    mc "Эй, тебе не за что извиняться!.."
    mc "Я не потерял ни капли интереса."
    y "Ну..."
    y "Тогда ладно..."
    y 4a "Но мне показалось, что стоит рассказать тебе об этой своей привычке..."
    y "Когда я позволяю своим мыслям заполняться вещами вроде книг и того, как они написаны..."
    y "Я забываюсь и не обращаю внимания на собеседника..."
    y 3t "Поэтому извини, если я в итоге говорю нечто странное!"
    y "И, будь добр, останавливай меня, если стану заговариваться!"
    mc "Ну, как бы..."
    mc "Я не думаю, что тебе стоит так переживать..."
    mc "Это всего лишь означает, что ты очень страстно относишься к литературе."
    mc "Слушать тебя — меньшее из того, что я могу сделать."
    mc "Да и это литературный клуб, в конце концов..."
    y 4a "Э..."
    y "Это..."
    y "Ну да, верно..."
    mc "К слову..."
    mc "Мне бы уже пора начать читать, не так ли?"
    y 3n "Н-не обязательно!"
    mc "Ха-ха, ты чего?"
    mc "Ты буквально только что сказала, что ждёшь этого с нетерпением."
    y 3o "..."
    mc "Дай мне только достать книгу..."
    "Я быстро раздобыл книгу, которая лежала у меня в сумке."
    mc "Что ж... Не против, если я тут сяду?"
    "Я скользнул на место рядом с Юри."
    y 3n "Ой!.."
    y "Да..."
    mc "Точно?"
    mc "Ты выглядишь несколько напуганной..."
    y "Это..."
    y 4b "Извини..."
    y "Не то чтобы я была против!"
    y "Просто такие вещи для меня непривычны..."
    y "Читать вместе с кем-то, например."
    mc "Понятно..."
    mc "Ну, тогда скажешь, если я буду тебе мешать."
    y "Х-хорошо..."
    show yuri zorder 1 at thide
    hide yuri
    "Я открыл книгу и начал читать вступление."
    "Вскоре я понял, что Юри говорила о чтении в компании."
    "Я будто ощущал её присутствие за своим плечом, когда читал."
    "Это было не сказать, чтобы плохо."
    "Немного отвлекало, конечно, но в то же время это чувство было успокаивающим."
    "Я видел Юри краем глаза."
    "И заметил, что она не смотрит в свою книгу."
    "Я покосился на неё."
    "Похоже, он читала мою..."
    show yuri 3n zorder 2 at t11
    y "П-прости!"
    y "Я просто!.."
    mc "Юри, ты и правда слишком часто извиняешься."
    y "Я?"
    y 4a "Я это не нарочно..."
    y "Извини..."
    y 4c "То есть!.."
    mc "Ха-ха-ха."
    mc "Смотри, так будет удобнее, верно?"
    "Я придвинул свою парту впритык к парте Юри и расположил книгу посередине."
    y 2v "Ой..."
    y "Пожалуй..."
    "Юри робко закрыла свою копию книги."
    "Стоило бы нам чуть-чуть наклониться, и наши плечи бы коснулись друг друга."
    "Я почувствовал, что моя левая рука мешается, поэтому стал держать книгу правой."
    mc "Ой, теперь как-то сложновато переворачивать страницы..."
    y "Вот так..."
    $ persistent.clear[2] = True
    scene y_cg1_base with dissolve_cg
    "Юри поддержала книгу с другой стороны левой рукой, зажав её между своими большим и указательным пальцами."
    mc "О..."
    "Я повторил её действия своей правой рукой."
    "Таким образом, я переворачивал страницу, а Юри пропускала её под свой большой палец и прижимала."
    "Но при таком раскладе..."
    "Расстояние между нами уменьшилось ещё сильнее."
    "Это как бы отвлекает!.."
    "Я будто чувствовал тепло, исходившее от лица Юри: стоило мне перевести взгляд, и я бы увидел, насколько она близко..."
    show y_cg1_exp1 at cgfade
    y "Ты готов?.."
    mc "А?"
    y "Перевернуть страницу..."
    mc "А... Извини!"
    mc "Что-то на секунду отвлёкся..."
    "Я снова бросил взгляд в сторону Юри, и наши глаза встретились."
    "Я не был уверен, что смогу поспеть за ней..."
    y "Ой..."
    show y_cg1_exp2 at cgfade
    y "Ничего страшного."
    y "Ты не слишком много читаешь, верно?"
    y "Я совершенно не против подождать тебя, если ты не успеваешь..."
    y "Это, возможно, меньшее из того, что я могу сделать..."
    y "Раз уж ты был так терпелив со мной..."
    mc "А-ага..."
    mc "Спасибо."
    hide y_cg1_exp1
    hide y_cg1_exp2
    "Мы продолжили читать."
    "Юри больше не спрашивала меня, готов ли я перевернуть страницу."
    "Вместо этого я положился на то, что она заканчивала читать страницу раньше меня, и переворачивал её по своей необходимости."
    "Мы продолжали читать первую главу в тишине."
    "Несмотря на это, каждая перевёрнутая страница, казалось, была частью обмена чем-то личным..."
    "То, как мой большой палец отпускал страницу в свободное плавание на её сторону, где она ловила его своим."
    mc "Эй, Юри..."
    mc "Это может прозвучать глупо..."
    mc "Но главная героиня слегка напоминает мне тебя."
    show y_cg1_exp1 at cgfade
    y "Ты... так думаешь?"
    y "Каким образом?"
    mc "Ну, она, вообще-то, во многих вопросах значительно более прямолинейна..."
    mc "Но в то же время она сомневается по поводу всего, что говорит и делает."
    mc "Будто вечно боится сделать что-то не так."
    mc "Я, конечно, не могу заглянуть в твою голову..."
    mc "Но своим поведением она немного похожа на тебя."
    y "П-понятно..."
    scene bg club_day
    show yuri 2t zorder 2 at i11
    with dissolve_cg
    "Юри ненадолго замолчала."
    y "Но, [player]..."
    y "Это ведь..."
    y "...худшее сходство, которое у нас может быть!"
    y 4b "У-у, как стыдно, что ты так думаешь..."
    mc "П-подожди!"
    mc "Я не вкладывал в этого плохого смысла!"
    mc "Извини, я правда не думал, что ты заморачиваешься по поводу такого..."
    y "..."
    mc "Но я скорее имел в виду, что это довольно мило..."
    y 3q "А-ах..."
    y "Ты чего это так внезапно?.."
    y "Я!.."
    show monika 4 at l31
    m "Так, ребята!"
    show yuri 3n at h11
    y "!!!"
    show monika zorder 3 at f31
    m "Думаю, что нам пора обменяться друг с другом сегодняшними стихами."
    m "Если мы станем с этим слишком затягивать, то у нас просто не останется времени."
    show monika zorder 2 at t31
    show yuri zorder 3 at f11
    y 3w "Ух..."
    "Юри выдохнула, когда поняла, что ей не придётся заканчивать свою мысль."
    show yuri zorder 2 at t11
    show monika zorder 3 at f31
    m 1 "Всё хорошо, Юри?"
    m "Ты что-то поникла..."
    m "Мне жаль, если ты не очень-то ждала этого момента..."
    show monika zorder 2 at t31
    show yuri zorder 3 at f11
    y 3v "О, да нет..."
    y "Всё нормально."
    show yuri zorder 2 at t11
    show monika zorder 1 at thide
    hide monika
    "Юри отпустила свою сторону книги, и та захлопнулась на моём большом пальце."
    mc "Что ж..."
    mc "Надо бы почитать ещё сегодня вечером."
    mc "Или ты предпочитаешь, чтобы мы читали её только вместе?"
    y 2f "Эм!.."
    y "Мне... Наверное, не так уж и важно..."
    mc "Хм..."
    mc "В таком случае почитаю немного сегодня вечером."
    mc "Читать вместе будет намного веселее, когда начнут разворачиваться основные события, согласна?"
    y 2a "Да, звучит убедительно."
    y "Что ж, тогда можешь прочесть первые две главы самостоятельно."
    mc "Отлично!"
    show yuri zorder 1 at thide
    hide yuri
    "Я поднялся."
    "Запомнил страницу, на которой остановился, и кинул книгу в свою сумку."
    return

label yuri_exclusive_2:
    $ y_exclusivewatched = True
    play music t6 fadeout 1.0
    scene bg club_day
    with wipeleft_scene
    mc "Эй, Юри."
    show yuri 2f zorder 2 at t11
    y "Э?"
    mc "Оу..."
    "Я заметил, что на этот раз Юри читала совсем другую книгу."
    mc "Извини, не хотел тебе мешать..."
    y 2m "А, да нет..."
    y "Я вообще-то ждала тебя..."
    show yuri 2a
    mc "А, ну, в таком случае..."
label yuri_exclusive_2_ch3:
    mc "Почему бы нам уже не начать?"
    y 2c "Да, давай!"
    y 3a "А вообще, у меня есть к тебе просьба..."
    y "Не против, если я сначала заварю чай?"
    mc "Конечно нет."
    y 1c "Большое спасибо."
    y 1a "Если что-то и может помочь мне скрасить время за чтением книг здесь, так это чашечка хорошего чаю."
    y "Ну и тебе, заодно."
    show yuri zorder 1 at thide
    hide yuri
    "Юри встала и направилась к кладовке."
    "Я проследовал за ней и пронаблюдал за тем, как она достала оттуда небольшой графин с сетчатым фильтром внутри."
    show yuri 1f zorder 2 at t11
    y "Можешь подержать секунду?"
    mc "Конечно..."
    "Юри отдала мне графин и достала электрический чайник."
    y "Я сейчас подключу его у учительского стола, а потом сходим за водой."
    show yuri zorder 1 at thide
    hide yuri
    "Она прошла мимо меня и поставила чайник на учительский стол."
    "Я же просто смотрел, как она двигается."
    "К моему удивлению, её движения сильно расходились с манерой речи."
    "Длинные ноги Юри особенно подчёркивали её элегантность и методичность."
    show yuri 1f zorder 2 at t11
    y "Так, можно мне теперь графин?"
    y 1a "Спасибо. Я быстро."
    mc "Я, наверное, схожу с тобой..."
    y 1s "Ладно... Почему бы и нет?"
    y "Ну что, идём?"
    mc "Ага..."
    show monika 2a at l31
    m "М-м? Куда это вы?"
    show yuri 2e
    mc "Э?"
    mc "Мы просто... Юри собиралась сделать чаю, поэтому..."
    "Я внезапно осознал, как странно было пытаться объяснить это Монике."
    mc "Мы просто наберём воды..."
    show monika zorder 3 at f31
    m "А, хорошо!"
    m 4j "Извините, мне просто стало интересно..."
    m "С этим ведь и один человек может справиться, правда?"
    show monika 4a zorder 2 at t31
    mc "Ну..."
    show yuri zorder 3 at f11
    y 1k "Моника, пожалуйста, хоть иногда не лезь не в своё дело."
    y "Или ты имеешь что-то против того, чтобы [player] был больше вовлечён в быт клуба?"
    show yuri zorder 2 at t11
    show monika zorder 3 at f31
    m 1g "Э-эм?.."
    show monika zorder 2 at t31
    mc "!!!"
    "У меня челюсть отвисла."
    show monika zorder 3 at f31
    m 5a "Я..."
    m "Вроде ничего не имею против..."
    show monika zorder 2 at t31
    show yuri zorder 3 at f11
    y 2l "Хмпф..."
    y "Тогда идём, [player]."
    show yuri zorder 2 at t11
    mc "А..."
    "Юри быстрым шагом вышла из класса, а за ней и я."
    stop music fadeout 1.0
    scene bg corridor
    show yuri 4c zorder 2 at t11
    with wipeleft_scene
    "Как только мы оказались в коридоре, Юри уткнулась лбом в стену."
    y "Я сказала, совершенно не подумав..."
    y "Как я вообще смогла сказать такое?.."
    mc "Юри..."
    y 4b "Я просто..."
    y "Что-то в её тоне..."
    y "Так меня... взбесило."
    y "Что со мной не так?.."
    mc "Нет, Юри."
    mc "Я думаю... ты поступила правильно!"
    mc "Я этого не ожидал, но..."
    mc "Со стороны Моники тоже некрасиво вот так судить о ком-то."
    play music t9
    y 4a "[player]..."
    y "Почему, даже когда я делаю что-то плохое..."
    y "Ты так ко мне добр?"
    mc "Потому что."
    mc "Всё, что ты делаешь, выглядит так плохо только в твоём сознании."
    mc "Идеальных людей не бывает."
    mc "У всех нас есть эмоции, и мы не можем постоянно их прятать."
    mc "Но ты всегда всё преувеличиваешь..."
    mc "В твоей голове моросящий дождь превращается в ураган."
    y 3q "А-а..."
    y "Н-нет..."
    y "Ты разве не возненавидишь меня за подобное поведение?.."
    mc "С чего бы это?"
    mc "Я не могу ненавидеть кого-то за наличие эмоций..."
    mc "Какой друг так поступит?"
    y 4c "Друг... говоришь?"
    y "А...эм..."
    "Юри подняла голову."
    y 3w "[player]..."
    y 3t "Мне очень нравится... дружить с тобой!"
    mc "Ха-ха-ха..."
    mc "Спасибо, Юри."
    mc "Мне тоже нравится дружить с тобой..."
    "Говорить такое было несколько неловко..."
    "Но я изо всех сил старался поднять Юри настроение."
    mc "Короче!.."
    y 3u "А-а... Да..."
    y "Идём?"
    mc "Ага."
    show yuri zorder 1 at thide
    hide yuri
    "Мы подошли к ближайшему фонтанчику."
    "Наполнили графин и сразу же отправились обратно в класс."
    play music t6 fadeout 1.0
    scene bg club_day
    show yuri 1a zorder 2 at t11
    with wipeleft_scene
    y "[player], тебе нравится улун?"
    mc "А, да."
    mc "Мне всё пойдёт."
    y "Как скажешь."
    "Юри установила температуру в девяносто четыре градуса."
    y 1f "Теперь нужно достать чайник."
    mc "Надо же, ты очень серьёзно к этому относишься."
    y 1u "Конечно..."
    y "Я не могу себе позволить поступать иначе, когда готовлю чай для других."
    mc "Даже несмотря на то, что я далеко не чайный эксперт?.."
    y 2m "Хе-хе."
    y 2a "В таком случае ты будешь ещё больше впечатлён."
    mc "Хм... Вполне возможно!"
    show yuri zorder 1 at thide
    hide yuri
    "Юри достала чайник и начала подбирать чайные листки."
    "К моему удивлению, она даже начала что-то напевать себе под нос."
    show yuri 1c zorder 2 at t11
    mc "Ты, должно быть, сейчас в очень хорошем настроении..."
    y 1a "Ты думаешь?"
    y "Я не скрывала этого..."
    y "И ты заметил."
    y 2u "Я тут немного подумала..."
    y "И решила, что хочу выражать свои мысли и чувства более явно."
    y "Оказалось, что мне не так уж и сложно это делать..."
    y 1c "Во всяком случае, когда рядом со мной ты."
    mc "Эм..."
    mc "Это замечательно, Юри!"
    mc "Главное, не переутруждайся."
    y 3u "Ты всегда беспокоишься обо мне, [player]..."
    y "Это очень мило с твоей стороны."
    mc "Ну..."
    "Юри говорила правду..."
    "Я уже не знал, как мне с этим справляться!.."
    "Я наблюдал за тем, как Юри наливает нам чай."
    y 1a "[player], у меня есть ещё одна просьба."
    y "Ты не против, если мы сегодня сядем на полу?"
    mc "А? Зачем?"
    y 1h "Так легче для моей спины..."
    y "Так я смогу читать, оперевшись на стену, а не согнувшись над партой."
    mc "Оу, извини. Я даже и не подумал."
    y 1a "Ничего страшного."
    y "Просто у меня довольно часто болит спина, поэтому я стараюсь вести себя осторожнее."
    mc "Вот как?"
    mc "И почему же она у тебя болит?.."
    y 1f "Виной тому, скорее всего, моя..."
    y 1n "О-ох..."
    y 1o "М-моя..."
    mc "Твоя осанка, верно?"
    mc "Ты всё время прямо скрючиваешься, когда читаешь..."
    y 2p "Да!"
    y 2q "Во время чтения я сильно сутулюсь!"
    y "Поэтому давай лучше сядем на пол."
    mc "Договорились."
    mc "Схожу за книгой."
    show yuri zorder 1 at thide
    hide yuri
    "Я достал книгу из своей сумки."
    mc "О, у меня тут ещё есть конфеты..."
    "У меня была небольшая упаковка шоколадных конфет, которые я скрывал от конфетного радара Саёри."
    "Я достал её, ведь шоколадные конфеты хороши к чаю."
    "Затем мы с Юри расположились на полу и поставили чашки рядом с собой."
    "Мы синхронно заняли ту же позицию, что и в прошлый раз: каждый из нас держал свою сторону книги."
    "Только вот сейчас..."
    "Наши тела были ещё ближе друг к другу."
    show yuri 2h zorder 2 at t11
    y "Что-то я не очень хорошо вижу..."
    mc "!!!"
    show yuri 2e at d11
    "Юри пододвинулась ближе, так что теперь наши плечи соприкасались."
    "И как мне теперь сконцентрироваться на чтении?!"
    "Юри всегда была довольно милой, однако..."
    "Когда её пугливость притупляется, я сам начинаю дико смущаться!"
    y 2f "Твоя чашка..."
    "Юри протянула мне чашку."
    "Я взял её в руку, которая не была занята книгой, но теперь мне было ещё сложнее сконцентрироваться."
    "Потому что теперь мне приходилось постоянно следить за тем, как бы не коснуться её груди!.."
    "Между тем Юри ни на что не обращала внимания."
    "Её лицо приняло сосредоточенное выражение, такое, будто мир вокруг неё растворился."
    "Я собрал всю свою волю в кулак, чтобы сосредоточиться на чтении."
    "..."
    "Через несколько минут я наконец-то смог немного расслабиться."
    "Поставил чашку между своих ног и попытался избавить одну из конфет от обёртки."
    mc "Ой, извини..."
    "Я ненадолго выпустил книгу из рук, чтобы доразвернуть конфету."
    mc "Можешь брать, сколько захочешь."
    y 2s "А, ну..."
    y "Да ладно, я не буду..."
    mc "Хм? Точно?"
    y 2v "Ну..."
    y "Если я возьмусь за них, то могу потом запачкать страницы..."
    mc "А, точно..."
    mc "Я об этом даже не подумал."
    mc "Виноват..."
    y 2a "Не стоит извиняться."
    y "Я подержу книгу, хорошо?"
    mc "Ты уверена?.."
    y "Конечно."
    $ persistent.clear[3] = True
    scene y_cg2_bg
    show y_cg2_base
    show y_cg2_details
    show y_cg2_nochoc
    show y_cg2_dust1
    show y_cg2_dust2
    show y_cg2_dust3
    show y_cg2_dust4
    with dissolve_cg
    "Юри открыла книгу двумя руками."
    "Она держала её так, чтобы у меня не возникло проблем с чтением."
    "Как результат — её левая рука практически лежала на моей ноге."
    mc "Ну, в таком случае..."
    "Юри снова полностью погрузилась в чтение."
    "Я достал конфету и закинул её к себе в рот."
    "Потом достал следующую..."
    "И поднёс её к Юри."
    "Она даже не повернула голову в мою сторону."
    "Лишь приоткрыла свой рот, будто данная ситуация была для неё совершенно естественной."
    "А это означало, что у меня уже нет пути назад!"
    hide y_cg2_nochoc
    "Я боязливо вложил конфету в рот Юри."
    "А она просто взяла и обхватила её своими губами."
    y "Э?.."
    show y_cg2_exp2
    "Юри внезапно изменилась в лице."
    y "Что..."
    y "Что я сейчас..."
    "Юри смотрела на меня так, будто ей было необходимо подтверждение того, что сейчас произошло."
    show y_cg2_exp3
    show y_cg2_nochoc:
        alpha 0
        linear 0.5 alpha 1
    hide y_cg2_exp2
    y "Э-эм..."
    y "[player]..."
    mc "П-прости!"
    mc "Мне, наверное, не стоило этого делать..."
    y "Ну, это..."
    y "В общем..."
    y "Т-ты просто помог мне..."
    y "Так ведь поступают... друзья..."
    y "Верно?.."
    mc "Как бы..."
    "Не совсем в этом смысле, но..."
    mc "Да..."
    mc "И ничего более."
    y "Угу..."
    y "Значит..."
    y "Тебе не стоит сдерживать себя..."
    mc "П-понятно..."
    hide y_cg2_exp3
    "Ситуация стала крайне напряжённой..."
    "Юри попыталась вернуться к чтению."
    "Но мне достаточно было лишь взглянуть на её выражение лица, чтобы понять, что она сама больше не может сконцентрироваться."
    "Моё сердце громко стучало..."
    "Я с дрожью в руках взял ещё одну конфету."
    "Однако на этот раз Юри смотрела мне прямо в глаза."
    show y_cg2_exp3
    y "..."
    "Как вообще так вышло?.."
    "Юри не отводила взгляда."
    "Я обратил внимание на её грудь, которая вздымалась и опускалась в ритме её дыхания."
    "Я поднял руку..."
    y "А-а..."
    "Как и в прошлый раз, Юри приоткрыла рот."
    "Но... Теперь всё было по-другому."
    hide y_cg2_nochoc
    "Я положил конфету ей на язык."
    "И почувствовал её горячее дыхание на своих пальцах."
    stop music
    window hide(None)
    scene bg club_day
    window show(None)
    window auto
    show monika 4b zorder 2 at l31
    m "Так, ребята!"
    mc "Ва-а..."
    show yuri 3p zorder 2 at t11
    y "О-ой!"
    play music t3
    "Юри отскочила как ошпаренная."
    show yuri 3n
    show monika zorder 3 at f31
    m "Время обмениваться стихами!"
    m "[player], можешь помочь Юри убрать чайные принадлежности?"
    show monika zorder 2 at t31
    mc "Д-да... Конечно."
    show monika zorder 3 at f31
    m "Ага, спасибо!"
    show monika zorder 1 at thide
    hide monika
    "Момент был непоправимо испорчен."
    y 4c "Я..."
    y "Я уберу чашки..."
    mc "Угу..."
    show yuri zorder 1 at thide
    hide yuri
    "Юри подняла чашки с пола."
    "Я же забрал свою упаковку конфет."
    "Всё закончилось тем, что мы быстренько прибрались, не обменявшись при этом ни словом."
    "Я чувствовал, что никому из нас двоих не хватит смелости заговорить о том, что произошло..."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
