

label ch1_main:
    scene bg club_day
    with dissolve_scene_half
    play music t2
    show monika 5 zorder 2 at t11

    m "И снова привет, [player]!"
    m "Рада видеть, что ты не сбежал от нас. Ха-ха-ха!"
    mc "Не-а, не волнуйся."
    mc "Занятие для меня, конечно, непривычное, но я стараюсь держать слово."
    show monika zorder 1 at thide
    hide monika
    "Ну, я вернулся в литературный клуб."
    "Я зашёл последним, все остальные уже были в сборе."
    show yuri 1a zorder 2 at t32
    y "Спасибо, что держишь слово, [player]."
    y "Надеюсь, что ты не сковываешь себя этим обязательством."
    y 1u "Заставляем тебя погрузиться в литературу, когда ты не привык читать..."
    show natsuki 4e zorder 2 at t33
    n "Да ты чё! Нефиг ему сачковать."
    n "Саёри рассказала мне, что ты даже не собирался вступать в клубы в этом году."
    n "И в прошлом тоже!"
    n 4c "Я не в курсе, ты собрался просто тусоваться сюда приходить или ещё чё..."
    n "Но если не будешь относиться к нам всерьёз, то до конца не доживёшь."
    show monika 2b at l41
    m "Нацуки, у тебя слишком длинный язык для той, кто хранит свою коллекцию манги в помещении клуба."
    n 4o "М-М-М!.."
    show monika at lhide
    hide monika
    "Промычала Нацуки, разрываясь между словами \"Моника\" и \"Манга\"."
    show natsuki at h33
    n 1v "Манга — это литература!!!"
    show natsuki zorder 1 at thide
    hide natsuki
    "Огрызнулась напоследок Нацуки и плюхнулась на своё место."
    show yuri zorder 2 at t22
    show sayori 2x zorder 3 at f21
    s "Ребята, не волну-у-уйтесь!"
    s "[player] всегда выкладывается на полную, если ему интересно."
    s "Он помогает мне с работой, даже не спрашивая."
    s "Например, с готовкой или уборкой комнаты..."
    show sayori 2a zorder 2 at t21
    show yuri zorder 3 at f22
    y 2m "Такой надёжный..."
    show yuri zorder 2 at t22
    mc "Это потому, Саёри, что я не могу смотреть на твой кошмарный бардак."
    mc "А однажды ты вообще чуть не подожгла дом."
    show sayori at s21
    s 5 "Да ну... хи-хи-хи..."
    show yuri zorder 3 at f22
    y 1s "Вы очень близкие друзья, да?"
    y "Я, кажется, даже немного завидую..."
    show yuri zorder 2 at t22
    show sayori zorder 3 at f21
    s 1 "Как так? [player] может стать и твоим другом тоже!"
    show sayori zorder 2 at t21
    show yuri zorder 3 at f22
    y 4b "Эм-м..."
    show yuri zorder 2 at t22
    mc "С-Саёри..."
    show sayori zorder 3 at f21
    s "Хм-м?"
    show sayori zorder 2 at t21
    mc "..."
    "Саёри, как обычно, не заметила, в какое неловкое положение меня поставила."
    show sayori zorder 3 at f21
    s 4x "Ой, ой! Ты знаешь, Юри сегодня даже ко-о-ое что-о-о тебе принесла-а-а."
    show sayori zorder 2 at t21
    show yuri zorder 3 at f22
    y 3n "П-Постой! Саёри..."
    show yuri zorder 2 at t22
    mc "Что? Мне?"
    show yuri zorder 3 at f22
    y 3o "Эм... Не совсем..."
    show yuri zorder 2 at t22
    show sayori zorder 3 at f21
    s 4r "Не стесня-а-айся!"
    show sayori zorder 2 at t21
    show yuri zorder 3 at f22
    y "П-правда, ничего..."
    show yuri zorder 2 at t22
    mc "Что это?"
    show yuri zorder 3 at f22
    y 4c "Не бери в голову!"
    y "Саёри придала этому значение, которого нет..."
    y "О-о-ох, что я творю..."
    show yuri zorder 2 at t22
    show sayori zorder 3 at f21
    s 1g "Э-э? Прости, Юри, я не думала..."
    show sayori zorder 1 at thide
    hide sayori
    show yuri zorder 2 at t11
    "Я так понял, что спасение ситуации предоставлено мне..."
    mc "Эй, не переживай об этом."
    mc "Я вообще ничего такого не ожидал."
    mc "Так что любой твой жест вежливости будет приятным сюрпризом."
    mc "Меня это в любом случае порадует."
    y 3v "П-правда?.."
    mc "Да. Я не стану придавать этому значение, если ты не хочешь."
    y "Ладно..."
    y 1a "Тогда вот."
    "Юри потянулась за своей сумкой и достала оттуда книгу."
    y "Я не хотела, чтобы ты чувствовал себя обделённым..."
    y "Поэтому взяла книгу, которая предположительно могла бы тебе понравиться."
    y "Она короткая, так что должна удержать твое внимание, даже если ты не привык к чтению."
    y "И мы могли бы, ну... знаешь..."
    show yuri at sink
    y 4b "Обсудить её... Если хочешь..."
    "Э-Это..."
    "Откуда в ней столько естественного очарования?"
    "Она даже выбрала книгу, которая, по её мнению, мне понравится, несмотря на то, что я мало читаю..."
    mc "Спасибо, Юри! Я обязательно это прочту!"
    "Я с энтузиазмом принял книгу."
    show yuri 2m zorder 2 at t11
    y "Фух..."
    y 2a "Ну, ты можешь и не торопиться."
    y "Я подожду, пока ты сложишь мнение о ней."
    show yuri zorder 1 at thide
    hide yuri


    "Все расселись. Я ожидал, что теперь-то Моника раздаст нам какие-то плановые задания."
    "Но она, похоже, и не собиралась."
    "Саёри и Моника задорно беседовали в углу."
    "Юри уже успела уткнуться в книгу."
    "Я не мог не заметить её нетерпение, как будто она только и ждала этого момента."
    "А Нацуки тем временем закопалась в кладовку."


    $ nextscene = poemwinner[0] + "_exclusive_" + str(eval(poemwinner[0][0] + "_appeal"))
    call expression nextscene from _call_expression_25


    show monika 1 zorder 2 at t21
    hide sayori
    hide natsuki
    hide yuri
    m "Кстати, вы не забыли, что должны были вчера вечером написать стихотворения?"
    mc "Д-Да..."
    "Мой отдых закончился."
    "Я не мог поверить, что подписался на такой позор."
    "Вдохновения мне не очень-то хватило, учитывая, что прежде я подобным не занимался."
    m "Ну, раз все готовы, может, поищете, с кем бы обменяться?"
    show sayori 4q zorder 2 at t22
    s "Жду не дожду-у-усь!"
    show sayori zorder 1 at thide
    show monika zorder 1 at thide
    hide sayori
    hide monika
    "Саёри и Моника с энтузиазмом достали свои стихи."
    "Стихотворение Саёри было написано на мятой страничке, вырванной из блокнота на спирали."
    "А вот Моника свой записала в тетрадь."
    "Я даже со своего места видел её каллиграфический почерк."
    "Нацуки и Юри неохотно полезли в свои сумки."
    "Я сделал то же самое."

    return


label ch1_end:
    stop music fadeout 1.0
    scene bg club_day
    with wipeleft_scene
    play music t3
    mc "Фух..."
    "Вроде бы всё."
    "Я оглядел комнату."
    "Это было более напряжно, чем я ожидал."
    "Такое чувство, будто все оценивали мои посредственные писательские способности..."
    "Пускай мне не сказали ни одного плохого слова, но тем не менее мои стихи и близко не стояли с их."
    "Это ведь всё-таки литературный клуб."
    "Я вздохнул."
    "В конце концов, сам на это подписался."
    "На другом конце класса Саёри весело болтала с Моникой."
    "Мой взгляд упал на Юри и Нацуки."
    show yuri 2g zorder 2 at t21
    show natsuki 1g zorder 2 at t22
    "Они осторожно обменялись листами бумаги, делясь своими стихами."
    show yuri 2i at t21
    "Пока они обе читали, я выискивал малейшие проявления их эмоций."
    "Нацуки раздосадованно поморщилась."
    "А Юри печально улыбнулась."
    show natsuki zorder 3 at f22
    n 1q "{i}(Что с этим стилем?..){/i}"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 2f "А?"
    y "Эм... Ты что-то сказала?"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 2c "Ой, ничего."
    "Нацуки равнодушно протянула руку и оставила стихотворение на парте."
    n "Ты бы на моём месте сказала, что это довольно вычурно."
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 2i "Ох... Спасибо..."
    y "Твоё тоже... милое..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 2h "Милое?"
    n 1h "Ты чё, ваще не вникала в символизм?"
    n "Очевидно же, что оно о безнадёге."
    n "Как это может быть милым?"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 3f "Я... Я поняла!"
    y "Я просто имела в виду..."
    y 3h "Стиль, что ли..."
    y "Я пыталась сказать что-нибудь приятное..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n "Чё?"
    n 4w "Хочешь сказать, тебе офигеть как сложно придумать приятные слова?"
    n "Спасибо, конечно, но это было нифига не приятно!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 1i "Эм..."
    y "Ну, у меня есть пара советов..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 5x "Пф."
    n "Если бы мне нужны были советы, я бы спросила у тех, кому по-настоящему понравилось."
    n "А такие люди, кстати, {i}есть{/i}."
    n 5e "Саёри понравилось."
    n "И [player] тоже оценил!"
    n "Так что, пожалуй, я сама выдам тебе парочку советов."
    n "Во-первых..."
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 2l "Извини..."
    y "Я ценю твоё предложение, но я посвятила формированию собственного авторского стиля достаточно времени."
    y 2h "Я не собираюсь в нём что-то менять в ближайшее время, по крайней мере, пока не встречу новый источник вдохновения."
    y "А я его пока не нашла."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1o "Н-н...!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 1k "И к твоему сведению, [player] оценил и мой стих тоже."
    y "Он даже сказал, что восхищён."
    stop music fadeout 1.0
    "Нацуки резко встала."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 4y "О..."
    n "А я и не подозревала, что ты так выложилась ради того, чтобы произвести впечатление на нашего новичка, Юри."
    play music t7
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 1n "Что-о-о?!"
    y "Я совсем не!.."
    y 1o "Т-т..."
    y "Ты... Ты просто..."
    "Юри тоже вскочила."
    y 2r "По-моему, ты просто завидуешь, что [player] ценит мои советы больше, чем твои!"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1e "Ха! А с чего ты взяла, что он не ценит {i}мои{/i} советы больше?"
    n "Дофига самоуверенная?"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 3h "Я!.."
    y "Нет..."
    y "Если бы я была самоуверенной..."
    y 1r "...Я бы из кожи вон лезла, чтобы любое моё действие казалось миленьким!"
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1o "Т-т-т-т-т-ты!.."
    show sayori 2l behind yuri, natsuki at l41
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    s "Э-Эм!"
    s "Всё в порядке?.."
    show sayori 2 at lhide
    hide sayori
    show natsuki zorder 3 at f33
    n 1f "Так, знаешь что?!"
    n "Это не мои сиськи волшебным образом раздуваются, как только объявляется [player]!"
    show yuri 3p at h32
    show natsuki zorder 2 at t33
    y "Н-Нацуки!"
    show monika 3l behind yuri, natsuki at l41
    m "Эм, Нацуки, это уже немного..."
    show monika at h41
    show yuri 3p zorder 3 at f32
    show natsuki 1e zorder 3 at f33
    ny "Не лезь!"
    show monika at lhide
    hide monika
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    show sayori 4p behind yuri, natsuki at l41
    s "Я... не люблю ссоры, ребят!.."
    show sayori at lhide
    hide sayori
    show yuri zorder 2 at t21
    show natsuki 1g zorder 2 at t22
    "Внезапно обе девушки повернулись ко мне, как будто только заметив, что я стою рядом."
    show yuri zorder 3 at f21
    y 2n "[player]!.."
    y "Она... Она просто пытается выставить меня в плохом свете!.."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 4w "Неправда!"
    n "Она первая начала!"
    n 4e "Если бы она научилась ценить {i}простой{/i} стиль написания и смириться, что он более эффективен..."
    n "Тогда этого бы не произошло!"
    n "Зачем усложнять стихотворение на ровном месте?"
    n "Смысл должен выпрыгивать на читателя, а не заставлять заниматься его поисками."
    n 1f "Помоги мне объяснить ей это, [player]!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 3o "П-Подожди!"
    y "В нашем языке не просто так имеется множество глубоких и выразительных слов!"
    y 3w "Это единственный способ передать сложные чувства и смысл наиболее эффективно."
    y "Избегать их — это не только беспричинно себя ограничивать... Это вообще напрасный труд!"
    y 1t "Ты ведь это понимаешь, [player]?"
    show yuri zorder 2 at t21
    mc "Эм!.."
    show yuri 1t zorder 3 at f21
    show natsuki 1e zorder 3 at f22
    ny "Ну???"
    mc "..."
    show yuri zorder 2 at t21
    show natsuki 1g zorder 2 at t22
    "Каким боком меня сюда приплели?!"
    "Я вообще не особо разбираюсь в писательстве..."
    "Но с кем бы я ни согласился, это добавит мне авторитета!"
    menu:
        "И, конечно, это будет!.."
        "Нацуки.":
            call ch1_end_natsuki from _call_ch1_end_natsuki
        "Юри.":
            call ch1_end_yuri from _call_ch1_end_yuri
        "Саёри, спасай!!!":
            call ch1_end_sayori from _call_ch1_end_sayori

    scene bg club_day
    show monika 4b zorder 2 at t11
    with wipeleft_scene
    m "Так, ребята!"
    m "Пора бы уже расходиться."
    m "Как вам обмен стихами?"
    show monika 4a
    show sayori 4x zorder 2 at t31
    s "Было очень весело!"
    show sayori behind yuri at thide
    show yuri 1i zorder 2 at t31
    hide sayori
    y "Ну, можно сказать, что это того стоило."
    show yuri behind natsuki at thide
    show natsuki 4q zorder 2 at t31
    hide yuri
    n "Нормально. Ну, в основном."
    show natsuki zorder 1 at thide
    hide natsuki
    m 1a "[player], а ты что скажешь?"
    mc "...Скажу то же самое."
    mc "Было приятно пообщаться со всеми о стихах."
    m 1j "Великолепно!"
    m 1a "В таком случае на завтра делаем то же самое."
    m "К тому же вдруг вы чему-то друг у друга научились."
    m 3b "И ваши стихи станут ещё лучше!"
    mc "..."
    show monika zorder 1 at thide
    hide monika
    "Я задумался."
    "Я и правда узнал что-то новое о любимых стихотворных формах девушек."
    "Если повезёт, это поможет мне произвести впечатление на тех, на кого хочется."
    "Я кивнул себе с новообретённой решимостью."
    show sayori 1x zorder 2 at t11
    s "[player]!"
    s "Готов идти домой?"
    mc "Конечно, пошли."
    s 4q "Хи-хи-и-ии..."
    "Саёри просияла."
    "Мы и правда довольно давно уже не проводили вместе столько времени."
    "И не могу сказать, что мне это не нравится."
    scene bg residential_day
    show sayori 1a zorder 2 at t11
    with wipeleft_scene
    mc "Саёри..."
    mc "Насчёт того, что случилось..."
    s 1b "А? О чём ты?"
    mc "Ну это, между Юри и Нацуки."
    mc "Подобное происходит часто?"
    s 4j "Нет, нет, нет!"
    s "Я вообще в первый раз видела, чтобы они так ругались..."
    s "Клянусь, они замечательные девчонки."
    show sayori at s11
    s 1g "Они же... Они же не показались тебе неприятными?"
    mc "Да нет же!"
    mc "Я просто хотел узнать твоё мнение по поводу всего этого."
    mc "Теперь понятно, почему ты с ними дружишь."
    show sayori zorder 2 at t11
    s 1d "Фух..."
    s "Знаешь, [player]..."
    s "Приятно, что я могу проводить с тобой время в клубе."
    s "Но когда я вижу, как ты ладишь с другими, то становлюсь самой счастливой."
    s 1x "И мне кажется, ты всем понравился!"
    mc "Это!.."
    s 4q "Хи-хи-хи-и-и..."
    s "Каждый день будет та-а-аким весёлым..."
    mc "Эх..."
    "Похоже, Саёри до сих пор не осознала ситуацию, в которой я оказался."
    "Конечно, дружить со всеми - это классно, но..."
    "...Нужно ли останавливаться на этом?"
    mc "Просто нужно дождаться того, что приготовило для нас будущее, Саёри."
    "Я похлопал Саёри по плечу."
    "Я сказал это больше для себя, чем для неё, но Саёри можно легко использовать вместо внутреннего голоса."
    show sayori at h11
    s 1x "Оке-е-ей!"
    "Да..."
    "Сделаем это!"
    return

label ch1_end_natsuki:
    $ ch1_choice = "natsuki"
    stop music fadeout 1.0
    mc "Эм..."
    mc "Юри!"
    mc "Ты очень талантлива."
    show yuri 4a at s21
    y "А? Н-ну..."
    play music t8
    mc "Но Нацуки в чём-то права!"
    mc "Я считаю, что..."
    show yuri zorder 2 at t21
    "Я сломал мозг в попытках продолжить собственную мысль."
    mc "Я считаю, что передача чувств несколькими словами..."
    mc "Тоже может по-своему впечатлять!"
    mc "Это заставляет читателя подключать воображение."
    mc "И стихотворение Нацуки отлично справилось с этим!"
    show natsuki zorder 3 at f22
    n 5y "...Да!!!"
    n "Правда?!"
    n "А-ха-ха!"
    n "Видно, как много {i}ты{/i} знаешь!"
    show natsuki zorder 2 at t22
    show yuri zorder 3 at f21
    y 4b "Эт-то не..."
    show yuri zorder 2 at t21
    mc "Нацуки..."
    mc "Я думаю, достаточно."
    show natsuki zorder 3 at f22
    n 1m "А-а?"
    n "Я?"
    n "Но она мне нагрубила!.."
    "Проскулила Нацуки."
    show natsuki zorder 2 at t22
    mc "Слушай..."
    mc "Мы вчера говорили об одной очень правильной вещи."
    mc "Творчество — это очень личное."
    mc "И делиться им определённо непросто."
    mc "Похоже, сегодня мы это поняли."
    mc "Даже лёгкая критика может привести к горячему спору."
    "Я оглянулся через плечо."
    "Саёри энергично кивала."
    mc "Так что..."
    mc "Ты не должна чувствовать себя оскорблённой."
    mc "Ты замечательный писатель, Нацуки."
    show natsuki zorder 3 at f22
    n 1h "Эм..."
    "Нацуки от удивления потеряла дар речи."
    n 1q "...Спасибо, что заметил."
    "Пробормотала она в итоге чуть слышно."
    show natsuki zorder 2 at t22
    mc "Юри..."
    show yuri zorder 3 at f21
    y 4a "?.."
    "Юри расстроенно глянула на меня."
    "Выражение её лица заставило меня почувствовать себя виноватым."
    show yuri zorder 2 at t21
    mc "Я уверен, что Нацуки говорила не всерьёз."
    mc "Так что ты тоже не должна чувствовать себя оскорблённой."
    show yuri zorder 3 at f21
    y 2v "Ну..."
    y "Ну, если ты так считаешь..."
    show yuri zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1g "Эй!.."
    n "Не надо извиняться {i}за меня{/i}, [player]."
    n 1w "Блин."
    "Нацуки сделала глубокий вдох."
    n 1q "Я..."
    n "Дело в том..."
    n "Те..."
    "Нацуки огляделась."
    show natsuki zorder 3 at hf22
    n 1x "{i}Может, перестанете на меня пялиться??{/i}"
    "Неудивительно, что Нацуки трудно это даётся."
    "Саёри и Моника отвернулись."
    show natsuki zorder 3 at f22
    n 1i "Пф."
    n "Короче!.."
    n 1q "Насчёт твоих сисек. Я не хотела так говорить, окей?"
    n "Это всё."
    "Нацуки отвернулась, избегая прямых взглядов."
    show natsuki zorder 2 at t22
    show sayori 4x behind yuri at l41
    s "Да! Юри, ты красивая от природы!"
    mc "Саёри?!"
    show yuri 4c zorder 3 at f21
    y "..."
    y "Я... п-пойду сделаю чаю..."
    show yuri at lhide
    hide yuri
    show sayori zorder 3 at f41
    s 4h "Чего?.."
    s "Я же просто пыталась помочь!"
    show sayori zorder 2 at t41
    mc "Уверен, она это оценила, Саёри."
    "Я похлопал Саёри по плечу."
    show sayori zorder 1 at thide
    show natsuki zorder 1 at thide
    show monika 4m zorder 2 at t11
    hide sayori
    hide natsuki
    m "Ну, раз с этим мы закончили..."
    m 4b "Все же прочли стихи друг друга, верно?"
    m "Надеюсь, каждый извлёк из этого пользу!"
    m 5 "Особенно ты, [player]!"
    m "И честно сказать..."
    m "Это приятная смена обстановки, после того безделья, что у нас тут было."
    m "А-ха-ха-ха!"
    mc "О, выходит, моё вступление в клуб стало причиной разрушения атмосферы..."
    m 1d "Нет-нет, совсем нет!"
    m "У нас ещё осталось немного времени."
    m 1a "Так что давайте чуть-чуть отдохнём."
    m "Естественно, помимо общения, мы занимаемся ещё и вещами, связанными с литературой..."
    m "Так что попробуй почитать книгу или написать что-нибудь."
    m 1b "Всё-таки для этого клуб и существует!"
    show sayori 2j zorder 3 at f31
    s "Я не согласна, Моника!"
    show sayori zorder 2 at t31
    show monika zorder 3 at f32
    m 1d "А? По поводу?"
    show monika zorder 2 at t32
    show sayori zorder 3 at f31
    s 2i "Это не самое главное в литературном клубе!"
    s "Самое важное..."
    show sayori 4r zorder 3 at hf31
    s "Получать от этого удовольствие!"
    show sayori zorder 2 at t31
    show monika zorder 3 at f32
    m 2l "А-ха-ха, конечно..."
    m 2a "Наверное, поэтому ты и вице-президент, Саёри."
    show monika zorder 2 at t32
    show sayori zorder 3 at f31
    s 4q "Хи-хи-хи..."
    hide sayori
    hide monika
    with wipeleft
    "Всё-таки, в чём-то Моника права."
    "Находясь в литературном клубе, нельзя тратить время бесцельно."
    "Но в итоге..."
    "...Думаю, это того стоит."
    return

label ch1_end_yuri:
    $ ch1_choice = "yuri"
    stop music fadeout 1.0
    mc "Нацуки."
    mc "Ты права, мне действительно понравился твой стих."
    show natsuki zorder 3 at f22
    n 1e "Поняла?"
    show natsuki 1g zorder 2 at t22
    play music t8
    mc "Подожди!"
    mc "Но это не повод для того, чтобы так грубить!"
    mc "Нельзя устраивать ссору только потому, что твоё мнение с чьим-то не сходится."
    show natsuki zorder 3 at f22
    n 1m "Всё было не так!"
    n "Юри даже не приняла мой стих всерьёз!"
    show natsuki zorder 2 at t22
    mc "М-м..."
    mc "Я понял."
    mc "Юри."
    show yuri zorder 3 at f21
    y 2t "Что?"
    show yuri zorder 2 at t21
    mc "Ты и вправду талантливый писатель."
    mc "Не секрет, что я восхищён."
    show yuri zorder 3 at f21
    y 2u "Н-Ну, это..."
    show yuri zorder 2 at t21
    mc "Но вот что."
    mc "Независимо от того, простой используется стиль или утончённый..."
    mc "В это всё вкладываются ещё и чувства, и произведение становится чем-то очень личным."
    mc "Вот почему Нацуки оскорбилась, когда ты назвала её стихотворение милым."
    show yuri zorder 3 at f21
    y 2v "Я... поняла..."
    y "Я не обратила внимания. Я..."
    show yuri zorder 2 at t21
    y 2w "Я прошу прощения..."
    show yuri at s21
    y "Т-т-т..."
    show natsuki zorder 2 at t11
    show yuri zorder 1 at thide
    hide yuri
    mc "Тем не менее, Нацуки, ты переборщила!"
    mc "Юри бы всё поняла, если бы ты просто выразила свои чувства..."
    mc "Тогда бы этого всего не произошло."
    n 1e "Ты прикалываешься?"
    n "Я вообще-то так и сделала!"
    n "Это {i}она{/i} виновата, что..."
    show natsuki zorder 2 at t22
    show monika 2i zorder 3 at f21
    m "Нацуки, я думаю, хватит."
    m "Вы обе немного погорячились."
    m "Юри извинилась. Не считаешь, что тебе тоже стоит?"
    show monika zorder 2 at t21
    show natsuki zorder 3 at f22
    n 1x "Н-н-н!.."
    show natsuki zorder 2 at t22
    "Нацуки сжала кулаки."
    "Никто так и не встал на её сторону."
    "Она оказалась в ловушке, и упрямится только потому, что на неё давят."
    "В конечном итоге мне даже стало её жаль."
    show monika zorder 2 at t32
    show natsuki zorder 2 at t33
    show sayori 2h at l41
    s "Эм-м!"
    s "Иногда, когда мне больно..."
    s "Я выхожу прогуляться, освежить голову! Помогает!"
    show sayori zorder 2 at t41
    mc "Саёри, ей не нужно..."
    show natsuki zorder 3 at f33
    n 2q "Знаете, что?"
    n "А я так и сделаю."
    n 2w "Это избавит меня от необходимости смотреть на ваши лица."
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацуки порывисто схватила своё стихотворение со стола и вылетела из класса."
    "Выходя, она смяла листок и швырнула в урну."
    show sayori zorder 3 at f41
    s 1k "Нацуки..."
    show sayori zorder 2 at t41
    show monika zorder 3 at f32
    m 1r "Ей действительно не нужно было этого делать..."
    show sayori zorder 1 at thide
    show monika zorder 1 at thide
    hide sayori
    hide monika
    "Я оглядел комнату."
    "Подперев руками подбородок, Юри слепо смотрела на парту."
    "Я осторожно приблизился к ней и сел на соседний стул."
    show yuri 4b zorder 2 at t11
    y "Эх..."
    mc "Всё в порядке?"
    y "Так стыдно..."
    y "Не могу поверить, что так себя повела."
    y "Ты, наверное, сейчас ненавидишь меня..."
    mc "Нет... Юри!"
    mc "Такое отношение никому бы не понравилось."
    mc "Ты повела себя так, как повёл бы себя почти любой на твоём месте."
    mc "Я не стал думать о тебе хуже."
    y 2v "Ну..."
    y "...Ладно, я верю тебе."
    y 2s "Спасибо, [player]. Ты очень добрый."
    y "Я благодарна за то, что ты участник этого клуба."
    mc "Эм... Да ладно."
    y 2v "И ещё одно..."
    y "Гм, то, что сказала Нацуки..."
    y 4c "Насчёт... Того самого..."
    y "Я никогда бы не сделала ничего... Такого постыдного..."
    y "Так что..."
    mc "...Э-э?"
    mc "А что такого сказала Нацуки?"
    y 3n "!.."
    y "Эм-м!"
    y 3q "Ладно, не бери в голову..."
    y "Я... п-пойду сделаю чаю..."
    mc "О, хорошая идея."
    mc "Сделай побольше, окей?"
    y "К-Конечно."
    return

label ch1_end_sayori:
    $ ch1_choice = "sayori"
    mc "Н-Нацуки..."
    show natsuki 5f
    "Нацуки пялилась на меня так, что я аж потерял дар речи."
    "Поэтому я повернулся к Юри."
    mc "Юри..."
    y 4a "..."
    "Но Юри выглядела настолько беззащитно, что я не смог заставить себя хоть что-то ей сказать."
    stop music fadeout 1.0
    mc "..."
    mc "...Саёри!"
    show sayori 4m behind yuri at l31
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    s "А?!"
    mc "...Точно!"
    mc "Саёри не любит, когда ругаются."
    mc "Так как вы можете продолжать ругаться, когда знаете, что вашей подруге это неприятно?"
    show sayori zorder 3 at f31
    s 4d "[player]..."
    show sayori zorder 2 at t31
    show natsuki 4w zorder 3 at f33
    n "Ну... Это её проблемы! Её это не касается."
    show natsuki zorder 2 at t33
    show yuri 2g zorder 3 at f32
    y "Я с-согласна..."
    y "Это несправедливо — вмешивать свои чувства в наш конфликт."
    show yuri zorder 2 at t32
    show natsuki zorder 3 at f33
    n 4c "Да, если только Саёри не хочет рассказать Юри, какая она заносчивая овца."
    show natsuki zorder 2 at t33
    show yuri 3r zorder 3 at f32
    play music t7
    y "Она никогда не!.."
    y "Она расстроилась в первую очередь из-за твоей инфантильности!"
    show yuri zorder 2 at t32
    show natsuki 1e zorder 3 at f33
    n "{i}Прости{/i}, что?"
    n "Ты себя вообще слышала?"
    n 1x "Именно поэтому..."
    n 1w "Именно поэтому никто не любит..."
    show natsuki zorder 2 at t33
    show sayori 4p at h31
    stop music
    s "{i}Хватит!{/i}"
    show yuri 3f zorder 3 at f32
    show natsuki 1o zorder 3 at f33
    ny "..."
    show yuri zorder 2 at t32
    show natsuki zorder 2 at t33
    show sayori zorder 3 at f31
    play music t8
    s 1h "Нацуки! Юри!"
    s "Ребята, вы мои друзья!"
    s 1v "Я... я просто хочу, чтобы все дружили и были счастливы!"
    s "Мои друзья удивительные люди..."
    s "И я люблю их, потому что они такие разные!"
    s 1g "Стихи Нацуки..."
    s "Они потрясающие, потому что они несут столько эмоций всего в паре слов!"
    s "И стихи Юри тоже прекрасны, потому что рисуют такие красивые картины в твоей голове!"
    s 4k "Все такие талантливые..."
    s "...Так зачем вы ругаетесь?.."
    show sayori zorder 2 at t31
    show natsuki zorder 3 at f33
    n 1r "По-потому..."
    show natsuki zorder 2 at t33
    show yuri 3v zorder 3 at f32
    y "Ну..."
    show yuri zorder 2 at t32
    show sayori zorder 3 at f31
    s 1j "А ещё!"
    s "Нацуки милая, и ничего плохого в этом нет!"
    s 1i "А сиськи Юри такие же, как обычно!"
    show sayori at hf31
    s 1j "Большие и красивые!"
    show sayori 1i zorder 2 at t31
    show natsuki zorder 3 at f33
    n 1o "..."
    show natsuki zorder 2 at t33
    show yuri zorder 3 at f32
    y 3n "..."
    show yuri zorder 2 at t32
    mc "Саёри..."
    "Саёри победно поднялась."
    "Моника с недоумением на неё посмотрела."
    show yuri at s32
    y 3q "Я пойду... сделаю чаю..."
    show yuri behind sayori at lhide
    hide yuri
    "Юри умчалась."
    show natsuki zorder 1 at thide
    hide natsuki
    "Нацуки с отсутствующим видом опустилась на стул, глядя в никуда."
    show sayori zorder 1 at thide
    show monika 1i zorder 2 at t11
    hide sayori
    mc "Вот поэтому Саёри и вице-президент..."
    "Шёпотом сказал я Монике."
    "Она кивнула в ответ."
    m 1d "Честно говоря..."
    m "Я могу показаться хорошим лидером, и я умею организовывать..."
    m 3e "Но с коммуникабельностью у меня проблемы..."
    m "Я даже не смогла заставить себя вмешаться."
    m 1m "Как президенту мне неловко."
    m 1l "А-ха-ха..."
    mc "Ай..."
    mc "Не мне тебя винить."
    mc "Я тоже не смог ничего сказать."
    m "Ну..."
    m 2a "Я думаю, Саёри по-своему удивительна, правда?"
    mc "Можно сказать и так."
    mc "Может, она и легкомысленная, но иногда я начинаю подозревать, что она точно знает, что и зачем делает."
    m 5 "Поня-а-а-атно."
    m "Позаботься о ней, хорошо?"
    m "Я бы не хотела увидеть, как она себя казнит."
    mc "Значит, нас уже двое..."
    mc "Можешь рассчитывать на меня."
    "Моника мило улыбнулась мне, заставляя внутренности скрутиться в узел."
    "Что бы она ни говорила, такой искренний человек не может быть плохим президентом."
    "Если бы только у меня был шанс пообщаться с ней чуточку больше..."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
