label yuri_exclusive_1:
    scene bg club_day
    with wipeleft_scene
    "Мне очень хочется поговорить с Юри побольше..."
    "Но, с другой стороны, мне неудобно отвлекать её от чтения."
    "Мой взгляд упал на обложку её книги."
    "Кажется, это та самая книга, которую она дала мне..."
    "Более того, она прочитала всего пару страниц."
    play music t6 fadeout 1.0
    show yuri 4a zorder 2 at t11
    y "Ах..."
    "Чёрт--"
    "Кажется, она заметила, что я на неё смотрю..."
    "Она бросает на меня ещё один взгляд, и наши глаза встречаются на долю секунды."
    y 4b "..."
    "И это заставляет её спрятать своё лицо ещё глубже в книгу."
    mc "Прости..."
    mc "Я просто задумался..."
    "Я говорю это, чувствуя, что ей неуютно."
    y 1i "Ох..."
    y "Всё хорошо..."
    y 1a "Если бы я была сосредоточена, то всё равно бы ничего и не заметила."
    y "Я просто перечитываю книгу..."
    mc "Это та же книга, что ты дала мне?"
    y "Угу."
    y "Я хотела в ней кое-что перечитать."
    y 2q "Без какого-либо повода...!"
    mc "Как так вышло, что у тебя две копии одной и той же книги?"
    y "Эм..."
    y "Ну, когда я вчера зашла в книжный магазин--"
    y 3o "Ах, я не это имела в виду..."
    y "В смысле--"
    y 1w "Я... Так вышло, что я купила две."
    mc "А, понятно."
    "Юри явно что-то недоговаривает, но я решаю не обращать на это внимания."
    mc "Я обязательно начну читать эту книгу!"
    y 2u "Я рада это слышать..."
    y "Как только действия книги начнут набирать обороты, тебе будет тяжело от неё оторваться."
    y 2c "У неё очень атмосферная и цепляющая история."
    mc "Правда...?"
    mc "А о чём она?"
    y 1f "Ну..."
    y "Ммм..."
    "Юри закрывает книгу и рассматривает обложку."
    "Книга называется \"Портрет Маркова\"."
    "У неё на обложке изображён символ зловеще выглядящего глаза."
    y 1a "Отлично..."
    y "Я просто хотела убедиться, что случайно не сболтнула ничего лишнего про содержание этой книги."
    y "Если вкратце, она про школьницу, которая поступает в старшую школу и обнаруживает там свою давно потерянную старшую сестру..."
    y "Но как только она переезжает, её жизнь становится очень странной."
    y 1m "За ней начинают охотиться беглецы из лаборатории по испытаниям над людьми..."
    y "И, пока её жизнь в опасности, она в отчаянии ищет тех, кому может доверять."
    y 1i "Что бы она ни делала, всё заканчивается тем, что она рушит свои связи и отношения с другими людьми, и её жизнь начинает разваливаться..."
    mc "Это немного--!"
    "Это немного жутковато."
    "Звучало так, будто это должна быть хорошая история, но этот жуткий поворот событий появился из ниоткуда."
    y 1c "Ахаха."
    "Юри улыбается."
    y "Разве ты не фанат таких историй, [player]?"
    mc "Не совсем..."
    mc "Хотя, мне может и понравиться такое, так что не беспокойся."
    y 2u "Я надеюсь..."
    "Да... я совсем забыл, что Юри любит такие вещи."
    "Она такая застенчивая и отчуждённая снаружи, но внутри она совершенно другая."
    y "Просто такие истории..."
    y 1a "Они позволяют взглянуть на жизнь с совершенно новой, необычной перспективы."
    y "Когда ужасные вещи происходят не просто из-за того, что кто-то хочет быть злым..."
    y 1m "А потому, что у него есть свои цели, или взгляды на жизнь, в которые он верит."
    y "А потом, когда ты уже привязался к протагонисту..."
    y "Его показывают наивным человеком, который позволяет своей однобокой морали мешать планам антагониста."
    y 3v "Я... я заговорилась, да?"
    y "Только не снова..."
    y 4b "Прости..."
    mc "Эй, не нужно извиняться...!"
    mc "Я вовсе не потерял интерес."
    y "Тогда..."
    y "Я думаю, всё в порядке..."
    y 4a "Мне кажется, я должна тебе рассказать о своей проблеме..."
    y "Когда я позволяю чему-то вроде книг и поэм заполнить мои мысли..."
    y "Я перестаю обращать внимание на других людей..."
    y 3t "Так что, я прошу прощения, если сказала что-то странное!"
    y "И, пожалуйста, останови меня, если я начну слишком много говорить!"
    mc "Это--"
    mc "Я уверен, что тебе не нужно об этом беспокоиться..."
    mc "Это просто значит, что у тебя страсть к чтению."
    mc "Всё, что я могу сделать -- это слушать."
    mc "Это ведь Литературный Клуб, в конце концов..."
    y 4a "Ах--"
    y "Ну..."
    y "Ты прав..."
    mc "К слову..."
    mc "Не пора бы мне начать читать твою книгу?"
    y 3n "Т-ты не обязан!"
    mc "Ахаха, о чём ты говоришь?"
    mc "Недавно ты сказала, что была бы рада этому."
    y 3o "..."
    mc "Сейчас, я её достану..."
    "Я быстро вынимаю книгу из своей сумки."
    mc "Отлично... не против, если я сяду здесь?"
    "Я сажусь на место рядом с Юри."
    y 3n "Ах...!"
    y "Ладно..."
    mc "Ты уверена?"
    mc "Ты словно опасаешься..."
    y "Это..."
    y 4b "Прости..."
    y "Не то чтобы я не хотела, чтобы ты сел рядом!"
    y "Просто я не привыкла к такому..."
    y "К чтению с кем-то в компании."
    mc "Понятно..."
    mc "Хорошо, просто дай мне знать, если я буду тебя отвлекать."
    y "Л-ладно..."
    show yuri zorder 1 at thide
    hide yuri
    "Я открываю книгу и начинаю читать пролог."
    "Вскоре я понимаю, что Юри имела в виду, когда говорила про совместное чтение."
    "Я постоянно чувствую, что она находится рядом."
    "Это не то чтобы плохо."
    "Может, немного отвлекает, но чувство довольно успокаивающее."
    "Я замечаю Юри краем глаза."
    "И понимаю, что она не смотрит в свою книгу."
    "Я поворачиваюсь."
    "Похоже, что она читает из моей книги--"
    show yuri 3n zorder 2 at t11
    y "П-прости!"
    y "Я просто--!"
    mc "Юри, не слишком ли ты много извиняешься?"
    y "Я... Правда?"
    y 4a "Я не хотела..."
    y "Прости..."
    y 4c "Я хотела сказать--!"
    mc "Ахаха."
    mc "Вот, так лучше, правда?"
    "Я пододвигаю свой стол к её и стараюсь держать книгу между нами."
    y 2v "Ах..."
    y "Думаю, да..."
    "Юри закрывает свою копию книги."
    "Мы оба немного наклоняемся, и наши плечи теперь почти соприкасаются."
    "Кажется, что моя левая рука мешает, поэтому я беру книгу в правую."
    mc "Ах, похоже, что так будет сложно листать страницы..."
    y "Сейчас..."
    $ persistent.clear[2] = True
    scene y_cg1_base with dissolve_cg
    "Юри берёт левую сторону книги своей левой рукой и держит её между большим и указательным пальцами."
    mc "Ах..."
    "Я делаю то же самое своей правой рукой."
    "Таким образом, я переворачиваю страницу, и Юри кладёт её под свой большой палец."
    "Но, сидя в таком положении..."
    "Мы находимся ещё ближе друг к другу, чем раньше."
    "А ведь это, на самом деле, меня отвлекает...!"
    "Как будто я могу чувствовать тепло лица Юри, и она постоянно находится в поле моего зрения..."
    show y_cg1_exp1 at cgfade
    y "...Ты готов?"
    mc "А?"
    y "Перевернуть страницу..."
    mc "Ах... извини!"
    mc "Я на секунду отвлёкся..."
    "Я смотрю на лицо Юри, и наши взгляды встречаются."
    "Я не знаю, как я должен успевать за ней..."
    y "Ах..."
    show y_cg1_exp2 at cgfade
    y "Всё хорошо."
    y "Ты не привык читать?"
    y "Я могу подождать тебя..."
    y "Это меньшее, что я могу сделать..."
    y "Раз ты был со мной так терпелив..."
    mc "Д-да..."
    mc "Спасибо."
    hide y_cg1_exp1
    hide y_cg1_exp2
    "Мы продолжаем читать."
    "Юри больше не спрашивает, готов ли я переворачивать страницу."
    "Вместо этого, я предполагаю, что она уже закончила читать страницу быстрее меня, и переворачиваю её."
    "Мы читаем первую главу в полной тишине."
    "Даже так, пролистывание страниц ощущается как нечто интимное..."
    "Мой палец нежно отпускает страницу, которая начинает порхать на другую сторону, и Юри ловит её своим пальцем.."
    mc "Эй, Юри..."
    mc "Это может показаться глупым, но..."
    mc "Главная героиня немного напоминает тебя."
    show y_cg1_exp1 at cgfade
    y "Ты... так думаешь?"
    y "Чем же?"
    mc "Ну, я думаю, она грубовата во многих вещах..."
    mc "Но ещё она думает дважды перед тем, как что-то сказать или сделать."
    mc "Словно она боится сделать кому-то больно."
    mc "Не то чтобы я знал, что у тебя в голове..."
    mc "Но это чем-то напоминает мне твои манеры."
    y "Я-я понимаю..."
    scene bg club_day
    show yuri 2t zorder 2 at i11
    with dissolve_cg
    "Юри некоторое время молчит."
    y "Но, [player]..."
    y "Это, наверное..."
    y "...ужасная черта, которая меня с ней объединяет!"
    y 4b "Ах, так стыдно, что ты обо мне так думаешь..."
    mc "П-подожди!"
    mc "Я не говорил, что это плохо!"
    mc "Извини, я не думал, что тебя это так волнует..."
    y "..."
    mc "Мне кажется, что это немного мило..."
    y 3q "Э-эм--"
    y "О чём ты говоришь...?"
    y "Я...!"
    show monika 4 at l31
    m "Всем внимание!"
    show yuri 3n at h11
    y "...!"
    show monika zorder 3 at f31
    m "Кажется, наступило время показать всем поэмы, которые вы сочинили."
    m "У нас потом может не остаться на это времени."
    show monika zorder 2 at t31
    show yuri zorder 3 at f11
    y 3w "Ах..."
    "Юри вздыхает, избавленная от своих мыслей."
    show yuri zorder 2 at t11
    show monika zorder 3 at f31
    m 1 "Всё хорошо, Юри?"
    m "Ты выглядишь немного подавленной..."
    m "Прости, если ты этого не хотела..."
    show monika zorder 2 at t31
    show yuri zorder 3 at f11
    y 3v "Ах, это не так..."
    y "...Всё хорошо."
    show yuri zorder 2 at t11
    show monika zorder 1 at thide
    hide monika
    "Юри отпускает книгу из своей руки, заставляя её закрыться на моём пальце."
    mc "Отлично..."
    mc "Я думаю, что позже почитаю ещё."
    mc "Или, может, ты хочешь читать её со мной?"
    y 2f "Эм...!"
    y "Я... полагаю, что у меня нет особых предпочтений..."
    mc "Хмм..."
    mc "В таком случае, я сегодня почитаю ещё."
    mc "Будет веселее читать её вместе, после того, как события в книге наберут обороты, правда?"
    y 2a "Это хорошая мысль."
    y "Тогда не стесняйся закончить первые две главы в своё свободное время."
    mc "Хорошо!"
    show yuri zorder 1 at thide
    hide yuri
    "Я встаю."
    "Запомнив страницу, на которой мы остановились, я убираю книгу в сумку."
    return

label yuri_exclusive_2:
    $ y_exclusivewatched = True
    play music t6 fadeout 1.0
    scene bg club_day
    with wipeleft_scene
    mc "Эй, Юри."
    show yuri 2f zorder 2 at t11
    y "А?"
    mc "Ах..."
    "Я замечаю, что Юри читает не ту книгу, что мы читали вместе."
    mc "Извини! Я не хотел отвлекать..."
    y 2m "Нет..."
    y "Я ждала тебя..."
    show yuri 2a
    mc "Тогда..."
label yuri_exclusive_2_ch3:
    mc "Тогда, может, начнём?"
    y 2c "Да, давай!"
    y 3a "И ещё, у меня есть просьба..."
    y "...Не против, если я сделаю чаю?"
    mc "Совсем не против."
    y 1c "Спасибо большое."
    y 1a "Если и есть что-то, что помогает сделать моё время за чтением лучше, то это, определённо -- чашечка чая."
    y "Для тебя, разумеется, тоже."
    show yuri zorder 1 at thide
    hide yuri
    "Юри встаёт и подходит к шкафчику."
    "Я слежу за тем, как она достает небольшой кувшин для воды -- тот, что с фильтром внутри."
    show yuri 1f zorder 2 at t11
    y "Можешь подержать?"
    mc "Конечно..."
    "Юри даёт мне кувшин и достает электрический чайник."
    y "Я подключу его у стола учителя, ещё надо набрать немного воды."
    show yuri zorder 1 at thide
    hide yuri
    "Она проходит мимо меня и ставит чайник на стол учителя."
    "Я просто слежу за её движениями."
    "К моему удивлению, её движения контрастируют с её манерой говорить."
    "Особенно из-за её длинных ног, Юри выглядит элегантной и методичной."
    show yuri 1f zorder 2 at t11
    y "Хорошо, можно я возьму кувшин?"
    y 1a "Спасибо. Я сейчас вернусь."
    mc "Ах, давай я с тобой схожу..."
    y 1s "Хорошо... почему нет?"
    y "Тогда... пойдём?"
    mc "Да..."
    show monika 2a at l31
    m "Хм? Куда это вы оба собрались?"
    show yuri 2e
    mc "А-а?"
    mc "Мы просто... Юри хочет сделать немного чая, так что..."
    "Внезапно я понимаю, как мои объяснения странно звучат для Моники."
    mc "Мы просто хотим наполнить кувшин для воды..."
    show monika zorder 3 at f31
    m "Ах, ладно!"
    m 4j "Прости, мне просто было интересно..."
    m "Это ведь работа для одного человека, нет?"
    show monika 4a zorder 2 at t31
    mc "Это--"
    show yuri zorder 3 at f11
    y 1k "Моника, пожалуйста займись своими делами."
    y "Или ты хочешь сказать мне, что [player] не должен участвовать в клубной деятельности?"
    show yuri zorder 2 at t11
    show monika zorder 3 at f31
    m 1g "Ч-что...?"
    show monika zorder 2 at t31
    mc "--!"
    "У меня нет слов."
    show monika zorder 3 at f31
    m 5a "Я..."
    m "Я думаю, в этом нет ничего плохого..."
    show monika zorder 2 at t31
    show yuri zorder 3 at f11
    y 2l "Хм..."
    y "Тогда пойдём, [player]."
    show yuri zorder 2 at t11
    mc "Ах..."
    "Юри быстро выходит, я следую за ней."
    stop music fadeout 1.0
    scene bg corridor
    show yuri 4c zorder 2 at t11
    with wipeleft_scene
    "В коридоре она внезапно прислоняет свой лоб к стене."
    y "Я сказала не подумав..."
    y "Как я могла сказать что-то подобное...?"
    mc "Юри..."
    y 4b "Я просто..."
    y "Что-то насчёт того, что она сказала..."
    y "Заставило чувствовать меня такой... раздражённой."
    y "Что со мной не так...?"
    mc "Нет, Юри."
    mc "Я думаю... Ты поступила правильно!"
    mc "Я этого не ожидал, но..."
    mc "Моника не должна так судить людей."
    play music t9
    y 4a "[player]..."
    y "Почему, даже если я делаю что-то плохое..."
    y "Ты всё равно добр ко мне?"
    mc "Просто."
    mc "Ничего, из того что ты делаешь, не столь плохо, как тебе кажется."
    mc "Никто не идеален."
    mc "У нас есть эмоции, и мы не всегда можем их спрятать."
    mc "Но ты всегда преувеличиваешь всё в своей голове..."
    mc "Твой разум превращает лёгкий дождик в ураган."
    y 3q "Ах..."
    y "Н-нет..."
    y "Ты ведь не возненавидишь меня за что-то столь ужасное...?"
    mc "С чего это вдруг?"
    mc "Я не могу ненавидить кого-то за то, что у него есть эмоции..."
    mc "Какой друг так поступит?"
    y 4c "Ты сказал... друг?"
    y "Ах... эм..."
    "Юри поднимает свою голову."
    y 3w "[player]..."
    y 3t "Мне очень нравится... быть твоим другом!"
    mc "Ахаха..."
    mc "Спасибо, Юри."
    mc "Мне тоже нравится быть твоим другом..."
    "Я чувствую себя неловко, говоря что-то подобное..."
    "Но я делаю всё что могу, чтобы Юри чувствовала себя лучше."
    mc "В любом случае...!"
    y 3u "Ах-- да..."
    y "Пойдём?"
    mc "Ага."
    show yuri zorder 1 at thide
    hide yuri
    "Мы подходим к ближайшему фонтанчику."
    "Наполнив кувшин, мы сразу возвращаемся в класс."
    play music t6 fadeout 1.0
    scene bg club_day
    show yuri 1a zorder 2 at t11
    with wipeleft_scene
    y "[player], тебе нравится чай улун?"
    mc "А, да."
    mc "Любой пойдёт."
    y "Очень хорошо."
    "Юри выставляет на чайнике температуру в 90 градусов."
    y 1f "Теперь нужно взять заварочный чайник."
    mc "Ты что, завариваешь чай по всем правилам?"
    y 1u "Конечно..."
    y "Я должна сделать всё как нужно, когда завариваю чай для других."
    mc "Даже если я совсем не эксперт в чаях...?"
    y 2m "Ухуху."
    y 2a "В таком случае, ты будешь удивлён ещё сильнее."
    mc "Ах... ну посмотрим!"
    show yuri zorder 1 at thide
    hide yuri
    "Юри достаёт заварочный чайник и начинает отмерять количество чайных листьев."
    "К моему удивлению, она даже начинает напевать песенку."
    show yuri 1c zorder 2 at t11
    mc "У тебя, видимо, сейчас хорошее настроение..."
    y 1a "Правда?"
    y "Я хотела это показать..."
    y "И ты это заметил."
    y 2u "Я немного подумала..."
    y "И решила, что попробую выражать свои эмоции немного выразительнее."
    y "Оказалось, что это не так уж и сложно..."
    y 1c "Если делать это в твоей компании."
    mc "Ах..."
    mc "Это замечательно, Юри!"
    mc "Только не напрягай себя слишком сильно."
    y 3u "Ты всегда заботишься обо мне, [player]..."
    y "Это очень приятно."
    mc "Ну..."
    "Юри не шутит..."
    "Я даже не уверен, смогу ли со всем этим справиться...!"
    "Я наблюдаю, как Юри наполняет наши чашки."
    y 1a "[player], у меня есть ещё одна просьба."
    y "Ты не против, если мы посидим сегодня на полу?"
    mc "Эм? С чего это вдруг?"
    y 1h "Нагрузка на мою спину будет меньше..."
    y "Я смогу читать, уперевшись о стену, вместо того, чтобы наклоняться над партой."
    mc "Ах, прости, я не сразу понял."
    y 1a "Не беспокойся."
    y "Просто моя спина частенько побаливает, так что я стараюсь это исправить."
    mc "Правда?"
    mc "Интересно, почему..."
    y 1f "Это, скорее всего, из-за моей--"
    y 1n "Ах--"
    y 1o "М-моей..."
    mc "Твоей осанки, да?"
    mc "Всегда сутулишься, когда читаешь..."
    y 2p "Да!"
    y 2q "У меня ужасная осанка, когда я читаю!"
    y "Поэтому мы должны сесть на пол."
    mc "Логично."
    mc "Я схожу за книгой."
    show yuri zorder 1 at thide
    hide yuri
    "Я достаю книгу из моей сумки."
    mc "Ах, у меня с собой есть немного шоколада..."
    "Это пакетик небольших шоколадных конфет, который я прятал от конфетного радара Сайори."
    "Я взял их к чаю."
    "Мы с Юри садимся напротив стены, чашки с чаем по бокам."
    "Мы синхронно принимаем ту же позу для чтения, где каждый из нас держит половину книги."
    "Но в этот раз..."
    "Наши тела ещё ближе друг к другу."
    show yuri 2h zorder 2 at t11
    y "Я не очень хорошо вижу..."
    mc "--!"
    show yuri 2e at d11
    "Юри пододвигается ближе до тех пор, пока наши плечи не начинают соприкасаться."
    "Как я должен сосредоточиться на чтении...?!"
    "Юри всегда казалась мне немного милой, но..."
    "Сейчас она не такая замкнутая; ещё немного, и я не смогу сдерживаться!"
    y 2f "Твоя чашка..."
    "Юри подаёт мне мою чашку."
    "Держа её рукой, что не держит книгу, я оказываюсь в положении, в котором ещё сложнее сосредоточиться."
    "Теперь мне приходится следить за тем, чтобы случайно не дотронуться до её груди...!"
    "Тем временем, Юри даже ничего и не замечает."
    "По её серьёзному и увлечённому выражению лица я могу догадаться, что мир вокруг неё просто исчез."
    "Я использую всю свою силу воли, чтобы сосредоточиться на чтении."
    "..."
    "После нескольких минут, у меня получается немного расслабиться."
    "Я ставлю чашку между своих ног и начинаю возиться с упаковкой шоколадных конфет."
    mc "Ах, прости..."
    "Я медленно отпускаю книгу, чтобы закончить с упаковкой."
    mc "Можешь взять столько, сколько захочешь."
    y 2s "Ах, это..."
    y "Всё хорошо, я не буду брать..."
    mc "Эм? Ты уверена?"
    y 2v "Ну..."
    y "Если я возьму шоколад, то могу оставить пятна на страницах..."
    mc "Да, ты права..."
    mc "Я даже об этом не подумал."
    mc "Виноват..."
    y 2a "Не нужно извиняться."
    y "Я подержу книгу, хорошо?"
    mc "Ты уверена...?"
    y "Конечно."
    $ persistent.clear[3] = True
    scene y_cg2_bg
    show y_cg2_base
    show y_cg2_details
    show y_cg2_nochoc
    show y_cg2_dust1
    show y_cg2_dust2
    show y_cg2_dust3
    show y_cg2_dust4
    with dissolve_cg
    "Юри берёт книгу в обе руки."
    "Она держит её так, чтобы мне было проще читать."
    "Но в итоге, её левая рука практически лежит на моей ноге."
    mc "Ну, в таком случае..."
    "Юри уже полностью сфокусировалась на чтении."
    "Я беру конфету и кладу её себе в рот."
    "После, я беру ещё одну..."
    "И даю её Юри."
    "Она даже не отрывает свой взгляд от книги."
    "Она просто открывает свой рот, словно такая ситуация совершенно естественна."
    "Это значит, что я не могу на этом остановиться!"
    hide y_cg2_nochoc
    "Я опасливо кладу конфету ей в рот."
    "И как ни в чём не бывало, Юри берёт её губами."
    y "Эм...?"
    show y_cg2_exp2
    "Выражение Юри внезапно меняется."
    y "Я..."
    y "Я сейчас..."
    "Юри смотрит на меня, словно желая удостовериться в том, что сейчас произошло."
    show y_cg2_exp3
    show y_cg2_nochoc:
        alpha 0
        linear 0.5 alpha 1
    hide y_cg2_exp2
    y "Э-эм..."
    y "[player]..."
    mc "П-прости!"
    mc "Думаю, мне не стоило так делать..."
    y "Ах, это..."
    y "Ну..."
    y "Т-Ты просто помогал..."
    y "Это то, что... делают друзья..."
    y "...Да?"
    mc "В смысле..."
    "Не совсем в таком контексте, но..."
    mc "Да..."
    mc "...Так и есть."
    y "Ага..."
    y "Тогда..."
    y "Тебе не нужно останавливаться..."
    mc "Я-я понял..."
    hide y_cg2_exp3
    "Ситуация стала весьма напряжённой..."
    "Юри пытается вернуться к чтению."
    "Но по её выражению лица видно, что даже она уже не может сосредоточиться."
    "Моё сердце колотится..."
    "Я нервно беру шоколадку между своих пальцев."
    "Но в этот раз, наши взгляды встречаются."
    show y_cg2_exp3
    y "..."
    "Как до этого вообще дошло...?"
    "Юри не отводит свой взгляд."
    "Я замечаю, что грудь её поднимается и опускается в ритм дыхания."
    "Я поднимаю свою руку..."
    y "Ах..."
    "Юри ещё раз, так же, открывает свой рот."
    "Но... сейчас всё по-другому."
    hide y_cg2_nochoc
    "Я кладу конфету ей в рот."
    "Я чувствую её горячее дыхание на своих пальцах."
    stop music
    window hide(None)
    scene bg club_day
    window show(None)
    window auto
    show monika 4b zorder 2 at l31
    m "Все внимание!"
    mc "Ой--"
    show yuri 3p zorder 2 at t11
    y "У-Ух!"
    play music t3
    "Юри отодвигается назад."
    show yuri 3n
    show monika zorder 3 at f31
    m "Настало время делиться поэмами!"
    m "[player], ты можешь помочь Юри поставить всю посуду на место?"
    show monika zorder 2 at t31
    mc "Д-да... конечно."
    show monika zorder 3 at f31
    m "Хорошо, спасибо!"
    show monika zorder 1 at thide
    hide monika
    "Разговор резко прервался."
    y 4c "Я..."
    y "Я уберу чашки..."
    mc "Да..."
    show yuri zorder 1 at thide
    hide yuri
    "Юри поднимает чашки с пола."
    "Я забираю пакетик с конфетами."
    "Мы в спешке прибираемся без особых разговоров."
    "Такое чувство, что ни у кого из нас не найдётся смелости заговорить..."
    return
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
